{
  "events": [
    "Summer – Melus of Bari, a Lombard nobleman, revolts and is supported by Norman mercenaries at Capua. He marches into Apulia to catch the Byzantine army off-guard. Melus defeats the Byzantines on the banks of the Fortore River and ravages the territory in Apulia.",
    "Winter – Emperor Basil II (\"the Bulgar Slayer\") replaces Leo Tornikios with the new catapan Basil Boioannes and sends him reinforcements (including a detachment of the elite Varangian Guard) from Constantinople.",
    "January 6 – Cnut (\"the Great\") is crowned king of England. In July he marries Emma of Normandy, the widow of Æthelred the Unready, securing his ties with Normandy.[1]",
    "Cnut divides England into four earldoms: Wessex, Mercia, East Anglia and Northumbria.[1]",
    "Summer – Hamza ibn-'Ali ibn-Ahmad publicly declares the founding of the Druze religion, during the reign of the Fatimid Caliph Al-Hakim bi-Amr Allah.",
    "The Sunnis of Kairouan (modern Tunisia) revolt against the Shi'ite Zirid dynasty. The city is quickly retaken and sacked.[2]",
    "March – Fujiwara no Michinaga passes the title of regent of Japan (Sesshō) to his eldest son Fujiwara no Yorimichi.",
    "September\nPrince Atsuakira of Japan, eldest son of ex-Emperor Sanjō, having been struck by a skin disease and under intense pressure from Michinaga, resigns the title of Crown Prince in favour of his younger brother, Prince Atsunaga[3] who marries Fujiwara no Kanshi, daughter of Michinaga.\nMichinaga makes a pilgrimage to the Iwashimizu Shrine in Japan accompanied by many courtiers. The travelers divide themselves amongst 15 boats for a floating trip down the Yotogawa River. One of the vessels overturns and more than 30 people lose their lives.[3]",
    "Prince Atsuakira of Japan, eldest son of ex-Emperor Sanjō, having been struck by a skin disease and under intense pressure from Michinaga, resigns the title of Crown Prince in favour of his younger brother, Prince Atsunaga[3] who marries Fujiwara no Kanshi, daughter of Michinaga.",
    "Michinaga makes a pilgrimage to the Iwashimizu Shrine in Japan accompanied by many courtiers. The travelers divide themselves amongst 15 boats for a floating trip down the Yotogawa River. One of the vessels overturns and more than 30 people lose their lives.[3]",
    "December 24 – Michinaga is granted the honorary title Daijō-daijin of Japan.",
    "Rajendra I, ruler of the Chola dynasty (in modern India), conquers Sri Lanka and annexes the island.[4]",
    "Construction of Saint Sophia Cathedral, Kyiv is started (approximate date)."
  ],
  "births": [
    "October 28 – Henry III, Holy Roman Emperor (d. 1056) [5]",
    "Ahimaaz ben Paltiel, Italian-Jewish liturgical poet (d. 1060)",
    "Bermudo III (or Vermudo), king of León (approximate date)",
    "Floris I, count of Friesland west of the Vlie (approximate date)",
    "Ramanuja, Indian Sri Vaishnavism philosopher (d. 1137)",
    "Vikramabahu (Kassapa VI), king of Sri Lanka (d. 1041)",
    "Zhou Dunyi, Chinese philosopher and cosmologist (d. 1073)"
  ],
  "deaths": [
    "February 5 – Sancho García, count of Castile",
    "June 5 – Sanjō, ex-emperor of Japan (b. 976)",
    "June 22 – Leo Passianos, Byzantine general",
    "July 6 – Genshin, Japanese Tendai scholar (b. 942)",
    "September 18 – Henry of Schweinfurt, German nobleman",
    "October 6 – Wang Dan, Chinese Grand Chancellor",
    "Eadric Streona, ealdorman of Mercia",
    "Eadwig Ætheling, son of Æthelred II",
    "Elvira of Castile, queen consort of León",
    "Emnilda, duchess consort of Poland",
    "Fujiwara no Junshi, Japanese empress (b. 957)",
    "Judith of Brittany, duchess of Normandy (b. 982)",
    "Ma'mun II, Ma'munid ruler of Khwarezm",
    "Ramon Borrell, count of Barcelona (b. 972)",
    "Renaud of Vendôme, French nobleman"
  ]
}