{
  "events": [
    "Spring – Battle of Svindax: The Byzantine army under Emperor Basil II defeats the Georgians at Svindax (modern Turkey). King George I is forced to negotiate a peace treaty, ending the Byzantine–Georgian wars.",
    "Summer – Nikephoros Phokas (Barytrachelos) conspires with the Byzantine general Nikephoros Xiphias against Basil II. The rebellion collapses and Xiphias assassinates Phokas.",
    "Spring – Emperor Henry II divides his army into three columns and descends through Rome onto Capua. The bulk of the expeditionary force (20,000 men) led by Henry, makes its way down the Adriatic coast.",
    "Pilgrim, archbishop of Cologne, marches with his army down the Tyrrhenian coast to lay siege to Capua. The citizens open the gates and surrender the city to the imperial army.[1]",
    "Pilgrim besieges the city of Salerno for forty days. Prince Guaimar III offers to give hostages – Pilgrim accepts the prince's son and co-prince Guaimar IV, and lifts the siege.[2]",
    "Summer – Outbreak of the plague among the German troops forces Henry II to abandon his campaign in Italy. He reimposes his suzerainty on the Lombard principalities.",
    "King Olof Skötkonung dies and is succeeded by his son Anund Jakob (or James) as ruler of Sweden. He becomes the second Christian king of the Swedish realm.",
    "The 14-year-old Al-Mu'izz ibn Badis takes over, with support of the Zirid nobles, the government and ascends (as a minor) to the throne in Ifriqiya (modern Tunisia).",
    "The Chinese military has one million registered soldiers during the Song Dynasty, an increase since the turn of the 11th century (approximate date).",
    "After the Council of Orléans, King Robert II (the Pious) burns thirteen heretics at Orléans. These are the first burning victims for heresy in Medieval Europe.",
    "Pope Benedict VIII convenes a synod at Pavia. He issues decrees to restrain simony and incontinence of the clergy.[3]",
    "Æthelnoth, archbishop of Canterbury, travels to Rome to obtain the pallium, which is received by Benedict VIII.[4]"
  ],
  "births": [
    "Fujiwara no Nobunaga, Japanese nobleman (d. 1094)",
    "Harold II, king of England (approximate date)",
    "Manasses III, French nobleman (d. 1065)",
    "Michael Attaleiates, Byzantine historian (d. 1080)",
    "Ordulf, duke of Saxony (approximate date)",
    "Rajaraja Narendra, Indian ruler (d. 1061)"
  ],
  "deaths": [
    "March 12 – Symeon (the New Theologian), Byzantine monk (b. 949)",
    "March 23 – Zhen Zong, emperor of the Song Dynasty (b. 968)",
    "March 30 – Atenulf, Italian nobleman and Benedictine abbot",
    "June 28 – Notker III, German Benedictine monk and writer",
    "July 23 – Lei Yungong, Chinese palace eunuch and adviser",
    "August 15 – Nikephoros Phokas, Byzantine aristocrat",
    "September 2 – Máel Sechnaill II, High King of Ireland",
    "November 20 – Bernward, bishop of Hildesheim",
    "December 2 – Elvira Menéndez, queen of León",
    "Al-Shaykh Al-Mufid, Twelver Shia theologian",
    "Arikesarin, Indian ruler of the Shilahara Dynasty",
    "Aziz al-Dawla, Fatimid governor of Aleppo",
    "Konstantin Dobrynich, mayor of Novgorod",
    "Moninho Viegas, French knight (b. 950)",
    "Olof Skötkonung, king of Sweden",
    "Rededya, leader of the Kassogians",
    "Sidi Mahrez, Tunisian scholar (b. 951)"
  ]
}