{
  "events": [
    "Emperor Basil II prepares a Byzantine expedition to invade Sicily. Governor Ahmed al-Akhal appeals to the Zirids of Ifriqiya for help. They dispatch a fleet, but these are caught up in a storm and destroyed near Pantelleria.",
    "Battle of Lemnos:  Kievan Viking raiders (800 men) sail through the straits at Abydos to the Aegean Sea. From there they make for the island of Lemnos, but are defeated by a Byzantine fleet of the Cibyrrhaeot Theme.[1]",
    "July 13 – Emperor Henry II dies in his imperial palace at Göttingen (modern Germany). He leaves no heirs, thereby ending the Ottonian dynasty. The Salian dynasty of the Holy Roman Empire is founded by Conrad II.",
    "September – Conrad II (the Elder) is elected and crowned as King of Germany in Mainz, while both he and his cousin Conrad the Younger (son of Conrad I, duke of Carinthia) are invested as joint dukes of Franconia.",
    "Roger I of Tosny, a Norman nobleman, leaves the battlefield of the Ebro Valley after terrorising the Saracens and capturing several towns and castles during the Reconquista in the Iberian Peninsula (modern Spain).[2]",
    "May 13 – Fujiwara no Takako, daughter of influential Japanese statesman Fujiwara no Michinaga, is married to Minamoto no Morofusa.",
    "July 17 – In Japan, the Manju (万寿) era begins.",
    "Japanese waka poet Daini no Sanmi, lady-in-waiting to dowager Grand Empress Shōshi, is married to Fujiwara no Kanetaka.",
    "Japanese waka poet Sagami divorces, returns to Kyoto and becomes a lady-in-waiting to Imperial Princess Shushi.",
    "Murder of the daughter of the late Japanese Emperor Kazan, a lady-in-waiting to Shōshi who orders an investigation.",
    "The world's first paper-printed money, which later greatly benefits the economy of the Song dynasty, originates in the Sichuan province of China.",
    "Sultan Mahmud of Ghazni sacks the Hindu religious center of Somnath and takes away a booty of 20 million dinars (approximate date).",
    "April 9 – Pope Benedict VIII dies after a 12-year pontificate at Rome. He is succeeded by his brother John XIX as the 144th pope of the Catholic Church."
  ],
  "births": [
    "May 13 – Hugh the Great, abbot of Cluny (d. 1109)",
    "Al-Kunduri, vizier of the Seljuk Empire (d. 1064)",
    "Bruno II, margrave of Friesland (d. 1057)",
    "Fu Yaoyu, Chinese official and politician (d. 1091)",
    "Iziaslav I, Grand Prince of Kiev (d. 1078)",
    "Magnus the Good, king of Norway (d. 1047)"
  ],
  "deaths": [
    "April 9 – Benedict VIII, pope of the Catholic Church",
    "July 13 – Henry II, Holy Roman Emperor (b. 973)",
    "Abd ar-Rahman V, Umayyad caliph of Córdoba",
    "Alpert of Metz, French Benedictine chronicler",
    "Brihtwine, bishop of Wells (approximate date)",
    "Choe Hang, civil minister of Goryeo (Korea)",
    "Cúán úa Lothcháin, Irish poet and Chief Ollam",
    "Hugbert (or Hukbrecht), bishop of Meissen",
    "Sultan al-Dawla, Buyid emir of Fars (b. 993)"
  ]
}