{
  "events": [
    "August 4 – King Henry I (a member from the House of Capet) dies after a 29-year reign in Vitry-aux-Loges. He is succeeded by his 8-year-old son Philip I (the Amorous) as king of France. Philip is too young to rule, and his mother, Queen Anne of Kiev becomes regent. France is administered by Count Baldwin V (one of Philip's uncles) who acts as co-regent.[1][2][3]",
    "Summer – Norman forces under Duke Robert Guiscard invade Apulia, and capture the cities of Taranto and Brindisi (under control of the Byzantine Empire). Guiscard prepares a Sicilian expedition against the Saracens and returns to Calabria (Southern Italy), where his brother Roger Bosso waits with siege engines.[4][5][6]",
    "December 6 – Béla I (the Champion) is crowned king of Hungary after his nephew, Solomon is deprived of the crown. He is supported by Duke Bolesław II (the Generous) – who helps him (with Polish troops) to obtain the Hungarian throne.[7][8][9]",
    "The compilation of the New Book of Tang is completed, under a team of scholars led by Ouyang Xiu.[10][11][12]",
    "Cai Xiang, a Chinese calligrapher and official, publishes his essay Cha Lu (\"The Record of Tea\").[citation needed]",
    "Anselm enters the Benedictine Bec Abbey in Normandy, as a novice (approximate date).[13][14][15]"
  ],
  "births": [
    "February 9 – Honorius II, pope of the Catholic Church (d. 1130)[citation needed]",
    "September 18 – Godfrey of Bouillon, French nobleman (d. 1100)[16][17][18]",
    "Ava (or Ava of Göttweig), German poet (approximate date)[19][20]",
    "Aibert (or Aybert), French monk and hermit (d. 1140)[21][22]",
    "Bernard degli Uberti, bishop of Parma (approximate date)[23][24]",
    "Berthold I, German nobleman (approximate date)[citation needed]",
    "Berthold of Garsten, German priest and abbot (d. 1142)[25]",
    "Brahmadeva, Indian mathematician (d. 1130)[26][27]",
    "Clementia of Aquitaine, French noblewoman (d. 1142)[28]",
    "Diarmait Ua Briain, king of Munster (d. 1118)[citation needed]",
    "Duncan II, king of Scotland (approximate date)[29]",
    "Constantius Ducas, Byzantine emperor (d. 1081)[30]",
    "Diemoth (or Diemudis), German nun and writer (d. 1130)[31][32]",
    "Egbert II, German nobleman (approximate date)[citation needed]",
    "Erard I, French nobleman (approximate date)[33]",
    "Eric I (the Good), king of Denmark (approximate date)[citation needed]",
    "Felicia of Roucy, queen of Aragon and Navarre (d. 1123)[citation needed]",
    "Fujiwara no Mototoshi, Japanese nobleman (d. 1142)[34][35][36]",
    "Gaucherius, French priest and hermit (d. 1140)[37][38][39]",
    "Godfrey I, count of Louvain (approximate date)[40][41][42]",
    "Goswin I, count of Heinsberg (approximate date)[43]",
    "Gregory of Catino, Italian monk and historian[44][45][46]",
    "Hamelin de Ballon, Norman nobleman (approximate date)[47][48]",
    "Herman II, margrave of Baden (approximate date)[citation needed]",
    "Hui Zong, Chinese emperor (Western Xia) (d. 1086)[49]",
    "Mafalda of Pulla-Calabria, Norman noblewoman (d. 1108)[50][51][52]",
    "Odo of Tournai, bishop of Cambrai (d. 1113)[53][54][55]",
    "Odo I (the Red), duke of Burgundy (d. 1102)[citation needed]",
    "Olegarius, archbishop of Tarragona (d. 1137)[56][57]",
    "Ranulf Flambard, bishop of Durham (d. 1128)[58][59][60]",
    "Richard of Salerno, Norman nobleman (approximate date)",
    "Roger Borsa, Norman nobleman (or 1061)[61][62][63]",
    "Stephen Harding, English abbot (approximate date)",
    "Tokushi, Japanese empress consort (d. 1114)[64][65][66]",
    "Walo II (or Galon II), French nobleman (d. 1098)[citation needed]"
  ],
  "deaths": [
    "January 18 – Duduc (or Dudoc), bishop of Wells[67][68][69]",
    "May 12 – Matilda, duchess of Swabia (d. 1048)[70][71]",
    "August 4 – Henry I, king of France (b. 1008)[72][73][74]",
    "October 2 – Everelmus, French hermit[75][76]",
    "October 8 – Hugh V, French nobleman[77][78][79]",
    "October 15 – Luka Zhidiata, bishop of Novgorod[80][81]",
    "November 14 – Geoffrey II, count of Anjou[82][83][84]",
    "December 2 – Gebhard III, bishop of Regensburg[85][86][87]",
    "December 22 – Cynesige, archbishop of York[88][89][90]",
    "Abbas ibn Shith, king (malik) of the Ghurid Dynasty[91]",
    "Abdallah ibn Al-Aftas, founder of the Aftasid Dynasty[92]",
    "Ahimaaz ben Paltiel, Italian-Jewish liturgical poet (b. 1017)[93][94][95]",
    "Andrew I (the Catholic), king of Hungary[96][97][98]",
    "Chaghri Beg, co-ruler of the Seljuk Empire (b. 989)[99][100][101]",
    "Dharma Pala, ruler of the Pala Dynasty (b. 1035)[102]",
    "Dominic Loricatus, Italian monk and hermit (b. 995)[103][104][105]",
    "Emund the Old, king of Sweden (approximate date)[106][107][108]",
    "Esico of Ballenstedt, German nobleman (approximate date)[109][110]",
    "Igor Yaroslavich, prince of Smolensk (b. 1036)[111]",
    "Isaac I (Komnenos), Byzantine emperor[112][113]",
    "Mei Yaochen, poet of the Song Dynasty (b. 1002)[114][115][116]",
    "Otto I (or Odon), count of Savoy (approximate date)[117][118][119]",
    "Pons II (or Pons William), count of Toulouse (b. 991)[120][121][122]",
    "William I, Norman nobleman (approximate date)[123][124]"
  ]
}