{
  "events": [
    "January – Harold II marries Ealdgyth, daughter of Ælfgar (earl of Mercia), and widow of King Gruffydd ap Llywelyn.",
    "January 5 – Edward the Confessor dies after a 24-year reign at London. The Witenagemot (or Witan) proclaims Harold Godwinson king of England.",
    "January 6 – Harold Godwinson (or Harold II) is crowned king of England, probably in the new Westminster Abbey, where Edward the Confessor's funeral took place not long before the coronation.[1]",
    "March 20 – Halley's Comet reaches perihelion. Its appearance is subsequently recorded in the Bayeux Tapestry.",
    "September 12 – William the Conqueror assembles an invasion fleet (around 700 warships) at Saint-Valery-sur-Somme.",
    "September 18 – Harald Hardrada of Norway lands on the beaches of Scarborough and begins his invasion of England.",
    "September 20 – Battle of Fulford: Norwegian forces under Harald Hardrada defeat the English earls Edwin and Morcar.",
    "September 25 – Battle of Stamford Bridge: Harold II defeats the forces of Harald Hardrada and his own brother Tostig Godwinson.",
    "September 27 – William the Conqueror and his army set sail from the mouth of the River Somme, beginning the Norman conquest of England.",
    "September 28 – William the Conqueror lands on the English coast at Pevensey. He splits his forces, and sails with the main army to Hastings.[2]",
    "October 6 – Harold II marches south from Stamford Bridge (near York) to counter the threat of invasion from William the Conqueror.",
    "October 11 – Harold II arrives at London, but leaves a short time later. After a two-days march he and his army reaches Caldbec Hill.",
    "October 14 – Battle of Hastings: William the Conqueror and Harold II meet in battle at Hastings. Although Harold has the superior position on the battlefield, he is defeated and killed by William the Conqueror.",
    "October 15 – Edgar Ætheling is proclaimed king of England (but is never crowned). He is soon forced to submit to the rule of William the Conqueror.",
    "December – William the Conqueror moves along the south coast to Dover, and builds fortifications in the existing castle at the top of the cliffs.",
    "William the Conqueror moves to Canterbury and finally enters London. Archbishop Stigand and other English leaders submit to William's rule.",
    "December 25 – William the Conqueror is crowned as king William I of England in Westminster Abbey over Edward the Confessor's grave.",
    "Tain becomes the first town in Scotland to be chartered as a royal burgh by King Malcolm III (Canmore).[3]",
    "Huy becomes the first town in the Low Countries to be granted city rights, by Theodwin of Liège.[4]",
    "Hedeby (located on the Jutland Peninsula) is sacked and burned by the West Slavs, after which it is slowly abandoned.[5]",
    "The Republic of Genoa, jealous of the recent successes of its former allies, launches a naval assault on the Republic of Pisa.[6]",
    "King Stenkil (or Steinkell) dies after a 6-year reign. Two rivals named Eric battle for power in Sweden, both claiming the throne.",
    "Magnus II (Haraldsson), a son of Harald Hardrada, is crowned king of Norway. He unites Western Norway and Northern Norway.",
    "Fulk IV (the Quarreller) is at war with his brother Geoffrey III. They are fighting over the lands of Anjou and Touraine which has been left to them by their uncle Geoffrey II (Martel).",
    "December 30 – Granada massacre: A Muslim mob storms the royal palace in Granada, crucifies the Jewish vizier Yusuf ibn Naghrela [es], and massacres most of the Jewish population.[7]",
    "City of Šibenik first mentioned under its present name in a Charter of the Croatian King Petar Krešimir IV"
  ],
  "births": [
    "February 22 – Lý Nhân Tông, Vietnamese emperor (d. 1127)",
    "Al-Afdal Shahanshah, vizier of the Fatimid Caliphate (d. 1121)",
    "Gilbert Fitz Richard, English nobleman (approximate date)",
    "Godfrey of Amiens, French abbot and bishop (d. 1115)",
    "Henry, count of Portugal (House of Burgundy) (d. 1112)",
    "Irene Doukaina (or Ducaena), Byzantine empress (d. 1138)",
    "Wang Jha-ji, Korean politician and general (d. 1122)"
  ],
  "deaths": [
    "January 5 – Edward the Confessor, king of England",
    "February 3 – Rostislav of Tmutarakan, Kievan Rus' prince (b. 1038)",
    "February 12 – Everard I of Breteuil, French nobleman",
    "April 9 – Al-Bayhaqi, Persian Sunni hadith scholar (b. 994)",
    "May 21 – Su Xun, Chinese scholar and writer (b. 1009)",
    "June 6 – Gottschalk (or Godescalc), Obotrite prince",
    "June 27 – Arialdo, Italian nobleman and deacon",
    "August 15 – Al-Qadi Abu Ya'la, Arab Hanbali scholar (b. 990)",
    "September 25 (killed at the Battle of Stamford Bridge):\nEystein Orre, Norwegian nobleman\nHarald III (Harald Hardrada), king of Norway\nTostig Godwinson, earl of Northumbria",
    "Eystein Orre, Norwegian nobleman",
    "Harald III (Harald Hardrada), king of Norway",
    "Tostig Godwinson, earl of Northumbria",
    "September 25 – Maria Haraldsdotter, Norwegian princess",
    "October 14 (killed at the Battle of Hastings):\nHarold II (Harold Godwinson), king of England\nLeofwine Godwinson, brother of Harold II\nGyrth Godwinson, brother of Harold II\nTaillefer, Norman juggler (minstrel)",
    "Harold II (Harold Godwinson), king of England",
    "Leofwine Godwinson, brother of Harold II",
    "Gyrth Godwinson, brother of Harold II",
    "Taillefer, Norman juggler (minstrel)",
    "November 10 – John Scotus, bishop of Mecklenburg",
    "November 14 – Fujiwara no Akihira, Japanese nobleman",
    "December 11 – Conan II, duke of Brittany",
    "December 30 – Yusuf ibn Naghrela [es], Jewish vizier",
    "Abu al-Hakam al-Kirmani, Moorish philosopher",
    "Ali al-Sulayhi, sultan of Yemen and Tihamah (b. 966)",
    "Conrad of Pfullingen, archbishop of Trier",
    "Fulk of Vendôme (the Fool), French nobleman",
    "Godric the Sheriff, English sheriff (approximate date)",
    "Herluin de Conteville, Norman nobleman (b. 1001)",
    "Ibn Sidah, Moorish linguist and lexicographer",
    "Kraft of Meissen (or Crafto), German bishop",
    "Reiner of Meissen (or Rainer), German bishop",
    "Śrīpati, Indian astronomer and mathematician (b. 1019)",
    "Stenkil (or Steinkell), king of Sweden",
    "Theobald of Provins, French hermit (b. 1033)",
    "Udayadityavarman II, Cambodian ruler",
    "Yahya of Antioch, Byzantine historian"
  ]
}