{
  "events": [
    "Spring – Norman mercenaries led by Roussel de Bailleul proclaim John Doukas emperor of the Byzantine Empire. His nephew, Emperor Michael VII (Doukas), forms an alliance with Seljuk chieftain Suleiman ibn Qutulmish, who is raiding in the eastern regions of Anatolia. The Seljuk Turks ambush the Norman forces, Roussel and John are defeated and captured. But a ransom, raised by Roussel's wife, allows him to return to Amaseia.[1]",
    "February 2 – Treaty of Gerstungen: Emperor Henry IV is forced to restore the peace with Duke Otto of Nordheim (one of the Saxon leaders of the Saxon Rebellion). He signs a treaty in Gerstungen castle on the River Werra in Thuringia (modern Germany).",
    "February 7 – Battle of Montesarchio: Prince Pandulf IV, co-ruler of Benevento, is killed while fighting the Normans in southern Italy.",
    "March 14 – Battle of Mogyoród: King Solomon is defeated by his cousins, Duke Géza I and Ladislaus I. He is dethroned and Géza becomes the new ruler of Hungary.",
    "October 21 – The Belgium beer brand Affligem is founded.",
    "Spring – Badr al-Jamali becomes Chief Wazir (Grand Vizier) and effectively military dictator of the Fatimid Caliphate under Caliph Al-Mustansir Billah in Egypt.[2]",
    "Emperor Shen Zong of the Song Dynasty establishes a Marine Office and a Goods Control Bureau north-west of Shanghai, allowing for the loading and unloading of freight.",
    "Pope Gregory VII temporarily excommunicates the Norman nobleman Robert Guiscard."
  ],
  "births": [
    "February 12 – Conrad II, king of Germany (d. 1101)[3]",
    "September 16 – Al-Musta'li, Fatimid caliph (d. 1101)",
    "Abu Mansur Mauhub al-Jawaliqi, Arab philologist (d. 1144)",
    "Edgar (the Valliant), king of Scotland (d. 1107)",
    "Hugh I, count of Champagne (approximate date)",
    "Ibn al-Tilmidh, Syriac physician and poet (d. 1165)",
    "Maud, queen of Scotland (approximate date)"
  ],
  "deaths": [
    "February 7 – Pandulf IV, Lombard prince",
    "April 25 – Herman I, margrave of Baden",
    "May 6 – Dúnán (or Donat), bishop of Dublin",
    "October 25 – Shōshi, empress of Japan (b. 988)",
    "Ibn al-Wafid, Andalusian pharmacologist",
    "Joseph Tarchaneiotes, Byzantine general",
    "Peter Krešimir IV, king of Croatia (or 1075)",
    "Ralph IV (or Raoul), French nobleman",
    "Wugunai, Chinese chieftain (b. 1021)",
    "Yang Wenguang, Chinese general"
  ]
}