{
  "events": [
    "April 13 –The Grand Prince of Kiev Vsevolod I Yaroslavich dies, after a 15-year reign. He is succeeded by Sviatopolk II, who is acknowledged by other princes as the senior son of Iziaslav I, and ascends the Kievan throne as ruler of the Kievan Rus'. His cousin Vladimir II, prince of Chernigov, becomes a bitter rival.",
    "May 26 – Battle of the Stugna River: The nomadic Cumans defeat an Kievan joint force led by the princes of Kievan Rus' at the Stuhna River in the valley near Trepol. During the fightings Rostislav Vsevolodovich, prince of Pereyaslavl, drowns while fleeing the battle.[1]",
    "September 22 – King Olaf III (the Peaceful) dies after a 26-year reign. He is succeeded by his son Magnus III (Barefoot) who is proclaimed ruler of Norway at the Borgarting (or the Thing), an assembly by lawspeakers, in the region of Viken.",
    "March 6 – Anselm, Italian Benedictine abbot and theologian, becomes archbishop of Canterbury, succeeding Lanfranc. The post of archbishop has been held open (since 1089) by King William II – William Rufus or William (the Red) – so he can collect for himself the church's income.[2]",
    "November 13 – Battle of Alnwick: King Malcolm III invades Northumberland, but is killed by English forces under Earl Robert de Mowbray while besieging Alnwick Castle. He is succeeded by his brother Donald III (the Fair) who becomes ruler of Scotland.",
    "The Normans under Lord Robert Fitzhamon occupy southern Wales, constructing Cardiff and Pembroke Castles.[3]",
    "April 8 – Construction of Winchester Cathedral by the Norman bishop Walkelin is completed.",
    "August 11 – Construction of Durham Cathedral begins, replacing the Saxon 'White Church'."
  ],
  "births": [
    "January 16 – Isaac Komnenos, Byzantine co-ruler",
    "Ahmad Yasawi, Turkic poet and Sufi (d. 1166)",
    "Baldwin VII, count of Flanders (d. 1119)",
    "Conrad III, king of Italy and Germany (d. 1152)",
    "Demetrius I, king of Georgia (approximate date)",
    "Gerhoh of Reichersberg, German theologian (d. 1169)",
    "Grigor III, Armenian catholicos of Cilicia (d. 1166)",
    "Robert fitzEdith, English nobleman (d. 1172)",
    "Sancho Alfónsez, Spanish nobleman (d. 1108)",
    "Simon of Hauteville, count of Sicily (d. 1105)",
    "Simon of Vermandois, French bishop (d. 1148)",
    "William III, count of Ponthieu (approximate date)"
  ],
  "deaths": [
    "February 1 – Abul Hasan Hankari, Abbasid scholar (b. 1018)",
    "April 13 – Vsevolod I Yaroslavich, Grand Prince of Kiev (b. 1030)",
    "May 26 – Rostislav Vsevolodovich, prince of Pereyaslavl",
    "July 10 – Ulrich of Zell, German Cluniac reformer (b. 1029)",
    "August 4 – Alan Rufus, Breton/Norman nobleman (approximate year)",
    "August 24 – Geoffrey Boterel, Breton nobleman, eldest brother of Alan Rufus",
    "August 29 – Hugh I, French nobleman and abbot (b. 1057)",
    "September 22 – Olaf III (the Peaceful), king of Norway",
    "November 13 – Malcolm III, king of Scotland (b. 1031)",
    "November 16 – Margaret, queen of Scotland (b. 1045)",
    "Bertrand II, count of Provence (approximate date)",
    "Constance, queen of Castile and León (b. 1046)",
    "Gao, Chinese empress (Song Dynasty) (b. 1032)",
    "Iestyn ap Gwrgant, king of Morgannwg (b. 1014)",
    "Kaoruko, Japanese empress consort (b. 1029)",
    "Odo V (or Eudes), count of Troyes and Meaux",
    "Rhys ap Tewdwr, king of Deheubarth (b. 997)",
    "Robert I (the Frisian), count of Flanders",
    "Tzachas, Seljuk general and usurper",
    "Wang Shen, Chinese painter and poet"
  ]
}