{
  "events": [
    "Crusade of 1101: A second wave of European crusaders attempts to cross Anatolia, to reach the Kingdom of Jerusalem. They are defeated by the Seljuk troops under Sultan Kilij Arslan I, at Heraclea. A handful of crusaders under Raymond IV (Saint-Gilles) manage to reach the Byzantine port of Bafra, at the mouth of the River Halys.[1]",
    "Summer – The Byzantine fleet under Admiral Eustathios recaptures the ports of western Cilicia, Seleucia and Corycus. Eustathios extends his power over Cilician territory (belonging to Bohemond I) further east – occupying Tarsus, Adana and Mamistra.[2]",
    "Spring – King Baldwin I concludes an alliance with the Genoese fleet, offering them commercial privileges and booty. He captures the towns of Arsuf and Caesarea. Baldwin's crusaders pillage Caesarea and massacre the mayority of the local population.",
    "September 7 – Battle of Ramla: A Crusader force (some 1,100 men) under Baldwin I defeats the invading Fatimids at Ramla (modern Israel). Baldwin plunders the Fatimid camp and the survivors flee to Ascalon.",
    "June 22 – Roger I (Bosso), count of Sicily, dies at Mileto in Calabria after a 30-year reign. He is succeeded by his 8-year-old son Simon of Hauteville, while his mother, Adelaide del Vasto, acts as his regent.",
    "Summer – Almoravid forces under Sultan Yusuf ibn Tashfin besiege Valencia, which is defended by Jimena Díaz, widow of Rodrigo Diaz de Vivar (El Cid). The city holds out until May 1102.[3]",
    "Autumn – Countess Mathilda of Tuscany leads a successful expedition in northern Italy and takes Ferrara.",
    "The county of Berg in Germany is established.",
    "February 3 – Ranulf Flambard, bishop of Durham, escapes from the Tower of London and flees to Normandy. There he joins Robert II (Curthose), duke of Normandy, who has just returned from the Crusades.",
    "Summer – Robert II lands at Portsmouth with an army in an effort to take the throne from his brother, King Henry I. He is forced to sign the Treaty of Alton, giving up his claim to the English throne.",
    "A vast compilation of Liao, Korean, and Song Buddhist writings is completed (approximate date).",
    "Spring – Antipope Theodoric dies, the partisans of Emperor Henry IV choose Adalbert (or Albert) as the new antipope.",
    "April 19 – King Canute IV (the Holy) of Denmark is canonized as a saint under the name San Canuto.[4]",
    "Fontevraud Abbey is founded by the French preacher Robert of Arbrissel."
  ],
  "births": [
    "Abu al-Bayan ibn al-Mudawwar, Jewish physician (d. 1184)",
    "Arslan Shah I, Seljuk sultan of Kerman (d. 1142)",
    "Artaldus (or Arthaud), bishop of Belly-Ars (d. 1206)",
    "Fujiwara no Tamako, Japanese empress (d. 1145)",
    "Helena of Skövde, Swedish  noblewoman and saint (d. 1160)",
    "Ibn Bashkuwāl, Andalusian biographer (d. 1183)",
    "Stephen II, king of Hungary and Croatia (d. 1131)"
  ],
  "deaths": [
    "February 12 – Dao Zong, Chinese emperor (b. 1032)",
    "April 24 – Vseslav of Polotsk, Kievan prince",
    "May 16 – Liemar, archbishop of Bremen",
    "June 22 – Roger I (Bosso), Norman nobleman",
    "July 27\nConrad II, king of Germany and Italy (b. 1074)[5]\nHugh d'Avranches, Norman nobleman",
    "Conrad II, king of Germany and Italy (b. 1074)[5]",
    "Hugh d'Avranches, Norman nobleman",
    "August 24 – Su Shi, Chinese statesman and poet (b. 1037)",
    "September 30 – Anselm IV, archbishop of Milan",
    "October 5 – Uicheon, Korean Buddhist monk (b. 1055)",
    "October 6 – Bruno of Cologne, founder of the Carthusian Order",
    "October 18 – Hugh I (the Great), son of Henry I (b. 1057)",
    "November 6 – Welf I, German nobleman",
    "November 15 – Elvira of Toro, Leonese princess",
    "December 12 – Al-Musta'li, Fatimid caliph (b. 1074)",
    "Constantine Bodin, king of Duklja (approximate date)",
    "Egilbert (or Engelbert), archbishop of Trier",
    "Fujiwara no Morozane, Japanese nobleman (b. 1042)",
    "Geldemar Carpenel, French nobleman",
    "Geoffrey Burel of Amboise, French nobleman",
    "Gilla na Naemh Ua Dunabhra, Irish chief poet",
    "Guillaume de Montfort, bishop of Paris",
    "Ida of Austria, German duchess and crusader",
    "Nikon the Dry, Kievan monk and hermit",
    "Qingshui, Chinese Chan Buddhist monk (b. 1047)",
    "Su Song, Chinese statesman and scientist (b. 1020)",
    "Theodoric, antipope of the Catholic Church",
    "Urraca of Zamora, Leonese princess",
    "Walter of Albano, Italian cardinal-bishop"
  ]
}