{
  "events": [
    "King Stephen II of Hungary regains Dalmatia from Venice while the Venetians are on a naval expedition. Doge Ordelafo Faliero dies in battle (near Zadar) against the Hungarians. Faliero is succeeded by Domenico Michiel, who reconquers more territory and agrees to a 5-year truce with Hungary.",
    "Ramon Berenguer III (the Great), count of Barcelona,  inherits Cerdanya (located between the Pyrenees and the Ebro River) which becomes part of the Principality of Catalonia.",
    "Vladislaus I, duke of Bohemia, abdicates in favor of his brother Bořivoj II, but retains much of the actual power.",
    "The Almoravids briefly reconquer Coimbra (modern Portugal).[1]",
    "3 January - 1117 Verona earthquake. The earthquake was rated at VII (Very strong) on the Mercalli intensity scale, and struck northern Italy and Germany.[2] The epicentre of the first shock was near Verona, the city which suffered the most damage. The outer wall of the amphitheatre was partially felled, and the standing portion was damaged in a later earthquake of 1183. Many other churches, monasteries, and ancient monuments were destroyed or seriously damaged, eliminating much of Verona's early medieval architecture and providing space for a massive Romanesque rebuilding.[3]",
    "Battle of Ghazni: Seljuk forces under Ahmad Sanjar (supporting the claim of Bahram-Shah) invade Afghanistan and defeat the ruling Sultan Arslan-Shah. Bahram succeeds his brother as ruler of the Ghaznavid Empire.[4]",
    "Conflict between the de facto independent Muslim republics of Gabès and Mahdia (modern Tunisia) in Ifriqiya.[5] Madhia is supported by the Zirid Dynasty while Gabes receives the aid of Roger II, count of Sicily.",
    "The Crusaders led by King Baldwin I of Jerusalem raid Pelusium in Egypt and burn the city to the ground. Baldwin marches back to Palestine and strengthens the fortifications of the southern frontier.",
    "King Mahaabarana Adeettiya (Koimala) from the Theemuge Dynasty becomes the first king to rule over the whole Maldives. He reclaims the northern atolls from the Indian invaders.",
    "The sōhei or warrior monks of Mii-dera and Enryaku-ji unite their forces to attack Nara in Japan.",
    "Merton Priory (near London) is consecrated at Huntingdon. The priory becomes an important centre of learning and diplomacy in England.[6]",
    "The magnetic compass is first used for maritime navigation purposes during the Song Dynasty in China.[7]"
  ],
  "births": [
    "September 7 – Nicolò Politi, Italian hermit (d. 1167)",
    "Fujiwara no Nariko, Japanese empress (d. 1160)",
    "Gerard la Pucelle, bishop of Coventry (d. 1184)",
    "Henry I, count of Guelders and Zutphen (d. 1182)",
    "Humphrey II of Toron, constable of Jerusalem (d. 1179)",
    "Maurice of Carnoet, French Cistercian abbot (d. 1191)",
    "Otto I (the Redhead), duke of Bavaria (d. 1183)",
    "Robert FitzRanulph, English high sheriff (d. 1172)",
    "Simon III de Montfort, French nobleman (d. 1181)"
  ],
  "deaths": [
    "February 14 – Bertrade de Montfort, French queen (b. 1070)",
    "April 11 – Tescelin le Roux, Burgundian nobleman (b. 1070)",
    "April 14 – Bernard of Thiron, founder of the Order of Tiron (b. 1046)",
    "April 16 – Magnus Erlendsson, Norse earl of Orkney (b. 1080)",
    "September 1 – Robert de Limesey, bishop of Coventry",
    "December 9 – Gertrud of Brunswick, margravine of Meissen",
    "Abu'l-Fath Yusuf, Persian vizier of Arslan-Shah of Ghazna",
    "Abu Nasr Farsi, Persian statesman and poet (or 1116)",
    "Anselm of Laon (or Ansel), French theologian and writer",
    "Danxia Zichun, Chinese Zen Buddhist monk (b. 1064)",
    "Faritius (or Faricius), Italian abbot and physician",
    "Gertrude of Flanders, duchess of Lorraine (b. 1070)",
    "Gilbert Crispin, Norman abbot and theologian (b. 1055)",
    "Gilbert Fitz Richard, English nobleman (b. 1066)",
    "Lu'lu' al-Yaya, Seljuk ruler and regent of Aleppo",
    "Ordelafo Faliero (or Dodoni), doge of Venice"
  ]
}