{
  "events": [
    "Battle of Beroia: Emperor John II Komnenos transfers the Byzantine field army from Asia Minor (where it has been engaged against the Seljuk Turks) to the Balkans. The Pechenegs who have set up their camp (defended by a circular formation of wagons) near Beroia (modern Bulgaria) are defeated. John orders the Varangian Guard (some 480 men), the elite Palace Guard to hack their way through the Pecheneg circle of wagons, causing a general rout in their camp. Pecheneg survivors are taken captive and enlisted into the Byzantine army.[1]",
    "September 13 – Count Joscelin I and Waleran of Le Puiset are taken prisoner by Turkish forces led by Belek Ghazi near Saruj in northern Syria. Belek offers Joscelin liberty in return for the cession of Edessa. He refuses to accept these terms; Joscelin and Waleran and 60 other Crusaders are taken to the castle at Kharput.[2]",
    "August 8 –  A Venetian fleet under Doge Domenico Michiel with well over a hundred ships sets sail from Venice, carrying an army of around 15,000 men and siege-material. The fleet departs for Palestine – but the Venetians pause to attack Corfu (this in retaliation for the refusal of John II to renew exclusive trading privileges). For six months, throughout the winter of 1122–23, the Venetians lay siege to the Byzantine island.[3]",
    "King Alfonso the Battler of Aragon creates the lay community of knights known as the Confraternity of Belchite. It is the first local attempt to imitate the Order of the Knights Templar created in Palestine.[4]",
    "The Almoravid fleet attacks Sicily to suppress the Italo-Norman raiders.[5][page needed] The same year (related?), the Muslim population of Malta rebels against the Normans.",
    "Siege of Tbilisi: The Georgians led by King David IV ('the Builder') re-conquer the city of Tbilisi from the Emirate of Tbilisi after a 1-year siege. David makes it his capital and unifies the Georgian State.",
    "September 23 – The Concordat of Worms: Emperor Henry V recognizes freedom of election of the clergy and promises to restore all Church property. This bringing an end to the power struggle between the papacy and the Holy Roman Empire, known as the Investiture Controversy. In the aftermath, Cappenberg Abbey is founded by Count Gottfried II for the new order of Premonstratensians."
  ],
  "births": [
    "February 24 – Wanyan Liang, Chinese emperor (d. 1161)",
    "date unknown\nEleanor of Aquitaine, queen of France and England (d. 1204)\nFrederick I (Barbarossa), Holy Roman Emperor (d. 1190)\nFujiwara no Kiyoko, Japanese empress consort (d. 1182)\nIbn Hubal, Arab physician and scientist (approximate date)\nIsaac ben Abba Mari, French Jewish rabbi (approximate date)\nJayavarman VII, Cambodian ruler of the Khmer Empire (d. 1218)",
    "Eleanor of Aquitaine, queen of France and England (d. 1204)",
    "Frederick I (Barbarossa), Holy Roman Emperor (d. 1190)",
    "Fujiwara no Kiyoko, Japanese empress consort (d. 1182)",
    "Ibn Hubal, Arab physician and scientist (approximate date)",
    "Isaac ben Abba Mari, French Jewish rabbi (approximate date)",
    "Jayavarman VII, Cambodian ruler of the Khmer Empire (d. 1218)"
  ],
  "deaths": [
    "January 18 – Christina Ingesdotter, Kievan princess",
    "March 12 – Giso IV, count of Gudensberg (b. 1070)",
    "May 15 – Yejong, Korean ruler of Goryeo (b. 1079)",
    "August 9 – Cuno of Praeneste, German cardinal",
    "September 9 – Al-Hariri of Basra, Abbasid poet (b. 1054)",
    "October 20 – Ralph d'Escures, English archbishop",
    "November 8 – Ilghazi, Artukid ruler of Mardin",
    "November 28 – Ottokar II, margrave of Styria",
    "December 3 – Berthold III, duke of Zähringen",
    "December 4 – Henry III, duke of Carinthia",
    "date unknown\nAl-Baghawi, Persian hadith scholar and writer\nAlberada of Buonalbergo, duchess of Apulia\nJohn of Tours, Bishop of Wells\nSybilla of Normandy, queen of Scotland\nWang Jha-ji, Korean general (b. 1066)",
    "Al-Baghawi, Persian hadith scholar and writer",
    "Alberada of Buonalbergo, duchess of Apulia",
    "John of Tours, Bishop of Wells",
    "Sybilla of Normandy, queen of Scotland",
    "Wang Jha-ji, Korean general (b. 1066)"
  ]
}