{
  "events": [
    "March 2 – Charles I (the Good), count of Flanders, is murdered; he leaves no children. King Louis VI (the Fat) appoints William Clito (son of Robert Curthose) as new ruler. But the Flemish towns of Bruges, Ghent, Saint-Omer and Ypres recognize (with English financial support) Thierry of Alsace as rival count.",
    "Summer – King Roger II of Sicily claims the Hauteville possessions in Italy as well the overlordship of Capua. However, a coalition of Norman noblemen in Apulia and Calabria resist (supported by Pope Honorius II) against Sicilian rule. The same year, Roger regains control over Malta after a rebellion.[1]",
    "Roger II establishes a pact with the maritime Republic of Savona to guarantee the security of the Mediterranean Sea,[2] probably following an Almoravid raid against the Sicilian realm.[3]",
    "December 18 – Conrad III (with support of the imperial cities, Swabia and Austria) is elected and crowned as anti-king of Germany at Nuremberg.",
    "King Henry I arranges the marriage of his daughter Matilda (the widow of Emperor Henry V) to the 14-year-old Geoffrey of Anjou (son of Count Fulk V). This is done to ensure an alliance between England and Anjou, and to prevent Fulk allying with Louis VI.",
    "Henry I has the English nobles swear allegiance to Matilda as the rightful heir to the throne. She becomes Queen of England and Normandy when he dies.",
    "Imad ad-Din Zengi, a Turkish military leader, becomes governor (atabeg) of Mosul. He seizes the cities of Nisibin, Sinjar and Harran in the Jazira Region (Northern Mesopotamia).",
    "January 9 – Jin–Song Wars: Jurchen forces sack the Chinese capital of Kaifeng of the Northern Song Dynasty during the Jingkang Incident. They capture Emperor Qin Zong, along with his father, Hui Zong, and members of the House of Zhao.[4]",
    "June 12 – Qin Zong's younger brother, the 20-year-old Gao Zong, re-establishes the Song Dynasty (as the Southern Song Dynasty) in Lin'an (modern-day Hangzhou) and is proclaimed emperor.",
    "The Kalyan minaret (as part of the Po-i-Kalyan mosque complex) is completed in Bukhara (modern Uzbekistan)."
  ],
  "births": [
    "April 16 – Felix of Valois, French nobleman and hermit (d. 1212)",
    "May 23 – Uijong, Korean ruler of Goryeo (d. 1173)",
    "July 23 – Zhao Fu, emperor of the Song Dynasty (d. 1129)",
    "October 18 – Go-Shirakawa, Japanese emperor (d. 1192)",
    "November 27 – Xiao Zong, Chinese emperor (d. 1194)",
    "Bolesław I (the Tall), duke of Wrocław (d. 1201)",
    "Henry I (the Liberal), count of Champagne (d. 1181)",
    "Julian of Cuenca, Spanish bishop (approximate date)",
    "Yang Wanli, Chinese politician and poet (d. 1206)"
  ],
  "deaths": [
    "February 7 – Ava (or Ava von Göttweig), German poet (b. 1060)",
    "February 10 – William IX (the Troubador), duke of Aquitaine (b. 1071)",
    "March 2 – Charles I (the Good), count of Flanders (b. 1084)",
    "March 23 – Ottone Frangipane, Italian Benedictine monk (b. 1040)",
    "May 16 – Gens du Beaucet, French hermit and saint (b. 1104)",
    "August 12 – Jordan of Ariano, Norman warrior and nobleman",
    "September 1 – Álmos (or Almus), duke of Hungary and Croatia",
    "October 1 – Morphia of Melitene, queen of Jerusalem (or 1126)",
    "November 1 – Zhang Bangchang, ruler of Da Chu (b. 1081)",
    "November 12 – Godbald (or Godebald), bishop of Utrecht",
    "December 19 – Jordan II (or Giordano), prince of Capua",
    "Fujiwara no Hiroko, Japanese empress consort (b. 1036)",
    "Fulcher of Chartres, French priest and chronicler (b. 1059)",
    "Gilla Críst Ua Máel Eóin, Irish historian and abbot[5]",
    "Gualfardo of Verona, Italian trader and hermit (b. 1070)",
    "Minamoto no Yoshimitsu, Japanese samurai (b. 1045)",
    "William II, Norman duke of Apulia and Calabria (b. 1095)",
    "William III (the Child), count of Burgundy (b. 1110)",
    "Zhu, Chinese empress of the Song Dynasty (b. 1102)"
  ]
}