{
  "events": [
    "July 8 or August 21 – Jin–Song Wars – Battle of Yancheng: Song Dynasty general Yue Fei defeats an army led by Jin Dynasty general Wuzhu.[1]",
    "September 30 – A magnitude 7.7 earthquake strikes the Caucasus mountains in the Seljuk Empire, causing great devastation and killing 300,000 people.[2]",
    "January 25 – Godfrey II, Count of Louvain becomes Duke of Brabant.[3][4][5]",
    "April 8 – Second Council of the Lateran: Roger II of Sicily is excommunicated by Pope Innocent II.[6][7]",
    "April 9 – The Treaty of Durham is signed, between King Stephen of England and David I of Scotland.[8][9][10]",
    "July 22 – Pope Innocent II, invading the Kingdom of Sicily, is ambushed at Galluccio and taken prisoner.[11][12]",
    "July 25\nBy the Treaty of Mignano, Pope Innocent II proclaims Roger II of Sicily as King of Sicily, Duke of Apulia and Prince of Capua.[13][14][15]\nBattle of Ourique: The independence of Portugal from the Kingdom of León is declared after the Almoravids, led by Ali ibn Yusuf, are defeated by Prince Afonso Henriques. He then becomes Afonso I, King of Portugal, after calling the first assembly of the Estates-General of Portugal at Lamego, where he is given the Crown from the Bishop of Bragança, to confirm the independence.[16][17]",
    "By the Treaty of Mignano, Pope Innocent II proclaims Roger II of Sicily as King of Sicily, Duke of Apulia and Prince of Capua.[13][14][15]",
    "Battle of Ourique: The independence of Portugal from the Kingdom of León is declared after the Almoravids, led by Ali ibn Yusuf, are defeated by Prince Afonso Henriques. He then becomes Afonso I, King of Portugal, after calling the first assembly of the Estates-General of Portugal at Lamego, where he is given the Crown from the Bishop of Bragança, to confirm the independence.[16][17]",
    "King's School, Pontefract, in England is founded.",
    "April – Second Council of the Lateran: The Anacletus schism is settled, and priestly celibacy is made mandatory within the Catholic Church.[18][19][20]"
  ],
  "births": [
    "June 3 – Conon of Naso, Basilian abbot (d. 1236)[citation needed]",
    "June 16 – Emperor Konoe of Japan (d. 1155)[21][22]",
    "Agnes II – abbess and artist (d. 1203)"
  ],
  "deaths": [
    "January 25 – Godfrey I, Count of Louvain and Duke of Lower Lorraine (as Godfrey VI)[23][24][25]",
    "February 18 – Prince Yaropolk II of Kiev (b. 1082)[26][27]",
    "October 20 – Henry X, Duke of Bavaria[28][29]",
    "December – Roger of Salisbury, English bishop[30][31][32]",
    "Empress Xing of China (b. 1106)[33]"
  ]
}