{
  "events": [
    "February 2 – The Anarchy in the Kingdom of England – Battle of Lincoln: Robert, 1st Earl of Gloucester and Empress Matilda wrest control of the throne of England from King Stephen, who is captured and imprisoned.[1][2][3]",
    "February 13 – Géza II is crowned King of Hungary and Croatia at age 11, succeeding his father.[4][5]",
    "May 14 – Sephardi Jewish philosopher Judah Halevi sets off from Alexandria on a pilgrimage to Palestine.[6][7][8]",
    "September 9 – Battle of Qatwan: Yelü Dashi, founder of the Qara Khitai, defeats the Seljuk Empire and Kara-Khanid forces.[9][10][11]",
    "September 14 – The Anarchy in the Kingdom of England – Rout of Winchester: Empress Matilda returns to the throne, after Robert is captured by loyalist forces.[12][13][14]",
    "November 1 – The Anarchy in the Kingdom of England – Robert, 1st Earl of Gloucester is exchanged by Empress Matilda for King Stephen, who reassumes the throne of England.[15][16][17]",
    "November – The Jin dynasty and Southern Song dynasty sign the Treaty of Shaoxing, and peace in the Jin–Song Wars lasts for the next twenty years. The Huai River is established as the boundary between them.[18][19][20]",
    "The first German colonists (the future Transylvanian Saxon community) arrive in Transylvania, following grants by Geza II of Hungary. The colonization process is completed in 1162.[21][22][23]",
    "The Italian winemaking company Ricasoli is founded.[24][25]"
  ],
  "births": [
    "Malcolm IV, King of Scotland (d. 1165)[26][27]",
    "Nizami Ganjavi, Persian poet (d. 1209)[28][29][30] (Possibly 1140 or 1142)"
  ],
  "deaths": [
    "February 11 – Hugh of Saint Victor, Saxon philosopher, theologian and mystic (b. c. 1078)[31][32][33]",
    "February 13 – Béla II, King of Hungary and Croatia (b. c. 1109)[34][35][36]",
    "April 12 or April 13 – Engelbert, Duke of Carinthia[37][38][39]",
    "May – Aubrey de Vere II, Lord Great Chamberlain of England (b. 1062)[40][41]",
    "June 10 – Richenza of Northeim, German empress (b. c. 1087/89)[42][43][44]",
    "October 18 – Leopold, Duke of Bavaria (b. c. 1108)[45][46][47]",
    "Sheikh Ahmad-e Jami, Persian Sufi writer, mystic and poet (b. 1048)[48][49][50]",
    "Judah Halevi, Sephardi Jewish philosopher and poet (b. c. 1075)[51][52][53]",
    "Alberich of Reims, Archbishop of Bourges (b. 1085)[54][55][56]"
  ]
}