{
  "events": [
    "Spring – Emperor John II Komnenos and his sons lead a Byzantine expeditionary force across Anatolia to Antalya. He drives back the Seljuks and Turcomans – who again are trying to invade Phrygia. John strengthens the frontier defences in northern Syria and sends an embassy to Germany – to seek an alliance against King Roger II of Sicily. To seal the alliance, the emissaries request that King Conrad III send a princess of his family to be married to the emperor's son, Manuel. Instead, Conrad selects his sister-in-law, Bertha of Sulzbach, and sends her to the Byzantine Empire escorted by Emicho of Leiningen, bishop of Würzburg.[1]",
    "Late Summer – John II establishes a supply base for his further campaigns at Antalya. While waiting for reinforcements, his eldest son Alexios and appointed heir, falls ill and dies. His other two sons, Andronikos and Isaac are tasked to escort the body, but during the voyage Andronikos also dies. John continues his campaign against the Armenian kingdom of Cilicia – to re-conquer the fortresses that the Danishmends have taken. He appears by forced marches at Turbessel in mid-September.[2] Meanwhile, Isaac brings the corpses of his two brothers back to Constantinople, where they are entombed in the Pantokrator Monastery.",
    "King Louis VII the Younger of France becomes involved in a civil war with Theobald II (\"the Great\"), count of Champagne, by permitting his cousin Ralph I of Vermandois (seneschal of France) to repudiate his wife, Theobald's sister Eleanor of Champagne, and to marry Petronilla of Aquitaine, who was the sister of King Louis VII’s wife, Queen Eleanor of Aquitaine.",
    "Sigurd II, a Norwegian pretender, is joined in his efforts to overthrow the 7-year-old King Inge Haraldsson of Norway by Inge's older half-brother Eystein II, who becomes co-ruler. He receives one third of the late Harald's kingdom.",
    "May – Conrad III makes a peace agreement with the 13-year-old Henry the Lion at Frankfurt. He is appointed as duke of Saxony, which territories are deprived from his father, the late Duke Henry the Proud.[3]",
    "Duke Władysław II the Exile attempts to subject his younger (half)-brothers to re-unite Poland. He is supported by the alliances with the Kievan Rus' and the Holy Roman Empire.",
    "Summer – Conrad III enters Bohemia to reinstate his brother-in-law Vladislaus II as duke, whose half-sister Gertrude of Babenberg he is married. Conrad lays siege to the Prague Castle.",
    "Siege of Lisbon (1142): King Afonso I Henriques of Portugal attempts to besiege Lisbon with the aid of a group of Anglo-Norman crusaders.[4]",
    "Autumn – The 9-year-old Henry of Anjou, a son of Queen Matilda, lands on the south coast of England with his uncle, Earl Robert of Gloucester and several knights. Henry travels to Bristol, centre of Angevin opposition to King Stephen, where he is educated by Master Matthew. Meanwhile, Robert captures Lulworth Castle, Rufus Castle (\"Bow and Arrow Castle\") on the Isle of Portland and Wareham Castle.",
    "December – Stephen lays siege to Oxford Castle, trapping Matilda and her supporters inside the city. Just before Christmas she manages to escape across the snow and ice of the frozen Thames River – dressed in white (to get past Stephen's pickets), and safely reaches Abingdon. The next day Oxford Castle surrenders to Stephen, Matilda rides with an escort to Wallingford Castle, where she seeks refuge.",
    "Autumn – Imad al-Din Zengi, Seljuk governor (atabeg) of Mosul, continues his campaign against the Kurds in southeastern Anatolia (since 1141). Byzantine forces under John II fail to take Antioch.[5]",
    "Raymond II, count of Tripoli, grants property in the county (such as the massive castle Krak des Chevaliers) to the Knights Hospitaller. After acquiring the site, they begin building new fortifications.[6]",
    "Abd al-Mu'min, ruler of the Almohad Caliphate, is unable to feed his population during a famine. He recognize the de facto protectorate of Roger II to support the commercial center of Mahdia.[7]",
    "A Norman raid against the city of Tripoli fails.[8]",
    "January 5 – Emperor Sutoku abdicates the throne after a 19-year reign and becomes a monk. He is succeeded by his 3-year-old brother Konoe, who accedes as the 76th emperor of Japan.",
    "October 11 – Treaty of Shaoxing: The Jin Dynasty and Southern Song Dynasty sign a peace treaty, this ending the Jurchen campaigns against the Song Dynasty in China."
  ],
  "births": [
    "Al-Mustadi, caliph of the Abbasid Caliphate (d. 1180)",
    "Fujiwara no Takanobu, Japanese portrait painter (d. 1205)",
    "Hugh III of Burgundy, French nobleman (approximate date)",
    "Moinuddin Chishti, Persian preacher and philosopher (d. 1236)",
    "Taklung Thangpa Tashi Pal, Tibetan Buddhist leader (d. 1210)",
    "William I (the Lion), king of Scotland (approximate date)"
  ],
  "deaths": [
    "January 4 – Clementia of Aquitaine, French noblewoman (b. 1060)",
    "January 16 – Eilika of Saxony, German noblewoman (b. 1080)",
    "January 28 – Yue Fei, Chinese military leader and poet (b. 1103)",
    "April 21 – Peter Abelard, French scholastic philosopher (b. 1079)[9]",
    "June 25 – William of Montevergine, Italian abbot (b. 1085)",
    "June 28 – Guigues IV (le Dauphin), French nobleman",
    "July 27 – Berthold of Garsten, German priest and abbot (b. 1060)",
    "August 2 – Alexios (Komnenos), Byzantine co-emperor (b. 1106)",
    "September 10 – Sancho de Larrosa, Spanish bishop",
    "Abu Hafs Umar an-Nasafi, Persian scholar and historian (b. 1067)",
    "Andronikos (Komnenos), Byzantine prince (b. 1108)",
    "Arslan Shah I, Seljuk ruler of the Kerman Sultanate",
    "Conchobar Ua Briain, Irish king of Munster and Dublin",
    "Fujiwara no Mototoshi, Japanese nobleman (b. 1060)",
    "Orderic Vitalis, English monk and chronicler (b. 1075)[10]",
    "Reverter de La Guardia, viscount of Barcelona (or 1144)"
  ]
}