{
  "events": [
    "April 8 – Emperor John II (Komnenos) dies of a poisoned arrow wound while hunting wild boar on Mount Taurus in Cilicia. He is succeeded by his 24-year-old son Manuel I, who is chosen as his successor, in preference to his elder surviving brother Isaac. Manuel dispatches John Axouchos, his commander-in-chief (megas domestikos),  to Constantinople ahead of him – with orders to arrest Isaac in the Great Palace.[1]",
    "November 13 – King Fulk of Jerusalem dies after a hunting accident in Acre. He is succeeded by his 13-year-old son Baldwin III – who is crowned as co-ruler alongside his mother, Queen Melisende on Christmas Day. Due to the political situation the Crusader States of Tripoli, Antioch and Edessa assert their independence. Raymond of Antioch demands the return of Cilicia to his principality and invades the province.[2]",
    "Spring – King Conrad III gives Bavaria to his half-brother Henry II (Jasomirgott). His wife, Gertrude (daughter of the late Emperor Lothair III) dies in childbirth at Klosterneuburg Monastery in Lower Austria on April 18.",
    "October 5 – Treaty of Zamora: The Kingdom of Portugal is recognized by King Alfonso VII (the Emperor) of León and Castile in the presence of his cousin, King Afonso I of Portugal and papal representatives.",
    "Adolf II, count of Schauenburg and Holstein, founds Lübeck – which becomes later one of the leading Hanseatic cities. He divides the conquered Slavic lands, as part of the eastward expansion in Germany.",
    "Geoffrey V (the Fair) becomes duke of Normandy, upon news of the death of his father Fulk. He secures all of Normandy west and south of the Seine River.",
    "July 1 – Battle of Wilton: Earl Robert of Gloucester (illegitimate son of the late King Henry I) defeats the English forces of King Stephen during a surprise attack at Wilton Abbey. In the darkness, Stephen escapes, while his steward William Martel fights a rearguard action to delay the pursuers.",
    "Autumn – Stephen arrests Geoffrey de Mandeville, 1st Earl of Essex, during a meeting of the Royal Court at St. Albans. He is charged with treason against Stephen, but given his freedom back in return for surrendering his title and castles. Geoffrey becomes an outlaw and fortifies Ramsey Abbey, where he sets up his headquarters to plunder the countryside of Ely.",
    "Norman raiders capture Jijel (modern Algeria).[3] A Norman raid on Ceuta fails,[4] but at the same time the Normans lead a successful assault against Sfax.[5]",
    "September 23 – Pope Innocent II dies at Rome after a 13-year pontificate. He is succeeded by Celestine II as the 165th pope of the Catholic Church.",
    "Robert of Ketton makes the first European translation of the Qur'an for Peter the Venerable, Lex Mahumet pseudoprophete,  into Latin."
  ],
  "births": [
    "July 31 – Nijō, emperor of Japan (d. 1165)",
    "Balian of Ibelin, French nobleman (d. 1193)",
    "Beatrice I, Holy Roman Empress (d. 1184)",
    "Fujiwara no Motozane, Japanese waka poet (d. 1166)",
    "Jigten Sumgön, founder of the Drikung Kagyu (d. 1217)",
    "Konoe Motozane, Japanese nobleman (d. 1166)",
    "Mu'in al-Din Chishti, Persian preacher (d. 1236)",
    "Philip I (or Alsace), count of Flanders (d. 1191)"
  ],
  "deaths": [
    "January 12 – Leo of Constantinople, Byzantine patriarch",
    "January 26 – Ali ibn Yusuf, ruler of the Almoravids (b. 1084)",
    "February 6 – Hugh II of Burgundy, French nobleman (b. 1084)",
    "April 8 – John II (Komnenos), Byzantine emperor (b. 1087)",
    "April 18 – Gertrude, German duchess and regent (b. 1115)",
    "June 24 – Ermesinde, French noblewoman (b. 1080)",
    "August 2 – Muño Alfonso, Galician military leader",
    "September 23 – Innocent II, pope of the Catholic Church",
    "September 24 – Agnes, daughter of Henry IV (b. 1072)",
    "November 13 – Fulk (the Younger), king of Jerusalem",
    "December 24 – Miles of Gloucester, English nobleman",
    "Alexander of Telese, Italian chronicler and abbot",
    "Gilla Aenghus Ua Chlúmháin, Irish poet and writer",
    "Kogyo-Daishi, Japanese Buddhist priest (b. 1095)",
    "William of Malmesbury, English monk and historian",
    "Yelü Dashi, founder of the Qara Khitai (b. 1094)"
  ]
}