{
  "events": [
    "Late Summer – Emperor Manuel I (Komnenos) sends an embassy to Egypt to demand tribute, and threatens the country with war when they refuse to pay it. The Byzantine fleet under Admiral Andronikos Kontostephanos sets out from the Hellespont; 60 war galleys are sent to Palestine. with money for \"the knights of Jerusalem\". Andronikos with the rest of the fleet sails to Cyprus, at which he defeats a patrolling squadron of 6 Fatimid ships.[1]",
    "Spring – Gerald the Fearless, Portuguese warrior and knight, receives the support of King Afonso I (the Great). The Almohad caliph, Abu Yaqub Yusuf, manages to broker an alliance with King Ferdinand II against Afonso. The allies manage to besiege Badajoz, and finally take both Afonso and Gerald prisoner.[2]",
    "King Henry II of England and Louis VII sign a peace treaty which includes the betrothal of their respective heirs, the 11-year-old Richard I and the 8-year-old Alys of France (or Alice).[3]",
    "Andrey Bogolyubsky, Grand Prince of Vladimir-Suzdal, sacks Kiev (with help from allies) and makes Vladimir the capital of Kievan Rus'. He installs relatives on the throne at Kiev.",
    "During the Swedish power struggle, Boleslaw is killed, but his brother Kol continues as ruler of Östergötland (until 1173), in opposition to King Knut I (Eriksson) of Sweden.",
    "February 4 – 1169 Sicily earthquake: An earthquake with an estimated magnitude of around 7 strikes the eastern coast of Sicily, causing an estimated 15,000 deaths.",
    "Henry II makes an effort to end the strife between him and his wife, Queen Eleanor of Aquitaine, in order that he may dally in western Herefordshire with his mistress, Rosamund Clifford, the daughter of Walter de Clifford. He divides the succession to his kingdom among his four sons, Henry the Young King, Richard I, Geoffrey II and John.",
    "May – Norman invasion of Ireland: Anglo-Norman mercenaries land at the request of King Diarmaid mac Murchadha (Dermot).[4] Among those arriving is Richard de Clare (a vassal of Henry II), who has made an alliance with exiled Diarmaid mac Murchadha to help him regain the throne of Leinster. This begins the period of Anglo-Norman dominance of Ireland.",
    "Spring – A Zangid expedition under General Shirkuh accompanied by his nephew Saladin invades Egypt. King Amalric I of Jerusalem orders his fleet to return to Acre and retreats with the Crusaders back to Palestine.",
    "January 8 – Shirkuh enters Cairo, leaving the Zangid army encamped outside the city. He goes to the palace, where the 18-year-old Fatimid caliph Al-Adid welcomes him with ceremonial gifts and promised money.[5]",
    "January 18 – Shawar, Fatimid vizier and de facto ruler, is invited to join Shirkuh on a pilgrimage to the tomb of Al-Shafi'i. Underway he and his escort are taken prisoner; on orders from Al-Adid, Shawar is decapitated.[6]",
    "March 23 – Shirkuh dies from over-eating after a 2-month reign.[7] He is succeeded by Saladin, who is appointed chief vizier of the Fatimid Caliphate. He takes over as commander of Nur al-Din's forces in Egypt.[8]",
    "Summer – Saladin invites his brother Turan-Shah to join him in Cairo. He brings with him his family and retinue but also a substantial army provided by Nur al-Din. Turan-Shah is welcomed by Al-Adid as a friend.[9]",
    "August 21–23 – At the Battle of the Blacks, Saladin crushes a rebellion by Sudanese forces (50,000 men) of the Fatimid army, along with a number of Egyptian emirs and commoners. He never again has to face a military uprising from Cairo.[10]",
    "Winter – Saladin supported by reinforcements from Nur al-din, defeats a Crusader-Byzantine force under Amalric I near Damietta. During the 3-month siege, the Crusaders are forced to retreat to Palestine.[11]",
    "Eleanor of Aquitaine leaves the English court of Henry II, to establish her own court in Poitiers. It will become known as a center of courtly love. Richard I accompanies his mother and is made heir to Aquitaine."
  ],
  "births": [
    "September 10 – Alexios II Komnenos, Byzantine emperor (d. 1183)",
    "Ahi Evren, Bektashi Sufi preacher and philosopher (d. 1261)",
    "Al-Afdal ibn Salah ad-Din, Ayyubid ruler of Damascus (d. 1225)",
    "Eustace de Vesci, English nobleman and military leader (d. 1216)",
    "Ibn al-Mustawfi, Ayyubid governor and historian (d. 1239)",
    "Fujiwara no Yoshitsune, Japanese nobleman (d. 1206)",
    "Muhammad II, Khwarezmid viceroy and ruler (d. 1220)",
    "Nasu no Yoichi, Japanese samurai (approximate date)",
    "Taira no Atsumori, Japanese samurai (d. 1184)"
  ],
  "deaths": [
    "January 13 – Bertrand de Blanchefort, French Grand Master",
    "January 18 – Shawar, Fatimid vizier and de facto ruler",
    "February 4 – John of Ajello, Italian bishop of Catania",
    "February 6 – Thoros II (the Great), prince of Armenia",
    "March 23 – Shirkuh, Zangid general and chief vizier[12]",
    "May 21 – Berthold of Zwiefalten, German abbot",
    "July 9 – Guido of Pisa, Italian geographer",
    "Abu'l-Hasan Bayhaqi, Persian polymath",
    "Basil bar Shumna, archbishop of Edessa",
    "Bohemond II, Italian count of Manoppello",
    "Boleslaw, Swedish co-ruler of Östergötland",
    "Gerhoh of Reichersberg, German theologian",
    "Hilary of Chichester, English bishop (b. 1110)",
    "Hillin of Falmagne, German archbishop",
    "Luke Chrysoberges, Byzantine patriarch",
    "Mujir al-Din Abaq, governor of Damascus",
    "Otomae, Japanese female singer (b. 1085)",
    "Ramiro Fróilaz, Leonese military leader",
    "Stephen du Perche, Sicilian chancellor"
  ]
}