{
  "events": [
    "March 12 – Emperor Manuel I (Komnenos) orders the arrest of all Venetians in his empire, and seizes their ships and goods. In September, Doge Vitale II Michiel leads a Venetian fleet (120 ships) against the Byzantines, conquering the cities of Trogir and Dubrovnik. But the plague takes a heavy toll among the fleet's crewmen; half the ships have to be burned to keep them from falling into enemy hands. A plague also breaks out in Venice, when the remaining ships return.",
    "Autumn – King Alfonso II (the Chaste) of Aragon conquers the cities of Caspe and Teruel. He strengthens his southern frontier after Almohad forces under Caliph Yusuf I have ravaged Catalonia.",
    "The successors of Robert Bordet leave Catalonia for Mallorca, marking the end of the attempts to create a Norman principality in Iberia.[1]",
    "July – King Henry II decides to lead a military expedition to Ireland and summons Richard de Clare (Strongbow) to join forces. In September, Richard travels to England and promises his loyalty to Henry. He is granted Leinster as a fiefdom and is honored with the post of \"royal constable in Ireland\". The army is assembled at Pembroke – several siege towers are shipped over, should Henry need to assault the Norman-held towns (or others such as Cork and Limerick).[2]",
    "October 17 – Henry II invades Ireland and lands with a large army of at least 500 mounted knights, and 4,000 men and archers at Waterford. Henry commandeers merchant ships as part of his invasion.[3] He claims the ports of Dublin, Waterford, and Wexford, and promises the Irish chieftains protection if they will acknowledge him as their overlord. Henry is recognized as \"Lord of Ireland\", traders are invited to Dublin where an English colony is set up.[3]",
    "Ascall mac Ragnaill (or Torcaill), last Norse–Gaelic king of Dublin, is captured while trying to retake Dublin from the English forces under Richard de Clare, perhaps in company with Sweyn Asleifsson, and is beheaded. Before the end of the year, Richard relinquishes possession of the city to Henry II, who converts it into an English royal town.",
    "March 10 – King Amalric I of Jerusalem departs with a large staff for Constantinople. At Callipolis he is met by his father-in-law, John Doukas Komnenos, military governor (doux) of Cyprus. Amalric enters the Byzantine capital and is welcomed by Manuel I. In June, a treaty is signed, Amalric recognizes Manuel's suzerainty over Jerusalem.[4]",
    "September 13 – Caliph Al-Adid dies of natural causes (or poisoning) after a 11-year reign. Saladin overthrows the Fatimid Caliphate, and takes over as governor (atabeg) of Egypt – ruling in the name of Emir Nur al-Din.",
    "September 25 – Saladin leads an Egyptian army to take part in a joint attack on the Crusader castles Kerak and Montréal, south of the Dead Sea. In November, Saladin withdraws his forces to Cairo to suppress a coup.",
    "Yesugei (Baghatur), Mongol chieftain, arranges a marriage between his 9-year-old son Temujin (Genghis Khan) and the daughter of the chief of a nearby clan, Börte. He is poisoned by the Tatars while sharing a meal during the wedding.[5]"
  ],
  "births": [
    "August 15 – Alfonso IX, king of León and Galicia (d. 1230)",
    "Agnes of France (or Anna), Byzantine empress (d. 1220)",
    "Al-Aziz Uthman, Egyptian ruler and son of Saladin (d. 1198)",
    "Matilda of Chester (or Maud), English noblewoman (d. 1233)",
    "Minamoto no Michitomo, Japanese nobleman (d. 1227)",
    "Muhammad Aufi, Persian historian and philologist (d. 1242)",
    "Saionji Kintsune, Japanese nobleman and poet (d. 1244)",
    "Stephen de Segrave, English Chief Justiciar (d. 1241)"
  ],
  "deaths": [
    "February 20 – Conan IV (the Young), duke of Brittany (b. 1138)",
    "March 29 – Achard of Saint Victor, Norman bishop (b. 1100)",
    "April 3 – Philip of Milly, French nobleman and knight (b. 1120)",
    "May 1 – Diarmaid mac Murchadha, king of Leinster (b. 1110)",
    "June 9 – Jacob ben Meir Tam, French Jewish rabbi (b. 1100)",
    "August 8 – Henry of Blois, bishop of Winchester (b. 1096)",
    "September 13 – Al-Adid, last Fatimid caliph (b. 1151)[6]",
    "November 8 – Baldwin IV, count of Hainaut (b. 1108)",
    "December 27 – Petrus Ua Mórda, bishop of Clonfert",
    "Abu'l-Hasan al-Hasan ibn Ali, Zirid ruler (b. 1109)",
    "Ascall mac Ragnaill (or Torcaill), king of Dublin",
    "Gleb of Kiev (Yuryevich), Grand Prince of Kiev",
    "Iowerth Goch ap Maredudd, Welsh nobleman",
    "Narathu, ruler of the Pagan Kingdom (b. 1118)",
    "Vladimir III Mstislavich, Grand Prince of Kiev",
    "William de Courcy, Norman nobleman and knight",
    "Yesugei (Baghatur), Mongol chieftain (b. 1134)"
  ]
}