{
  "events": [
    "January – Eystein Meyla, leader of the Birkebeiner in Norway, is killed. Sverre Sigurdson (Later, King Sverre I, of Norway) becomes the new leader.[1]",
    "January 13 – Leopold V becomes Duke of Austria.[2]",
    "March – Treaty of Venice: Frederick I Barbarossa acknowledges Alexander III as Pope, after a diplomatic mediation by Venetian doge Sebastiano Ziani.[3][4]",
    "March 16 – The Spanish Award is signed and witnessed by, among others, Robert de Stuteville III and John of Greenford[5][6]",
    "August 1 – The Holy Roman Empire renounces any claims on the territory of Rome.[7]",
    "September 27 – Pope Alexander III sends a letter to Prester John, believing he is real.[8][9]",
    "November 25 – Battle of Montgisard: Baldwin IV of Jerusalem and Raynald of Chatillon defeat Saladin.[10]",
    "During the third year of the Angen era in Japan, a fire devastates Kyoto.[11]",
    "During the winter, the Estonians attack Pskov.[12]",
    "Casimir II overthrows his brother Mieszko III the Old, to become High Duke of Poland.[13]",
    "The Cham sack the Khmer capital of Angkor Wat. The date is disputed.[14][15]",
    "Moscow is burned down by Gleb I, prince of Ryazan, and its inhabitants are killed.[16]",
    "A civil war breaks out in the Republic of Florence, between the Uberti Family and their consular opponent.[17][18]",
    "Puigcerdà is founded by Alfonso II of Aragon.[19]",
    "Byland Abbey is established on its final site in Yorkshire, England, by the Cistercians.[20]",
    "Abbas Benedictus becomes abbot of Peterborough in England.[21]",
    "Roger de Moulins becomes Grand Master of the Knights Hospitaller.[22]",
    "possible date – Richard FitzNeal begins to write his treatise Dialogus de Scaccario (\"Dialogue concerning the Exchequer\") in England.[23][24]"
  ],
  "births": [
    "February/March – Philip of Swabia, rival of Otto IV, Holy Roman Emperor (d. 1208)[25][26]",
    "August – Baldwin V, King of Jerusalem (d. 1186)[27]",
    "Marie of Oignies, French beguin (d. 1213)[28]",
    "Sylvester Gozzolini, Italian founder of the Sylvestrines (d. 1267)[29]"
  ],
  "deaths": [
    "January 13 – Henry II, Duke of Austria (b. 1107)[30]",
    "January – Eystein Meyla, leader of the Birkebeiner in Norway. (b. 1157)[1]",
    "June – William of Montferrat, Count of Jaffa and Ascalon, father of Baldwin V of Jerusalem (b. early 1140s)[31][32]",
    "probable – Hugh Bigod, 1st Earl of Norfolk (b. 1095)[33]"
  ]
}