{
  "events": [
    "King Philip II (Augustus) annuls all loans made by Jews to Christians, and takes a percentage for himself. A year later, he confiscates all Jewish property and expels the Jews from Paris.[1]",
    "Philip II begins a war against Philip of Alsace, count of Flanders, over the Vermandois. He claims the territory for his wife Isabella of Hainault as her dowry. Philip is unwilling to give it up.[2]",
    "Henry the Lion, duke of Saxony, submits to Emperor Frederick I (Barbarossa) at an Imperial Diet in Erfurt. He is banished to England and retains only Brunswick among his former lands.[3]",
    "King Béla III of Hungary and Croatia goes to war with Venice in an effort to recover Dalmatia. The city of Zadar (located on the Adriatic Sea) accepts Béla's suzerainty.[4]",
    "After a series of defeats, the Almohad fleet under the admiral Ahmad al-Siqilli, crushes the Portuguese navy and reasserts its control over the Atlantic Ocean.[5]",
    "The word Albigensians is first used by Geoffroy du Breuil of Vigeois, French abbot and chronicler, to describe the inhabitants of Albi in southern France.",
    "King Henry II removes Hugh de Lacy, lord of Meath, from his position as procurator of Ireland, possibly because of his having married the daughter of High King Ruaidrí Ua Conchobair.",
    "Summer – Raynald of Châtillon, lord of Oultrejordain, raids Saladin's territory, reaching as far as Tabuk (modern Saudi Arabia) on the route between Damascus and Mecca. In November, Saladin sends an expedition under his nephew, Farrukh Shah, who invades Oultrejordain. Raynald of Châtillon is forced to withdraw home. Saladin complains to King Baldwin IV of Jerusalem (the Leper) for breaking the treaty (see 1180) and demands compensation.[6]",
    "March 20 – Taira no Kiyomori, Japanese military leader and dictator, dies at Kyoto. He established the first samurai-dominated administrative government in Japan.",
    "Jayavarman VII defeats the Chams and assumes control over the Khmer Empire (modern Cambodia).",
    "The Yōwa era is marked by famine in Japan, during the period from July 1181 through May 1182.",
    "August 30 – Pope Alexander III dies after a 22-year pontificate at Rome. He is succeeded by the Tuscany-born Lucius III as the 171st pope of the Catholic Church.",
    "January – William VIII of Montpellier frees the teaching of medicine from any monopoly in France,[7] an origin of the University of Montpellier.",
    "Chinese and Japanese astronomers observe what has come to be understood as supernova SN 1181. One of only eight supernovae in the Milky Way observed in recorded history. It appears in the constellation Cassiopeia and is visible in the night sky for about 185 days. The radio source 3C58 was thought to be the remnant from this event, but opinion is shifting towards the recently discovered nebula Pa 30  (ref : Arxiv 2105.12384)."
  ],
  "births": [
    "March 22 – Ibn al-Farid, Arab poet and writer (d. 1234)",
    "June 21 – Huijong, Korean ruler of Goryeo (d. 1237)",
    "Irene Angelina, queen of Germany and Sicily (d. 1208)",
    "Marino Morosini, doge of Venice (House of Morosini) (d. 1253)",
    "Mathilde of Angoulême, French noblewoman  (d. 1233)",
    "Xian Zong, Chinese emperor of Western Xia (d. 1226)"
  ],
  "deaths": [
    "January 30 – Takakura, emperor of Japan (b. 1161)",
    "March 16 – Henry I (the Liberal), French nobleman (b. 1127)",
    "March 20 – Taira no Kiyomori, Japanese military leader (b. 1118)",
    "March 13 – Simon III de Montfort, French nobleman (b. 1117)",
    "April 1 – Ulrich II von Treven, patriarch of Aquileia",
    "April 5 – Ramon Berenguer III, count of Provence",
    "June 30 – Hugh de Kevelioc, English politician (b. 1147)",
    "August 30 – Alexander III, pope of the Catholic Church",
    "September 27 – Guichard of Pontigny, French archbishop",
    "October 4 – Herman II, German nobleman (House of Sponheim)",
    "October 23 – Adela of Meissen, queen consort of Denmark",
    "November 26 – Roger de Pont L'Évêque, Norman archbishop",
    "December 3 – Galgano Guidotti, Italian nobleman (b. 1148)",
    "Adam the Welshman, Welsh theologian and bishop (b. 1130)",
    "As-Salih Ismail al-Malik, Zangid ruler of Damascus (b. 1163)",
    "Lucas (or Luke), archbishop of Esztergom (b. 1120)[8]",
    "Serlo of Wilton, English poet and writer (b. 1105)",
    "Zhang Shi, Chinese Confucian scholar (b. 1133)"
  ]
}