{
  "events": [
    "Andronicus I Comnenus becomes Byzantine Emperor.[1][2]",
    "October – Alexios II Komnenos is murdered after a 3-year reign at Constantinople. The 64-year-old Andronikos I is proclaimed emperor of the Byzantine Empire before the crowd on the terrace of the Church of Christ of the Chalke. He marries Alexios' widow, the 11-year-old Agnes of France, and makes in November a treaty with Venice in which he promised a yearly indemnity as compensation for Venetian losses during the Massacre of the Latins.[3]",
    "June 25 – The Peace of Constance is signed, between Frederick Barbarossa and the Lombard League, forming the legal basis for the autonomy of the Italian city republics.[4][5][6]",
    "Joseph of Exeter writes the first account of a sport resembling cricket.[7]",
    "Three-year-old Emperor Go-Toba ascends to the throne of Japan, after the forced abdication of his brother Emperor Antoku, during the Genpei War.[8][9][10]",
    "August 14 – Taira no Munemori and the Taira clan take the young Emperor Antoku and the three sacred treasures, and flee to western Japan to escape pursuit by the Minamoto clan (traditional Japanese date: Twenty-fifth Day of the Seventh Month of the Second Year of Juei).[11][12]",
    "November 17 – Battle of Mizushima: The Taira Clan defeats the Minamoto Clan.[13][14]",
    "February – Raynald of Châtillon has at least five ships freighted over the Isthmus of Suez, which he then uses to pillage the shores of the Red Sea around Jeddah.",
    "William of Tyre is excommunicated by the newly appointed Heraclius of Jerusalem, firmly ending their struggle for power.[15][16]",
    "The Siege of Kerak is waged between the Ayyubids and the Crusaders, in which regent Guy of Lusignan refuses to fight.[17][18]",
    "Saladin conquers Syria and becomes sultan.[19][20]"
  ],
  "births": [
    "Chagatai Khan, second son of Genghis Khan, Khan of the Chagatai Khanate (d. 1241 or 1242)[21][22]",
    "Philippa of Armenia, empress consort of Nicaea[23]"
  ],
  "deaths": [
    "June 11 – Henry the Young King, son of Henry II of England (b. 1155)[24][25][26]",
    "October – Alexios II Komnenos, Byzantine Emperor (b. 1167)[27][28][29]",
    "November 23 – William Fitz Robert, 2nd Earl of Gloucester (b. 1116)[30]",
    "Queen Gongye, Korean queen consort (b. 1109)[31][32]"
  ]
}