{
  "events": [
    "May 20 – Diet of Pentecost: Emperor Frederick I (Barbarossa) organises a conference in Mainz. During the diet Frederick negotiates with Henry the Lion about an anti-French alliance with England.",
    "June 15 – Battle of Fimreite: King Sverre of Norway defeats and kills his rival, Magnus V (Erlingsson) near Fimreite. Sverre takes the throne and becomes sole ruler of Norway (until 1202).",
    "Summer – Almohad forces reconquer the Alentejo (except for Évora), and besiege Lisbon on land and blockade the port with their navy. A Portuguese soldier manages to swim to the largest ship of the fleet and to sink it. This ship was so tall, it would have allowed the Muslims to easily reach the walls of the city. The next day, the Almohads have to retreat, taking with them a number of civilian captives.[1]",
    "Siege of Santarém: Almohad forces under Caliph Abu Yaqub Yusuf march towards Badajoz and besiege Santarém, which is defended by King Afonso I (the Conqueror). Upon hearing of Abu Yusuf's attack, Ferdinand II of León marches his army to Santarém to support his father-in-law, Afonso. Abu Yusuf, in an attempt to break the siege, is wounded by a crossbow bolt and dies on July 29.",
    "October 29 – The 18-year-old Prince Henry, eldest surviving son of Frederick I, is engaged to Princess Constance, heiress to the Kingdom of Sicily, at Augsburg in the episcopal palace.[2]",
    "The city of Abbeville receives its commercial charter by King Philip II (Augustus).",
    "The first royal ordinance, demanding that the Knights Templar and Hospitaller assist in the collection of taxes, is promulgated.[3]",
    "King Henry II encourages his youngest (and favorite) son John to seize Aquitaine from his brother Richard.[4]",
    "May – A serious fire damages Glastonbury Abbey and destroys several buildings.",
    "May – Berber forces under Ali Banu Ghaniya seize by surprise the Almohad cities of Algiers, Béjaïa and Constantine. While he is away from his base in Mallorca, one of his brothers, Muhammad, takes control of the island and calls in the Almohads, who intend to capture Mallorca for themselves. Banu Ghaniya arrives just in time, to defeat the Almohads and recapture the island.[1]",
    "August 10 – Abu Yusuf Yaqub al-Mansur is proclaimed the new caliph of the Almohad Caliphate, after his father Abu Yaqub Yusuf is killed in Portugal.",
    "Saladin sends his nephew Izz al-Din Usama, governor (emir) of the iron-rich mountains near Beirut, to build Ajloun Castle, which controls the trade along the road between Damascus and Egypt.[5]",
    "February 19 – Second Battle of Uji: Japanese forces under Minamoto no Yoshinaka are defeated by his cousins, Minamoto no Yoshitsune and Minamoto no Yoritomo, for the control of Japan.[6]",
    "February 21 – Battle of Awazu: Minamoto no Yoshinaka is killed during a pursuit by his cousin's armies. He is joined by his foster brother Imai Kanehira, who commits suicide.",
    "March 20 – Battle of Ichi-no-Tani: Japanese forces under Minamoto no Noriyori defeat the Taira clan at Ikuta Shrine in the woods of Settsu Province during the Genpei War.[7]",
    "Earliest mention of Gouda cheese, originating from the Netherlands.",
    "The papal bull Ad Abolendam is issued against several European heretical groups: the Cathars, the Waldensians, the Patarines, Josephines and the Humiliati. It is created after a landmark meeting in Verona, between the Holy Roman Empire under Frederick I and the Catholic Church under Pope Lucius III."
  ],
  "births": [
    "April 11 – William Longsword, lord of Lüneburg (d. 1213)",
    "Ahmad al-Tifashi, Almohad poet and anthologist (d. 1253)",
    "Eleanor (Beauty of Brittany), English countess (d. 1241)",
    "Fujiwara no Hideyoshi, Japanese nobleman (d. 1240)",
    "Guigues VI, count of Albon (House of Burgundy) (d. 1237)",
    "Jutta of Thuringia, margravine of Meissen (d. 1235)",
    "William of Modena, Italian bishop and diplomat (d. 1251)"
  ],
  "deaths": [
    "January 2 – Theodora Komnene, duchess of Austria",
    "January 13 – Gerard la Pucelle, English bishop (b. 1117)",
    "February 16 – Richard of Dover, English archbishop",
    "February 21\nImai Kanehira, Japanese military leader (b. 1152)\nMinamoto no Yoshinaka, Japanese shogun (b. 1154)",
    "Imai Kanehira, Japanese military leader (b. 1152)",
    "Minamoto no Yoshinaka, Japanese shogun (b. 1154)",
    "March 27 – George III, king of Georgia  (House of Bagrationi)",
    "March 28 – Eckebert (or Egbert), German Benedictine abbot",
    "June 15 – Magnus V (Erlingsson), king of Norway (b. 1156)",
    "July 29 – Abu Yaqub Yusuf, Almohad caliph (emir) (b. 1135)",
    "September 30 – Arnold of Torroja, Catalan Grand Master",
    "October 24 – Siegfried, prince-archbishop of Bremen (b. 1132)",
    "November 15\nBeatrice I, Holy Roman Empress (b. 1143)\nWilliam de Beaumont, 3rd Earl of Warwick",
    "Beatrice I, Holy Roman Empress (b. 1143)",
    "William de Beaumont, 3rd Earl of Warwick",
    "November 18 – Josceline de Bohon, English bishop (b. 1111)",
    "December 17 – Simon de Tosny, Norman-Scottish bishop",
    "Abu al-Bayan ibn al-Mudawwar, Jewish physician (b. 1101)",
    "Agnes of Antioch, queen of Hungary (approximate date)",
    "Aindréas of Caithness, Gaelic-Scottish monk and bishop",
    "Grimaldo Canella, Italian nobleman (House of Grimaldi)",
    "Li Tao (or Renfu), Chinese historian and writer (b. 1115)",
    "Pedro Fernández de Castro, Spanish nobleman (b. 1115)",
    "Sasaki Hideyoshi, Japanese nobleman and samurai (b. 1112)",
    "Taira no Atsumori, Japanese warrior and samurai (b. 1169)",
    "Taira no Koremori, Japanese nobleman (approximate date)",
    "Taira no Tadanori, Japanese warrior and general (b. 1144)",
    "William de Vesci, High Sheriff of Northumberland (b. 1125)"
  ]
}