{
  "events": [
    "January 22 – King Ferdinand II dies after returning from a pilgrimage to Santiago de Compostela. He is succeeded by his 16-year-old son Alfonso IX, who becomes ruler of León and Galicia. He convenes at the Basilica of San Isidoro the Cortes of León, with representatives of the nobility, clergy and towns. These Corteses are considered to be the first parliament in Europe.",
    "Spring – King Henry II and Philip II  (Augustus) meet at Le Mans, with Archbishop Josias (or Joscius) in attendance. Both kings agree to peace terms, and to contribute to a joint Crusade. It is decided to raise a new tax to pay for the expedition. This tax, known as the Saladin Tithe, is imposed on the people of England and France to raise funds for the Third Crusade.",
    "March 27 – Emperor Frederick I (Barbarossa) holds a Diet at Mainz and takes the Cross, followed by his 21-year-old son, Frederick IV, and other German nobles. He sends a delegation to present an ultimatum to Saladin in Syria on May 26. With demands to withdraw his Muslim forces from Palestina and to return the True Cross to the Church of the Holy Sepulchre.",
    "November – Richard of Poitou, son of Henry II, allies himself with Philip II and pays him homage. He promises to concede his rights to both Normandy and Anjou. Henry is overpowered by Richard's supporters, who chase him from Le Mans to Angers. They force him to accept peace by conceding to all demands, including the recognition of Richard as his successor.[1]",
    "The Cutting of the Elm: A meeting of Henry II and Philip II in the field at Gisors, in Normandy. It marks the Franco-Norman peace negotiations, following the Fall of Jerusalem (see 1187).",
    "Spring – Siege of Tyre: Muslim forces under Saladin withdraw from Tyre after a 1½-month siege. For the Crusaders the city-port becomes a strategic rallying point for the Christian revival during the Third Crusade.",
    "May 14 – Saladin begins a campaign and marches north but finds Tripoli too strong to be besieged. He decides to take other Crusader fortifications and signs an 8-month truce with Prince Bohemond III of Antioch.",
    "May – Saladin besieges the Hospitaller fortress of Krak des Chevaliers, in Syria. Seeing that the castle is too well defended, he decides instead to march on the Castle of Margat, which he also failed to capture.[2]",
    "July – Saladin marches through the Buqaia, and occupies Jabala and Lattakieh. From Lattakieh he turns inland and takes after a few days of fierce fighting Sahyun Castle (called Castle of Saladin) on July 29.[3]",
    "September 4 – King Guy of Lusignan is released by Saladin after Ascalon is forced to surrender. Guy and his wife, Queen Sibylla of Jerusalem, seek refuge in Tyre, which is defended by Conrad of Montferrat.",
    "Spring – Henry II institutes legal reforms that give the Crown more control over the administration of justice. He orders Newgate Prison be built in London.[4]",
    "Archdeacon Giraldus Cambrensis and Archbishop Baldwin of Forde travel through Wales, attempting to recruit men for the Third Crusade."
  ],
  "births": [
    "March 4 – Blanche of Castile, queen and regent of France (d. 1252)",
    "March 24 – Ferdinand (or Ferrand), count of Flanders (d. 1233)",
    "November 26 – Yuri II of Vladimir, Kievan Grand Prince (d. 1238)",
    "Albert IV (the Wise), German nobleman and knight (d. 1239)",
    "Matilda I, countess of Nevers, Auxerre and Tonnerre (d. 1257)",
    "Si Inthrathit, Thai founder of the Sukhothai Kingdom (d. 1270)"
  ],
  "deaths": [
    "January 22 – Ferdinand II, king of León and Galicia (b. 1137)",
    "January 26 – Eysteinn Erlendsson, Norwegian archbishop[5]",
    "October 11 – Robert I (the Great), count of Dreux (b. 1123)",
    "November 4 – Theobald of Ostia, French abbot and bishop",
    "November 17 – Usama ibn Munqidh, Syrian poet (b. 1095)",
    "December 14 – Berthold I, margrave of Istria and Carniola",
    "December 22 – Richard of Ilchester, bishop of Winchester",
    "Aoife MacMurrough (or Eva), princess of Leinster (b. 1145)",
    "Hugh the Chaplain, bishop of Cell Rigmonaid (St. Andrews)",
    "Roger de Mowbray, English nobleman and knight (b. 1120)"
  ]
}