{
  "events": [
    "January 7 – Venus occults Jupiter.[1]",
    "April 28 – Conrad of Montferrat (Conrad I), King of Jerusalem, is assassinated in Tyre, only days after his title to the throne is confirmed by election. The killing is carried out by Hashshashin, later the basis of folk etymology for the English word \"assassin.\"[2]",
    "August 21 – Minamoto no Yoritomo is granted the title of shōgun, thereby officially establishing the first shogunate in the history of Japan.[3][4]",
    "Margaritus of Brindisi is created the first Count of Malta for capturing Constance, Holy Roman Empress in 1191.",
    "Second Battle of Tarain in India: The Ghurid forces of Mu'izz al-Din are victorious over Prithviraj Chauhan.[5]",
    "The Lugouqiao (later the Marco Polo) Bridge is completed in Beijing.[6]",
    "Constance, Holy Roman Empress is released by Tancred, King of Sicily under the pressure of Pope Celestine III in May, and returns to Germany in June.[7]",
    "Prince Yaroslav Vladimirovich of Novgorod burns down Tartu and Otepää Castles, in Estonia.",
    "August 5 - Battle of Jaffa: Richard I of England defeats the forces of Saladin and ends hostilities, paving the way for a truce.[8][9]",
    "September 2 - After negotiations between Richard and Saladin, the Treaty of Jaffa is signed, which makes sure Jerusalem remains in Muslim hands, but insures visiting rights for pilgrims to come to the Holy City. The Third Crusade ends.[10][11]",
    "October 9 –  Richard leaves the Holy Land, setting sail from Acre and beginning his return to Europe.[12]",
    "December 11 – Returning from the Third Crusade, Richard I of England is taken prisoner by Leopold V, Duke of Austria, and secured at Dürnstein.[13][14]"
  ],
  "births": [
    "September 17 – Minamoto no Sanetomo, Japanese shōgun (d. 1219)[15]",
    "Queen Maria of Jerusalem (d. 1212)[16][17]",
    "King Stefan Radoslav of Serbia (d. 1234)[18]",
    "Saint Syed Jalaluddin Bukhari of Uch Sharif (d. 1291)[19][20]"
  ],
  "deaths": [
    "April 26 – Emperor Go-Shirakawa of Japan (b. 1127)[21][22]",
    "April 28 – Conrad of Montferrat, King of Jerusalem (b. mid-1140s)[2]",
    "May 8 – Duke Ottokar IV, Duke of Styria (b. 1163)[23][24]",
    "August 25 – Hugh III, Duke of Burgundy (b. 1142)[25][26]",
    "Saint Margaret of England, English saint[27]",
    "Ikhtiyar al-Din Hasan ibn Ghafras, vizier of the Sultanate of Rum[28]",
    "Kilij Arslan II, Sultan of Rum[29]",
    "Rashid ad-Din Sinan, the \"Old Man of the Mountain\", leader of the Hashashin sect (b. 1132/1135)[30][31]",
    "Prithviraj Chauhan, King of the Chauhan Dynasty (b. 1166)[5]"
  ]
}