{
  "events": [
    "July 31 – John Komnenos the Fat, a Byzantine aristocrat, attempts to usurp the imperial throne; he is proclaimed emperor and crowned by Patriarch John X Kamateros, at Constantinople. Meanwhile, Emperor Alexios III Angelos, who resides in the Palace of Blachernae, dispatches a small force under Alexios Palaiologos, Alexios' son-in-law, who is regarded as his heir-apparent. With support of the Varangian Guard, John is overthrown and decapitated by the end of the day. His head is displayed at the Forum of Constantine, while John's supporters are captured and tortured to extract the names of all the conspirators.[1][2]",
    "Autumn – Prince Alexios Angelos, son of the deposed, blinded and imprisoned late Emperor Isaac II Angelos, escapes from Constantinople. He makes his way to Sicily and then Rome where he is turned away by Pope Innocent III. Next, Alexios travels to the court of his brother-in-law, Philip of Swabia, the King of Germany, who receives him well.[3]",
    "Spring – A treaty is signed between the Crusade leaders and Venice. Doge Enrico Dandolo agrees to manufacture a fleet capable of transporting the Crusader army to the Levant, and to provide provisions for 33,500 men and 4,500 horses, for the price of 85,000 silver marks while Venice will also take half of whatever the expedition conquers. As part of this deal the Venetians will provide – at their own expense – sufficient ships to carry the Crusader forces, plus 50 galleys to defend it.[4]",
    "May 24 – Count Theobald III of Champagne suddenly dies and is replaced by Boniface I, marquis of Montferrat, as leader of the Fourth Crusade. He travels to France, where he meets his chief colleagues at Soissons.[5]",
    "Battle of Stellau: Count Adolf III of Holstein is defeated by the Danish army under King Canute VI. Adolf retreats with his forces to Hamburg, where he is besieged and later captured by Duke Valdemar of Schleswig.",
    "Northern Crusades: The town of Riga is chartered as a city by Albert of Buxhoeveden, bishop of Livonia, who has landed on the site with some 1,500 Crusaders earlier in the year.",
    "King John (Lackland) puts an embargo on wheat exported to Flanders, in an attempt to force an allegiance between the states. He also puts a levy of a fifteenth on the value of cargo exported to France and disallows the export of wool to France without a special license. The levies are enforced in each port by at least six men – including one churchman and one knight. John affirms that judgments made by the court of Westminster are as valid as those made \"before the king himself or his chief justice\".[6]",
    "Pope Innocent III recognizes Otto IV as the only legitimate ruler of the Holy Roman Empire, against his rival King, Philip of Swabia. In return, Otto promises to support the pope's interests in Italy.",
    "March 25 – Constance, duchess of Brittany, founds Villeneuve Abbey and gives the new abbey a charter."
  ],
  "births": [
    "February 18 – Nasir al-Din al-Tusi, Persian scientist and writer (d. 1274)",
    "May 30 – Theobald I (the Troubadour), French nobleman (d. 1253)",
    "August 9 – Arnold Fitz Thedmar, English chronicler and writer (d. 1274)",
    "October 9 – Robert de Sorbon, French monk and theologian (d. 1274)",
    "October 10 – Richard de Fournival, French philosopher (d. 1260)",
    "Agnes of the Palatinate, duchess of Bavaria (House of Guelf) (d. 1267)",
    "Danylo Romanovych, ruler (knyaz) of Galicia–Volhynia (d. 1264)",
    "Diana degli Andalò (or d'Andalo), Italian nun and saint (d. 1236)",
    "Eison, Japanese Buddhist scholar-monk and disciple (d. 1290)",
    "Theobald le Botiller (or Butler), Norman nobleman (d. 1230)",
    "Thomas of Cantimpré, Flemish priest and preacher (d. 1272)",
    "Uriyangkhadai, Mongol general and son of Subutai (d. 1272)"
  ],
  "deaths": [
    "March 1 – Shikishi, Japanese princess, poet and writer (b. 1149)",
    "March 21 – Absalon, Danish archbishop and statesman (b. 1128)",
    "March 22 – Jarosław of Opole, Polish duke and bishop (b. 1145)",
    "April 7 – Baha al-Din Qaraqush, Egyptian regent and architect[7]",
    "May 24 – Theobald III, French nobleman and knight (b. 1179)",
    "June 16 – Ibn al-Jawzi, Arab historian and philologist (b. 1116)",
    "June 20 – Imad ad-Din al-Isfahani, Persian historian (b. 1125)",
    "July 25 – Gruffydd ap Rhys II, Welsh prince of Deheubarth",
    "July 31 – John Komnenos (the Fat), Byzantine nobleman",
    "August 20 – Gardolf of Hertbeke, bishop of Halberstadt",
    "September 5 – Constance, duchess of Brittany (b. 1161)",
    "Agnes of Merania, queen and wife of Philip II (Augustus)",
    "Bohemond III (the Stammerer), prince of Antioch (b. 1148)",
    "Bolesław I (the Tall), Polish nobleman and knight (b. 1127)",
    "Fulk of Neuilly (or Foulques), French priest and preacher",
    "Guglielmo Grasso, Genoese merchant, pirate and admiral",
    "Margaret of Huntingdon, Scottish princess and duchess",
    "Walchelin de Ferriers (or Walkelin), Norman nobleman"
  ]
}