{
  "events": [
    "January 27-28 – Byzantine emperor Alexios IV Angelos is overthrown in a revolution.[1]",
    "February 5 – Alexios V Doukas is crowned Byzantine emperor.[2]  Conquest of Constantinople by the Crusaders",
    "April 12 – Fourth Crusade: The Crusaders enter Constantinople by storm and start pillaging the city.[1] Forces of the Republic of Venice seize the antique statues that will become the horses of Saint Mark.[3]",
    "May 16 – Baldwin, Count of Flanders, is crowned emperor of the Latin Empire a week after his election by the members of the Fourth Crusade.[4]",
    "Theodore I Laskaris flees to Nicaea after the capture of Constantinople, and establishes the Empire of Nicaea; Byzantine successor states are also established in Epirus and Trebizond.[5][6]",
    "Boniface I, Marquis of Montferrat, a leader of the Fourth Crusade, founds the Kingdom of Thessalonica.[7]",
    "The writings of French theologian Amalric of Bena are condemned by the University of Paris, and Pope Innocent III.[8]",
    "Tsar Kaloyan is recognized as king of Bulgaria by Pope Innocent III, after the creation of the Bulgarian Uniate church.[9]",
    "Valdemar II of Denmark is recognized as king in Norway.[10]",
    "Angers and Normandy are captured by Philip II of France.[11][12]",
    "The Cistercian convent of Port-Royal-des-Champs is established.[13]",
    "The district of Cham becomes subject to Bavaria.[14]",
    "Hermann I, Landgrave of Thuringia submits to Philip of Swabia.[15]",
    "Beaulieu Abbey is founded.[16]",
    "The Channel Islands of Guernsey and Jersey decide, after a plebiscite of wealthy land owners, to remain with the English crown, after Normandy is recaptured by Philip II of France.[17]"
  ],
  "births": [
    "April 14 – Henry I, king of Castile (d. 1217)[18]",
    "Haakon IV of Norway (d. 1263)[19]",
    "Henry Raspe, Landgrave of Thuringia (d. 1247)[20]",
    "Maria of Courtenay, Empress regent of Nicaea (d. 1228)[21]",
    "Alice of Schaerbeek (d. 1250)[22]"
  ],
  "deaths": [
    "January 1 – King Haakon III of Norway[19]",
    "January – Isaac II Angelos, Byzantine emperor[23]",
    "February 8 – Alexios IV Angelos, Byzantine emperor[24]",
    "April 1 – Eleanor of Aquitaine, Sovereign Duchess Regnant of Aquitaine, queen of France and England[25]",
    "August 11 – King Guttorm of Norway[26]",
    "August 14 – Minamoto no Yoriie, Japanese shōgun (b. 1182)[27]",
    "September 30 or November 30 – Emeric, King of Hungary (b. 1174)[28]",
    "c. October 21 – Robert de Beaumont, 4th Earl of Leicester, English nobleman[29]",
    "November – Ban Kulin, ruler of Bosnia (b. 1163)[30]",
    "December 12 (or December 13) – Maimonides, Spanish rabbi and philosopher (b. 1135)[31]",
    "December 22 – Fujiwara no Shunzei, Japanese waka poet (b. 1114)[32]",
    "date unknown – Suleiman II, Sultan of Rûm[33]",
    "probable – Amalric of Bena, French theologian[34]"
  ]
}