{
  "events": [
    "Spring – Theodore I (Laskaris) is proclaimed Byzantine emperor (or basileus), formally founding the Empire of Nicaea, after repelling the invasions of rivals David Komnenos and Manuel Maurozomes into his domains. His appointment is an open challenge to the legitimacy of the Latin emperor Baldwin I, who rules over large parts of the former Byzantine Empire and regards Theodore as a usurper.[1]",
    "March 19 – Battle of Adramyttion: The Byzantine army under Constantine Laskaris (brother of Theodore I) appears before the walls of Adramyttium – surprising the Latin garrison. Meanwhile, Henry of Flanders not wanting to remain trapped within the city, opens the gates and charges out with his heavy cavalry. He and his knights defeat the Byzantine forces, who are scattered and forced to retreat.[2]",
    "March – Byzantine officials in Adrianople revolt and expel Latin administrators, requesting Bulgarian support from Kaloyan, ruler (tsar) of the Bulgarian Empire, against Baldwin I who assembles an army (some 40,000 men) and marches to aid the Byzantines. Meanwhile, Baldwin sets out from Constantinople in force, he arrives at Adrianople and promptly begins to siege the city by the end of March.",
    "April 14 – Battle of Adrianople: Latin forces under Baldwin I are defeated and eliminated in a successful ambush by Bulgarians, Vlachs and Cumans. Baldwin is captured and taken as prisoner to Veliko Tarnovo – where he is locked up at the top of a tower in the Tsarevets fortress. Later, Baldwin is possibly executed by orders of Kaloyan (this according to the Byzantine historian George Akropolites).[3]",
    "Summer – Battle of Koundouros: Byzantine forces (some 5,000 men) under Michael Doukas, governor of the Theme of the Peloponnese (and later Despot of Epirus), tries to stop the Latin army (some 700 knights and foot soldiers) at the Olive Grove of Koundouros. The Byzantines are defeated by William of Champlitte, who later founds the Principality of Achaea (a vassal state of the Latin Empire).",
    "Othon de la Roche, a Burgundian nobleman, founds the Duchy of Athens (one of the Crusader states set up in Greece) and takes the title of \"Grand Lord\" (Megaskyr) in Athens.[4]",
    "January 6 – Philip of Swabia becomes King of the Romans and is crowned again with great ceremony at Aachen by Archbishop Adolf of Cologne. After several threats, Adolf is removed from office by Pope Innocent III and excommunicated, on July 19. Philip is able to increasingly assert his kingship against Otto of Brunswick (who is also crowned king of Germany) in the northern parts of the Alps.[5]",
    "May 29 – Andrew II, brother of the late King Emeric, is crowned ruler of Hungary and Croatia at Székesfehérvár, after his 5-year-old nephew, Ladislaus III, suddenly dies in Vienna. Andrew introduces a new policy for royal grants, which he calls \"new institutions\". He distributes large portions of his domain–such as royal castles and all estates attached to them–to supporters and Hungarian nobles.[6]",
    "June 19 – Battle of Zawichost: Polish forces under High Duke Leszek I (the White) defeat the Kievan army at Zawichost. During the ambush, Roman Mstislavich, Grand Prince of Kiev, is killed. He is succeeded by his two infant sons, Daniel and Vasilko. Their principalities are ruled by their mother Anna of Byzantium, but the boyars of Galicia–Volhynia forces her and the young princes into exile.[7]",
    "Summer – King Philip II (Augustus) conquers most of the Angevin lands, including much of Aquitaine. Fearing a French invasion of England  itself, King John (Lackland) requires every English male over 12 years to enter a mobilization \"for the general defense of the realm and the preservation of peace\". John prepares an expedition force of his own, but the barons refuse to cross the Channel.[8]",
    "William of Wrotham, Lord Warden of the Stannaries, oversees a reform of English currency. In keeping with other high-ranking bureaucrats of his time, this is just one of Wrotham's many offices. He is also \"keeper of ports\", the forerunner of the First Lord of the Admiralty, supervisor of the mints of Canterbury and London, ward of the vacant Diocese of Bath and Wells and archdeacon of Taunton.[9]",
    "April 1 – Aimery of Cyprus, king of Jerusalem, dies of food poisoning caused by white mullet. He is succeeded by his 9-year-old son Hugh I as ruler of Cyprus. His mother, Queen Isabella I becomes regent over the young boy, but she dies suddenly four days after her husband. The High Court of Cyprus appoints Walter of Montbéliard (brother-in-law of Aimery) as regent and Hugh's guardian.[10]",
    "Caliph Muhammad al-Nasir establishes Almohad domination over the eastern parts of Ifriqiya (modern Tunisia). He appoints General Abu Mohammed ibn Abi Hafs as governor of Ifriqiya.[11]",
    "July 15 – Pope Innocent III lays down the principle that Jews are doomed to perpetual servitude, because they had crucified Jesus."
  ],
  "births": [
    "January 26 – Li Zong (or Zhao Yun), Chinese emperor (d. 1264)",
    "July 10 – Hōjō Masamura, Japanese nobleman (d. 1273)",
    "November 5 – As-Salih Ayyub, Ayyubid ruler (d. 1249)",
    "Alan la Zouche, English nobleman and knight (d. 1270)",
    "Azzo VII d'Este, Italian nobleman and knight (d. 1264)",
    "Batu Khan, Mongol ruler of the Golden Horde (d. 1255)",
    "Bruno von Schauenburg, Bohemian bishop (d. 1281)",
    "Demetrius of Montferrat, king of Thessalonica (d. 1230)",
    "Egidia de Lacy, Cambro-Norman noblewoman (d. 1240)",
    "Elisabeth of Swabia, queen of Castile and León (d. 1235)",
    "Geoffrey of Sergines, French knight and regent (d. 1269)",
    "Guillén de Guzmán, Spanish noblewoman (d. 1262)",
    "Guy I de la Roche, duke of Athens and Thebes (d. 1263)",
    "Hugh Ripelin of Strasburg, French theologian (d. 1270)",
    "John Fitzgeoffrey, English nobleman and knight (d. 1258)",
    "Paio Peres Correia, Portuguese Grand Master (d. 1275)",
    "Peter de Montfort, English magnate and diplomat (d. 1265)",
    "Philippe Chinard, French nobleman and admiral (d. 1266)",
    "Pillai Lokacharya, Indian Sri Vaishnava leader (d. 1311)",
    "Razia Sultana, ruler of the Delhi Sultanate (d. 1240)",
    "Roger of Torre Maggiore, Italian archbishop (d. 1266)",
    "Theodoric Borgognoni, Italian physician (d. 1298)",
    "Thikkana, Indian Prime-Minister and poet (d. 1288)",
    "Walter IV (the Great), French nobleman (d. 1246)",
    "Wenceslaus I (One-Eyed), king of Bohemia (d. 1253)"
  ],
  "deaths": [
    "January 2 – Baldwin II, French nobleman and knight",
    "April 1 – Aimery of Cyprus (or Amaury), king of Jerusalem",
    "April 5 – Isabella I, queen and regent of Jerusalem (b. 1172)",
    "April 14\nGarnier de Traînel (or Traisnel), French bishop\nLouis I, French nobleman and knight (b. 1172)",
    "Garnier de Traînel (or Traisnel), French bishop",
    "Louis I, French nobleman and knight (b. 1172)",
    "May 7 – Ladislaus III, king of Hungary and Croatia (b. 1200)",
    "June 14 – Walter III (or Gautier), French nobleman",
    "June 19 – Roman Mstislavich, Kievan prince (b. 1152)",
    "July 4 – Otto II (the Generous), German nobleman",
    "July 10 – Hatakeyama Shigeyasu, Japanese samurai",
    "July 13 – Hubert Walter, archbishop of Canterbury",
    "August 8 – Savaric FitzGeldewin, English bishop",
    "Ada of Holland, margravine of Brandenburg (b. 1163)",
    "Alan IV (the Young), viscount of Rohan (b. 1166)",
    "Alexios V (Doukas), Byzantine emperor (b. 1140)",
    "Alexios Aspietes, Byzantine governor and usurper",
    "Baldwin I, emperor of the Latin Empire (b. 1172)",
    "Enrico Dandolo (or Henry), doge of Venice (b. 1107)",
    "Fujiwara no Takanobu, Japanese portrait painter (b. 1142)",
    "Hatakeyama Shigetada, Japanese nobleman (b. 1164)",
    "Hugh de Willoughby, English nobleman and knight (b. 1135)",
    "Joanna of Hohenstaufen, German noblewoman (b. 1191)",
    "Nicholas of Verdun, French goldsmith (approximate date)",
    "Peter Waldo, French spiritual leader (approximate date)",
    "Sibylla of Acerra, queen and regent of Sicily (b. 1153)",
    "Žvelgaitis, Lithuanian nobleman and military leader"
  ]
}