{
  "events": [
    "January 31 – Battle of Rusion: The Bulgarian forces (some 7,000 men) under Tsar Kaloyan defeat the remnants of the Latin army near the fortress of Rusion in Thrace. Around 120 knights supported by soldiers and cavalry are killed in battle or captured. In February, the Bulgarians attack and loot the fortified town of Rodosto (see Battle of Rodosto), defended by a Venetian garrison. Later, Kaloyan captures many more towns and fortresses.[1]",
    "August 20 – Henry of Flanders is crowned as the second emperor of the Latin Empire, in the Hagia Sophia at Constantinople, after hearing of the death of his brother, Emperor Baldwin I, who has died in prison at Baldwin's Tower in Tsarevets Castle, in Veliko Tarnovo (after being captured by the Bulgarians in 1205). Upon Henry's ascension as Latin emperor, the Lombard nobles of the Kingdom of Thessalonica refuse to give him allegiance.[2]",
    "Temüjin assembles at a Kurultai, a council of Mongol chiefs,  the tribes under his rule and is elected as their leader. He is given the title of \"Genghis Khan\" of the Mongol people – founding the Mongol Empire. Genghis takes immediate steps to underpin his military command, starting with a fundamental reordering of tribal loyalties. United under one nomadic nation, under one banner and one authority.[3]",
    "Muqali (or Mukhali), a Mongol general in service of Genghis Khan, is rewarded with the command of the left-wing of the newly reorganized Mongol army and takes control over the eastern Mingghans.[4]",
    "March 15 – Sultan Muhammad of Ghor is murdered and succeeded by Qutb al-Din Aibak, his deputy in India, who founds the Mamluk Dynasty, the first dynasty of the Delhi Sultanate.[5]",
    "King Valdemar II (the Conqueror) and Archbishop Andreas Sunonis raid Saaremaa Island (modern Estonia), forcing the islanders to submit. The Danes build a fortress, but finding no volunteers to man it, they burn it down themselves and leave the island.",
    "The Livonian Brothers of the Sword, in alliance with the Semigallians, conquer the Livonians (or Livs).",
    "June – King John (Lackland) lands an expeditionary army at La Rochelle to defend his interests in Aquitaine, which is his from the inheritance from his mother, Queen Eleanor of Aquitaine. Meanwhile, French forces led by King Philip II (Augustus) move south to meet John. The year's campaign ends in a stalemate and a two-year truce is made between the two rulers.[6]",
    "Sugar, an import from the Muslim world, is mentioned for the first time in a royal English account. Almonds, cinnamon, ginger, and nutmeg are also imported for royal banquets.[7]",
    "Colchester Royal Grammar School is founded in England.",
    "A peasant named Thurkhill in England claims that Saint Julian took him on a tour of Purgatory. Thurkhill includes realistic touches of descriptions of Purgatory's torture chambers. This is also believed by Roger of Wendover, one of his society's leading historians.[8]",
    "December – The monks of Canterbury want their own sub-prior Reginald for the post of archbishop, while John (Lackland) chooses John de Gray. Pope Innocent III appoints Stephen Langton. Finally, the monks accept the Pope's decision and vote for Langton.",
    "The Arab engineer Ismail al-Jazari describes many mechanical inventions in his book (title translated to English) The Book of Knowledge of Ingenious Mechanical Devices."
  ],
  "births": [
    "April 7 – Otto II, German nobleman (d. 1253)",
    "An-Nasir Dawud, ruler of Damascus (d. 1261)",
    "Béla IV, king of Hungary and Croatia (d. 1270)",
    "Godan Khan, grandson of Genghis khan (d. 1251)",
    "Güyük Khan (or Kuyuk), Mongol emperor (d. 1248)",
    "Henry II, French nobleman (House of Capet) (d. 1229)",
    "Hong Bok-won, Korean general and official (d. 1258)",
    "Ibn Hamdan, Seljuk scholar and judge (d. 1295)",
    "Il-yeon, Korean Buddhist monk and writer (d. 1289)",
    "Margaret de Quincy, English noblewoman (d. 1266)",
    "Maria Laskarina, queen consort of Hungary (d. 1270)",
    "Peter of Verona, Italian friar and preacher (d. 1252)",
    "Sheikh Edebali, Ottoman religious leader (d. 1326)",
    "Yaghmurasen ibn Zyan, Zayyid ruler (d. 1283)"
  ],
  "deaths": [
    "February 4 – Theobald Walter, Norman High Sheriff (b. 1165)",
    "March 5 – Thietmar of Minden (or Dietmar), German bishop",
    "April 7 – Frederick I, German nobleman (House of Lorraine)",
    "April 16 – Kujō Yoshitsune, Japanese nobleman (b. 1169)",
    "June 4 – Adela of Champagne, queen of France (b. 1140)",
    "Artaldus (or Arthaud), French priest and bishop (b. 1101)",
    "Chōgen, Japanese Buddhist monk (kanjin) (b. 1121)",
    "Harald Maddadsson, Norwegian nobleman (b. 1134)",
    "Huan Zong, Chinese emperor of Western Xia (b. 1177)",
    "Ismail al-Jazari, Artuqid polymath and inventor (b. 1136)",
    "Muhammad of Ghor, ruler of the Ghurid Empire (b. 1149)",
    "Ottaviano di Paoli, Italian cardinal-bishop and diplomat",
    "Thierry de Termonde (or Terremonde), Latin constable",
    "William de Burgh, English nobleman (House of Burke)",
    "Yang Wanli, Chinese politician and poet (b. 1127)"
  ]
}