{
  "events": [
    "May – The Second Parliament of Ravennika, convened by Emperor Henry of Flanders, is held in the town of Ravennika in Central Greece, in order to resolve the differences between the princes of Frankish Greece, and the Roman Catholic clergy of their domains. The assembled nobles and prelates conclude a concordat, which recognizes the independence and immunity of all Church property in Frankish Greece from any feudal duties.[1]",
    "July 18 – Battle of Gestilren: King Sverker II (the Younger) is defeated and killed, by the reigning King Eric X (Knutsson). After the battle, Eric takes the Swedish throne and marries Princess Richeza of Denmark, daughter of the late King Valdemar I (the Great). This to improve the relations with Denmark, which has traditionally supported the House of Sverker.",
    "November 18 – Emperor Otto IV is excommunicated by Pope Innocent III after he occupies Apulia in southern Italy. He annuls the Concordat of Worms and demands from Innocent to recognize the imperial crown's right. A German civil war breaks out and Otto prepares an invasion against  Frederick II, king of Sicily.[2]",
    "November 21 – Eric X is crowned – which is the first known coronation of a Swedish king. He strengthens his relationship with his brother-in-law, King Valdemar II (the Conqueror). Shortly after, Valdemar conquers Danzig (modern-day Gdańsk) on the Baltic coast, and Eastern Pomerania from the Slavonic Wends.[3]",
    "Battle of Ümera: Estonian forces defeat the Crusaders of the Livonian Brothers of the Sword. The Estonians pursue the fleeing Crusaders and according to the Livonian Chronicle – some of the prisoners are burned alive – while others have crosses carved on their backs with swords, before being executed as well.[4]",
    "King John (Lackland) extends his taxes and raises £100,000 from church property as an extraordinary fiscal levy; the operation is described as an “inestimable and incomparable exaction” by contemporary sources.[5]",
    "November 1 – John orders that Jews across the country have to pay a tallage, a sum of money to the king. Those who do not pay are arrested and imprisoned. Many Jews are executed or leaving the country.[6]",
    "September 14 – The 18-year-old Maria of Montferrat marries the French nobleman John of Brienne, who brings a dowry of 40,000 silver pounds (from King Philip II (Augustus) and Innocent III). On October 3, the couple is crowned as King and Queen of Jerusalem in Tyre cathedral (modern Lebanon).[7]",
    "Jochi, Mongol leader and eldest son of Genghis Khan, begins a campaign against the Kyrgyz. Meanwhile, Emperor Xiang Zong of Western Xia agrees to submit to Mongol rule, he gives his daughter, Chaka, in marriage to Genghis and pays him a tribute of camels, falcons, and textiles.[8]",
    "December 12 – Emperor Tsuchimikado abdicates the throne in favor of his younger brother, Juntoku, after a 12-year reign. He is the second son of the former Emperor Go-Toba and becomes the 84th emperor of Japan.",
    "1210–1211 – Shazi creates the Pen Box, from Persia (Iran) or Afghanistan (it is now kept at Freer Gallery of Art, Smithsonian Institution, Washington, D.C.).",
    "Gottfried von Strassburg writes his epic poem Tristan (approximate date).",
    "September 24 – Venus occults Jupiter (the last such occurrence until 1570).",
    "Pope Innocent III allows the formation of the mendicant order of Francis of Assisi, to begin the Order of Friars Minor.",
    "The church of St Helen's Bishopsgate in the City of London is founded, as a priory of Benedictine nuns."
  ],
  "births": [
    "May 5 – Afonso III (the Boulonnais), king of Portugal (d. 1279)",
    "June 24 – Floris IV, Dutch nobleman and knight (d. 1234)",
    "July 22 – Joan of England, queen of Scotland (d. 1238)[9]",
    "Alice of Montferrat, queen consort of Cyprus (d. 1233)",
    "Beatrix of Andechs-Merania, German countess (d. 1271)",
    "Birger Jarl (Magnusson), Swedish statesman (d. 1266)",
    "Dervorguilla of Galloway, Scottish noblewoman (d. 1290)",
    "Domentijan, Serbian monk and philosopher (d. 1264)",
    "Honorius IV, pope of the Catholic Church (d. 1287)",
    "Isaac ibn Latif, Spanish Jewish philosopher (d. 1280)",
    "John of Procida, Italian physician and diplomat (d. 1298)",
    "Konoe Kanetsune, Japanese nobleman (kugyō) (d. 1259)",
    "Kujō Norizane, Japanese nobleman and regent (d. 1235)",
    "Loderingo degli Andalò, Italian nobleman (d. 1293)",
    "Margaret (the Lame), German anchoress (d. 1250)",
    "Matilda of Brandenburg, German noblewoman (d. 1261)",
    "Óláfr Þórðarson, Icelandic scholar and skald (d. 1259)",
    "Philippe de Rémi, French poet and knight (d. 1265)",
    "Sapia Salvani, Italian noblewoman (approximate date)",
    "Vicedomino de Vicedominis, Italian cardinal (d. 1276)",
    "Wartislaw III, Polish nobleman and knight (d. 1264)",
    "William of Saliceto, Italian cleric and surgeon (d. 1277)",
    "Xie Daoqing, Chinese empress and regent (d. 1283)"
  ],
  "deaths": [
    "March 29 – Fakhr al-Din al-Razi, Persian polymath (b. 1150)",
    "May 6 – Conrad II, German nobleman and knight (b. 1159)",
    "May 13 – Noriko (or Hanshi), Japanese empress (b. 1177)",
    "July 17 – Sverker II (the Younger), king of Sweden",
    "October 16 – Matilda of Boulogne, duchess of Brabant",
    "November 14 – Qutb al-Din Aibak, Indian ruler (b. 1150)",
    "November 30 – Florence of Holland, Scottish bishop",
    "December 14 – Soffredo, Italian cardinal and patriarch",
    "Aonghus mac Somhairle, Norse-Gaelic chieftain",
    "Gottfried von Strassburg, German poet and writer",
    "Halldóra Eyjólfsdóttir, Icelandic nun and abbess",
    "Jean Bodel, French poet and writer (b. 1165)",
    "Jinul (or Chinul), Korean Zen Master (b. 1158)",
    "Majd al-Din ibn Athir, Zangid historian (b. 1149)",
    "Maud de Braose, English noblewoman (b. 1155)",
    "Muhammad II, ruler of the Alamut state (b. 1148)",
    "Praepositinus, Italian philosopher and theologian",
    "Risteárd de Tiúit, Norman warrior and nobleman",
    "Robert of Braybrooke, English landowner (b. 1168)",
    "William FitzAlan, Norman nobleman and knight"
  ]
}