{
  "events": [
    "Spring – First Barons' War: The English army, led by King John (Lackland), sacks the town of Berwick-on-Tweed (or Berwick), and raids southern Scotland. John pushes up towards Edinburgh over a ten-day period. On his return, he puts down a revolt in East Anglia. On March 24, King John arrives at Hertford, to deal with the challenge of a coming French invasion.[1]",
    "May 18 – John (Lackland) assembles a naval force to defend against a French invasion. Bad storms disperse the fleet, and John spends the summer reorganizing the defenses across the country. He sees several of his military household desert to the Barons, including his half-brother, William Longespée, who is the commander of John's army in the south.[2]",
    "May 21 – Prince Louis of France, son of King Philip II (Augustus), invades England in support of the Barons, landing in Thanet. He enters London without opposition, and is proclaimed, but not crowned, King of England at Old St Paul's Cathedral. In June, Louis captures Rochester Castle and Winchester, and soon controls over half of the English kingdom.[1]",
    "June – The rebel barons besiege Windsor Castle and Dover Castle; the latter is strategically important as the 'gateway to England', controlling the shortest route to France. Meanwhile, John (Lackland) uses Corfe Castle in the southwest as his base of operations, while he plans his campaign against the Barons, and the French invading army under Louis.[3]",
    "October 19 – John (Lackland ) dies of dysentery at Newark Castle (Nottinghamshire). He is succeeded by his 9-year-old son Henry III – with William Marshal, Earl of Pembroke, as regent. The young Henry is crowned as King of England at Gloucester Cathedral, by Peter des Roches (\"Peter from the Rocks\"), bishop of Winchester, on October 28.[4]",
    "November 12 – William Marshal and Cardinal Guala Bicchieri, Italian diplomat and papal legate to England, issue a Charter of Liberties, based on Magna Carta, in the new King of England's name.[4][5]",
    "April 10 – King Eric X (Knutsson) dies of fever after a 8-year reign at Näs Castle on the island of Visingsö. He is succeeded by the 10-year-old John I, son of the former King Sverker II (the Younger) and a rival of Eric.",
    "April 22 – Battle of Lipitsa: The Kievan princes Mstislav Mstislavich and Konstantin of Rostov defeat Konstantin's younger brothers Yuri II and Yaroslav II for the rule of the Principality of Vladimir-Suzdal (modern Russia).",
    "July 24 – Albigensian Crusade: French forces under Raymond VII, count of Toulouse, besiege Castle Beaucaire in May. After three months, the occupants are running low on supplies and surrender to Raymond.[6]",
    "February 14 – King Leo II (the Magnificent) reconquers with support of the Knights Hospitaller the Principality of Antioch. Armenian troops enter Antioch, while Prince Bohemond IV (the One-Eyed) is absent. The Knights Templar, supporting Bohemond, abandon the citadel, and Raymond-Roupen is installed as Prince of Antioch by the Latin Patriarch, Peter II (of Ivrea).[7]",
    "October 8 – Az-Zahir Ghazi, Ayyubid ruler of Aleppo, dies after a 23-year reign. He is succeeded by his 3-year-old son Al-Aziz Muhammad. Because of his young age, Toghril becomes Al-Aziz's regent or guardian (atabeg).",
    "Roger of Wendover, English monk and chronicler, at St Albans Abbey, begins to cover contemporary events, in his continuation of the chronicle Flores Historiarum.",
    "May – Pope Innocent III travels to Perugia to try to settle the long feud between Genoa and Pisa, that both states might contribute to the transport of the Fifth Crusade. There, after a short illness, Innocent dies on July 16. Two days after his death the aged Cardinal Cencio Savelli (later Honorius III) is elected as the 177th pope of the Catholic Church.[8]",
    "December 22 – Honorius III officially approves the Order of Preachers (the Dominican Order), by the Papal bull Religiosam vitam.",
    "Ballintubber Abbey is founded by King Cathal Crobhdearg Ua Conchobair of Connacht, in Ireland."
  ],
  "births": [
    "September 25 – Robert I, French nobleman (d. 1250)",
    "Al-Mahdi Ahmad bin al-Husayn, Arab ruler (d. 1258)",
    "Bernard Ayglerius (or Aygler), French cardinal (d. 1282)",
    "Contardo of Este, Italian nobleman and knight (d. 1249)",
    "Eric IV (the Plowpenny), king of Denmark (d. 1250)",
    "Eric XI (the Lisp and Lame), king of Sweden (d. 1250)",
    "Henry V (the Great), count of Luxembourg (d. 1281)",
    "Liu Bingzhong (or Liu kan), Chinese adviser (d. 1274)",
    "Nijō Yoshizane, Japanese nobleman (kugyō) (d. 1270)",
    "Safi al-Din al-Urmawi, Persian musician (d. 1294)",
    "Stephen Longespée, English seneschal (d. 1260)",
    "Zahed Gilani, Arab Sufi leader and writer (d. 1301)"
  ],
  "deaths": [
    "January 18 – Guy II of Dampierre, French nobleman",
    "January 31 – Theodore II, patriarch of Constantinople",
    "February 23 – Geoffrey de Mandeville, English nobleman",
    "April 10 – Eric X (Knutsson), king of Sweden (b. 1180)",
    "April 27 – Sukeko, Japanese princess and empress",
    "June 11 – Henry of Flanders, Latin emperor (b. 1178)",
    "July 16 – Innocent III, pope of the Catholic Church",
    "September 2 – Peter II (of Ivrea), patriarch of Antioch",
    "October 8 – Az-Zahir Ghazi, Ayyubid ruler of Aleppo",
    "October 19 – John (Lackland), king of England (b. 1166)",
    "Eustace de Vesci, English nobleman and knight (b. 1169)",
    "Fujiwara no Ariie, Japanese nobleman and poet (b. 1155)",
    "Ida of Boulogne, French noblewoman and ruler (b. 1160)",
    "Jetsun Dragpa Gyaltsen, Tibetan spiritual leader (b. 1147)",
    "Kamo no Chōmei, Japanese poet and essayist (b. 1155)"
  ]
}