{
  "events": [
    "Spring – The Polovtsian army assembles on the Terek River lowlands and are joined by Alan, Circassian, and Don Kipchak/Cuman forces. The Mongol army crosses the Caucasus Mountains, but is trapped into the narrow mountain passes. The Mongol generals Subutai and Jebe (the Arrow) sent an embassy to the Polovtsians and convince them to break their alliance with the Caucasian peoples. The Mongol cavalry invades the Caucasus region and devastates the local villages, seizing slaves, cattle and horses.[1]",
    "The Mongol army invades Polovtsian territory and defeats the Polovtsians in a great battle near the Don River. Several Polovtsian leaders are killed – while the remainder flees westwards, across the Dnieper River, to seek support by various Russian princes. Steppe lands east of the Dnieper fall under Mongol control, Subutai and Jebe raise the wealthy city of Astrakhan on the Volga River. Subutai now parts his forces, he moves south to the Crimea (or Tauric Peninsula), while Jebe travels towards the Dnieper.[2]",
    "Mongol forces capture the nominally Genoese trading outpost of Sudak, probably with the tacit approval of neighbouring rival Venetian outposts in the Crimea. Subutai promises to destroy any non-Venetian colonies in the area. In return, the Venetians provide Subutai with information about the kingdoms in Eastern Europe. Meanwhile, Köten Khan, Cuman/Kipchak chieftain of the Polovtsians, convinces Prince Mstislav Mstislavich of Galicia to form an alliance, and informs him of his plight against the Mongols.[3]",
    "February – A council of Russian princes summons at Kiev; several princes are convinced by Köten Khan to assemble an allied army to drive the Mongols back. During the first half of March, Russian princes return to their principalities and begin to raise forces for the forthcoming campaign. The alliance has a combined force of some 60,000 men, mainly cavalry. Subutai unites his army with Jebe, and sends ambassadors to the Kievan Rus' princes, to tell them to stay out of the conflict as it didn't involve them.[4]",
    "April – The Russian princes lead their separate armies from different parts of Russia, to assemble 60 kilometres downriver from Kiev. There are three main groups of princes taking part in the campaign; the Kievan army is represented by Grand Prince Mstislav Romanovich (the Old). The second group are the Chernigov and Smolensk armies under Prince Mstislav II. The third group is the Galician-Volhynian army under Mstislav Mstislavich with his son-in-law Daniel of Galicia, leaving from northern Ukraine.[5]",
    "The Mongol leaders Subutai and Jebe receive news that Jochi, who camps north of the Caspian Sea, will not be able to provide the expected reinforcements due to Jochi's reported illness or suspected refusal to obey his father Genghis Khan's orders. Subutai sends an embassy to the Russian princes, to offer peace and perhaps attempt to break the Russian alliance with the Polovtsians. But the Mogol ambassadors are executed – a task eagerly carried out by Köten Khan's followers, by the end of April.[6]",
    "Late April – The Russian and Polovtsian armies march down the west bank of the Dnieper River. Within a few days of the march beginning, a second group of Mongol ambassadors appear in the Russian camp and again offer peace. When their offers are rebuffed, the ambassadors are allowed to leave unharmed. Meanwhile, Russian forces from Galicia arrive by boat or cart-loads of equipment and food, along the Black Sea coast and up the Dnieper River. Screened by Mongol forces on the east bank.[7]",
    "May 15 – The Russian army gathers on the island of Khortytsia, later to become a famous Cossack base, at the mouth of the Dnieper River, next to modern-day Zaporizhzhia (Ukraine). The main Polovtsian forces led by Köten Khan, join the Russians here, which consist entirely of mounted archers. Compare to this, some 20,000–25,000 Mongols assemble and build a defensive encampment on the high ground, probably on the northern slopes of the Mohila Bel'mak hills, located near the Konka River.[8]",
    "May 16 – Mstislav Mstislavich leads a small detachment of his own men, and some Polovtsians to the far bank of the Dnieper River – where they attack a part of the Mongol advance guard. The Mongols promptly fleeing into the steppes. Mstislavich pursues them and captures their commander named Gemyabek or Hamabek who seeks refuge behind a wooden fence surrounding a Polovtsian burial site. The captive's fate is sealed when the Polovtsians ask Mstislavich to hand him over – to execute.[9]",
    "May 17 – Daniel of Galicia leads a reconnaissance in force east of the Dnieper River, using a bridge of boats. He defeats a Mongol detachment, who abandons their herds and local prisoners. Following these successful sorties, the entire Russian and Polovtsian armies start a 9-days march towards the main Mongol army. Numerous carts move across the steppes, loaded with mail, heavy armour, as well as shields, protected by Russian cavalry. The Mongol forces retreat towards the Kalka River.[10]",
    "Late May – The Mongol army under Subutai and Jebe establishes a defensive position on the Kalka River. Increasing disagreements amongst the Russian princes, about the wisdom of continuing to pursue the Mongols deeper into the steppes. By the end of May, the allied forces reach the banks of the Kalka River. The Polovtsian vanguard is way ahead of the rest of the Russian army, which gives them a triumphant feeling. Meanwhile, Subutai and Jebe set up a trap against the Russian forces.[11]",
    "May 31 – Battle of the Kalka River: The Russian cavalry attacks successful the Mongol vanguard, and crosses the Kalka River. The Polovtsian and Volhynian cavalry led by Daniel of Galicia forms the Russian vanguard. Meanwhile, the army of Kiev waits on the western side of the Kalka River. The Russians fail to co-ordinate their attacks, they advance in separate formations and become divided by the Kalka River. In the afternoon, the Russian army collapses under continuous Mongol attacks.[12]",
    "June – Mstislav Mstislavich escapes with the remnants of his Galician army back to the Dnieper River. Mstislav Romanovich (the Old) surrenders and is executed. According to sources, he and other Russian nobles are slowly suffocated to death during a Mongol 'drunken feast', they are tied up and laid flat on the ground beneath what is described as a wooden 'bridge' (or platform), on which Subutai, Jebe and their officers feast. This in revenge for killing the Mongol ambassadors.[13]",
    "Battle of Samara Bend: A Volga-Bulgarian army under Ghabdula Chelbir defeats the Mongols, probably led by Subutai, Jebe and Jochi. The Bulgars retreat during the battle but the Mongols pursue them. Then the main Bulgar forces ambush the Mongols. Subutai and Jebe retreat their forces near the city of Sarai (future capital of the Golden Horde), not far from where the Volga River empties into the Caspian Sea.[14]",
    "Autumn – Mongol forces under Jochi, Subutai and Jebe attack and defeat the Qangl Turks (eastern Kipchaks or Wild Polovtsians), killing their ruler. During the winter, they continue eastwards across the Great Steppe. Jebe (possibly poisoned) suddenly dies of a fever near the Imil River.[15]",
    "Livonian Crusade: The Estonians revolt against the Livonian Brothers of the Sword and Denmark, and for a brief period reconquer all of their strongholds except for Tallinn.",
    "January 29 – Battle of Viljandi: The Sakalians attack the Germans inside the stronghold of Viljandi Castle. The Estonian forces kill Sword Brothers and many merchants.",
    "March 25 – King Afonso II (the Fat) dies after a 12-year reign. He is succeeded by his eldest son, Sancho II (the Pious), who becomes sole ruler of Portugal.",
    "July 14 – King Philip II (Augustus) dies of a fever while traveling to Paris. He is succeeded by his son, Louis VIII (the Lion), who is crowned ruler of France.",
    "Spring – The Mongol army led by Muqali (or Mukhali) strikes into Shaanxi Province, attacking Chang'an while Genghis khan is invading the Khwarazmian Empire. The garrison (some 200,000 men) in Chang'an is too strong and Muqali is forced to pillage Feng County. During the campaign, Muqali becomes seriously ill and dies, while his forces are consolidating their position on both sides of the Yellow River.[16]",
    "November 29 – Pope Honorius III approves the Franciscan Rule (also called \"Regula Bullata\"). The rule set regulations for discipline, preaching, and entering the order for Franciscan friars."
  ],
  "births": [
    "January 25 – Maud de Lacy, English noblewoman (d. 1289)",
    "Baibars, Mamluk sultan of Egypt and Syria (d. 1277)",
    "Eleanor of Provence, queen of England (d. 1291)",
    "Frederick of Castile, Spanish nobleman (d. 1277)",
    "Guido I da Montefeltro, Italian nobleman (d. 1298)",
    "Hugh le Despencer, English nobleman (d. 1265)",
    "Ibn Abd al-Zahir, Egyptian historian (d. 1293)",
    "Ichijō Sanetsune, Japanese nobleman (d. 1284)",
    "John Fitzalan II, English nobleman (d. 1267)",
    "Llywelyn ap Gruffudd, prince of Wales (d. 1282)",
    "Michael VIII (Palaiologos), Byzantine emperor (d. 1282)",
    "Mugai Nyodai, Japanese Zen Master (d. 1298)",
    "Stefan Uroš I (the Great), king of Serbia (d. 1277)"
  ],
  "deaths": [
    "March 8 – Wincenty Kadłubek, bishop of Kraków  (b. 1150)",
    "March 25 – Afonso II (the Fat), king of Portugal (b. 1185)",
    "May 31 – Mstislav Svyatoslavich, Kievan prince (b. 1168)",
    "June 4 – Hugh of Beaulieu, English abbot and bishop",
    "July 7 – Ibn Qudamah, Umayyad theologian (b. 1147)",
    "July 8 – Konoe Motomichi, Japanese nobleman (b. 1160)",
    "July 14 – Philip II (Augustus), king of France (b. 1165)",
    "Alamanda de Castelnau, French troubadour and writer",
    "Fernán Gutiérrez de Castro, Spanish nobleman (b. 1180)",
    "Gerald of Wales, Norman archdeacon and writer (b. 1146)",
    "Gille Brigte of Strathearn, Scottish nobleman (b. 1150)",
    "Henry I (the Elder), German nobleman and knight (b. 1158)",
    "Ibn Tumlus, Andalusian scholar and physician (b. 1164)",
    "Jebe (the Arrow), Mongol general (approximate date)",
    "Mstislav Romanovich (the Old), Grand Prince of Kiev",
    "Muqali (or Mukhulai), Mongol military leader (b. 1170)",
    "Sancho (or Sanche), Aragonese nobleman (b. 1161)",
    "Unkei, Japanese Buddhist monk and sculptor (b. 1150)",
    "William de Cornhill, English archdeacon and bishop",
    "Ye Shi, Chinese philosopher and politician (b. 1150)"
  ]
}