{
  "events": [
    "June 15 – Battle of Agridi: The Cypriot army under King Henry I (the Fat) defeats the Lombard forces of Emperor Frederick II. After the battle, John of Beirut (supported by funds from Henry), hires 13 Genoese war-galleys to aid in the siege of Kyrenia.[1]",
    "July 16 – Muhammad I is elected as ruler of the Taifa of Arjona. He revolts against Ibn Hud, the independent ruler of Al-Andalus, and takes control of the city. Beginning the foundation of the Nasrid Dynasty.[2]",
    "July 29 – King Henry III dismisses his justiciar (chief justice minister) and regent Hubert de Burgh, and replaces him with the Frenchmen Peter des Roches and Peter de Rivaux, thereby irritating his barons.[3]",
    "Peter de Rivaux, nephew of Peter des Roches, is made Lord Treasurer of Henry III's household and keeper of the king's wardrobe. This moves him into an important position for controlling the king's affairs.",
    "The Almohad army besieges the city of Ceuta, where Abu Musa, rebellious brother of Caliph Idris al-Ma'mun, has received shelter and the support of the population. The Genoese rent a part of their fleet to the rebels, who successfully resist the forces of the caliph. The consequences of this revolt are threefold: the city becomes de facto independent from the Almohads, but its reliance on the Italian maritime powers increases, and the Trans-Saharan trade routes begin to shift eastward, due to the local turmoil.[4]",
    "February 9 – Battle of Sanfengshan: The Mongol army (some 50,000 warriors) defeats the Chinese Jin forces near Yuzhou. General Subutai successfully wipes out the last field army of the Jin Dynasty – therefore sealing its fate of falling to the Mongol Empire. During the encounter also called the Battle of the Three-Peak Mountain, Emperor Aizong of Jin orders the Jin army (some 150,000 men) to intercept the Mongols. The Jin soldiers are constantly harassed by small groups of Mongol cavalry on the way. When they arrive at Sanfeng Mountain, the Jin army is hungry and exhausted by heavy snowfall. The Jin forces are quickly defeated by the Mongols and fled in all directions.",
    "April 8 – Mongol–Jin War: The Mongol army led by Ögedei Khan and his brother Tolui begins the siege of Kaifeng, capital of the Chinese Jin Dynasty. During the summer, the Jurchens try to end the siege by negotiating a peace treaty, but the assassination of a Mongol embassy makes further talks impossible. While the negotiations are going on, a plague is devastating the population of the city. In the meantime, supplies stored at Kaifeng are running out, and several residents of the city are executed on the suspicion that they are traitors.[5]",
    "June – Mongol invasion of Korea: Choe Woo, Korean military dictator of Goryeo, orders against the pleas of King Gojong and his senior officials, the royal court, and most of Songdo's population to be moved to Ganghwa Island. Woo starts the construction of strong defenses on Ganghwa Island, which becomes a fortress. The government orders the common people to flee the countryside and take refuge in major cities, mountain citadels, or nearby islands. The Mongols occupy much of northern Korea, but fail to capture Ganghwa Island.",
    "December 16 – Battle of Cheoin: Korean forces defeat a Mongol attack at Cheoin (modern-day Yongin). The Mongol Empire concludes a peace treaty with Goryeo and withdraws his forces.",
    "November 17 – Emperor Go-Horikawa abdicates in favor of his 1-year-old son, Shijō, after a 11-year reign. Because he is very young, most of the actual leadership is held by his relatives.",
    "The original set of woodblocks of the Tripitaka Koreana is destroyed by fire during the Second Mongol invasion of Korea.",
    "The northern French city of Troyes issues its first recorded life annuities, confirming the trend of consolidation of local public debts initiated in 1218, by the neighboring city of Reims.[6]",
    "May 30 – Anthony of Padua is canonized by Pope Gregory IX at Spoleto, less than a year after his death.[7] He becomes the patron saint of lost items.",
    "August – Gregory IX is forced to remain in his summer residence at Anagni by Lombard forces from Rome.[8]",
    "October 29 – Gregory IX orders the Stedinger Crusade to be proclaimed in northern Germany.[9]"
  ],
  "births": [
    "March 9 – Chen Wenlong, Chinese scholar-general (d. 1277)",
    "November 10 – Haakon the Young, king of Norway (d. 1257)",
    "Arnolfo di Cambio, Italian architect and sculptor (d. 1310)",
    "Bernard Saisset, French nobleman and bishop (d. 1314)",
    "Elisabeth of Wrocław, duchess of Greater Poland (d. 1265)",
    "Fujiwara no Kimiko, Japanese empress consort (d. 1304)",
    "Gerhard I, German nobleman, knight and regent (d. 1290)",
    "Gertrude of Hackeborn, German nun and abbess (d. 1292)",
    "John Giffard, English nobleman and rebel leader (d. 1299)",
    "Manfred, king of Sicily (House of Hohenstaufen) (d. 1266)",
    "Nicholas of Gorran, French prior and theologian (d. 1295)",
    "Ramon Llull, Spanish missionary and theologian (d. 1316)"
  ],
  "deaths": [
    "January 28 – Peire de Montagut, French Grand Master",
    "February 21 – Myōe, Japanese Buddhist monk (b. 1173)",
    "April 10 – Rudolf II (the Kind), German nobleman",
    "June 7 – Wawrzyniec (or Lawrence), Polish bishop",
    "July 18 – John de Braose, English nobleman and knight",
    "August 24 – Ralph of Bristol, English cleric and bishop",
    "October 11 – Gebhard I of Plain, German bishop (b. 1170)",
    "October 15 – Albert I of Käfernburg, German archbishop",
    "October 17 – Idris al-Ma'mun, ruler of the Almohad Caliphate",
    "October 26 – Ranulf de Blondeville, English nobleman (b. 1170)",
    "December 31 – Patrick I, Scottish nobleman and knight (b. 1152)",
    "Azalaïs of Montferrat, Italian noblewoman and regent (b. 1150)",
    "Michael Scot, Scottish mathematician and scholar (b. 1175)",
    "Muhammad al-Faqih al-Muqaddam, Arab scholar (b. 1178)",
    "Nasu no Yoichi, Japanese nobleman and samurai (b. 1169)",
    "Tolui, Mongol general and son of Genghis Khan (b. 1191)",
    "Walter Capellanus, Scottish cleric, bishop and politician",
    "Wincenty of Niałek, Polish nobleman and archbishop"
  ]
}