{
  "events": [
    "Connacht in Ireland is finally conquered by the Hiberno-Norman Richard Mór de Burgh; Felim Ua Conchobair is expelled.[1][2]",
    "A general inquisition begins in France.[3][4]",
    "The Byzantine emperor John III Doukas Vatatzes and the Bulgarian tsar Ivan Asen II besiege Constantinople, in an attempt to take it from its Latin rulers, John of Brienne and Baldwin II. Angelo Sanudo successfully negotiates a two-year truce.[5][6]",
    "Elizabeth of Hungary (d. 1231) is canonized, by Pope Gregory IX.[7][8]",
    "A Chinese text of this year records that Hangzhou City, the capital of the Song Dynasty, held various social clubs that included a West Lake Poetry Club, the Buddhist Tea Society, the Physical Fitness Club, the Anglers' Club, the Occult Club, the Young Girls' Chorus, the Exotic Foods Club, the Plants and Fruits Club, the Antique Collectors' Club, the Horse-Lovers' Club, and the Refined Music Society.[9][10]",
    "Probable date – The Lancaster Royal Grammar School is founded in England.[11][12]",
    "Approximate date – Battle of Kirina: Mandinka prince Sundiata Keita defeats Sosso king Soumaoro Kanté, beginning the Mali Empire. By tradition, the Manden Charter, a constitution, is proclaimed in Kouroukan Fouga.[13]"
  ],
  "births": [
    "November 2 – Henry of Almain, King of the Romans (d. 1271)[14][15]",
    "probable\nPope Boniface VIII (approximate date; d. 1303)[16]\nRamon Llull, Catalan writer and philosopher (d. 1315)[17][18]\nYolanda of Poland, saint (d. 1298)[citation needed]\nArnold of Villanova, Spanish alchemist and physician (d. 1311)[19][20]\nQian Xuan, Chinese painter (d. 1305)[21][22]",
    "Pope Boniface VIII (approximate date; d. 1303)[16]",
    "Ramon Llull, Catalan writer and philosopher (d. 1315)[17][18]",
    "Yolanda of Poland, saint (d. 1298)[citation needed]",
    "Arnold of Villanova, Spanish alchemist and physician (d. 1311)[19][20]",
    "Qian Xuan, Chinese painter (d. 1305)[21][22]"
  ],
  "deaths": [
    "September 5 – Henry I, Duke of Brabant (b. 1165)[23][24]",
    "September 21 – King Andrew II of Hungary (b. 1175)[25][26]",
    "November 5 – Elisabeth of Swabia, queen consort of Castile and León (b. 1205)[27][28]",
    "date unknown\nAndronikos I Gidos, Emperor of Trebizond[29]\nRabbi David Kimhi, French Biblical commentator (b. 1160)[30][31]\nIbn al-Qabisi (b. 1163) [32]",
    "Andronikos I Gidos, Emperor of Trebizond[29]",
    "Rabbi David Kimhi, French Biblical commentator (b. 1160)[30][31]",
    "Ibn al-Qabisi (b. 1163) [32]"
  ]
}