{
  "events": [
    "March 18 – Battle of Chmielnik (Mongol invasion of Poland): The Mongols overwhelm the feudal Polish armies of Sandomierz and Kraków provinces, and plunder the abandoned city of Kraków.[1][2]",
    "April 9 – Battle of Legnica: The Mongols, under the command of Baidar, Kadan and Orda Khan, defeat the feudal Polish nobility, including the Knights Templar.[3][4]",
    "April 11 – Battle of Mohi: Batu Khan and Subutai defeat Béla IV of Hungary. The battle is the last major event in the Mongol Invasion of Europe.[5][6]",
    "May – Battle of Giglio: an Imperial fleet defeats a Genoan fleet in the Tyrrhenian Sea.[7][8]",
    "May 10 – Battle of Cameirge in Ulster: The Milesian Irish septs of the Ó Dónaills from Donegal, the Ó Néills from Armagh and the Ó Dochartaighs of Connacht defeat the last Tuatha Dé Danann sept, the Meic Lochlainn of Tír Eoghain and Inishowen under Domhnall mac Muirchertaigh Mac Lochlainn. From now on the Kings of Tír Eoghain will all be of the Ó Néill dynasty, Brian Ua Néill becoming sole ruler.[9]",
    "Early northern summer – A succession crisis or other priorities results in the Mongols withdrawing behind their river barrier into the Ukraine and the Russias, leaving Central Asian and far Eastern Europe peoples tributary to the Khanates, but leaving Poland and Hungary to begin recovery and reorganization.[10][11]",
    "August 29 – After Henry III of England's invasion of Wales, the Treaty of Gwerneigron is signed by him and Dafydd ap Llywelyn, curbing the latter's authority and denying him royal title.[12][13]",
    "September 23 – Snorri Sturluson, Icelandic saga writer, is murdered by Gissur Þorvaldsson, an emissary of King Haakon IV of Norway.[14][15]",
    "October 25 – Pope Celestine IV succeeds Pope Gregory IX, as the 179th pope.[16][17]",
    "Emperor Lizong of Song China accepts the Neo-Confucian teachings of the late Zhu Xi, including his commentary on the Four Books. This will have an impact upon the philosophical schools of surrounding countries as well, including Korea, Japan, and Vietnam.[18][19]",
    "Livonian Crusade: The Estonian rebellion of 1237 is suppressed on Saaremaa Island, by the Livonian Order.[20][21]",
    "The University of Valladolid is founded in Spain.[22]"
  ],
  "births": [
    "September 4 – King Alexander III of Scotland (d. 1286)[23][24]",
    "Eleanor of Castile, queen of Edward I of England (d. 1290)[25]",
    "Sophia of Denmark, queen consort of Sweden (d. 1286)[26]"
  ],
  "deaths": [
    "March 31 – Pousa, voivode of Transylvania[27][28]",
    "March 28 – Valdemar II of Denmark (b. 1170)[29][30]",
    "April 9 – Duke Henry II of Poland[31][32][33]",
    "June 24 – Ivan Asen II of Bulgaria[34][35]",
    "August 10 – Eleanor, Fair Maid of Brittany (b. c. 1184)[36][37]",
    "August 22 – Pope Gregory IX[38][39]",
    "September 20 – Conrad II of Salzwedel, German nobleman and bishop[40]",
    "September 23 – Snorri Sturluson, Icelandic historian, poet and politician (b. 1178)[14][15]",
    "September 26 – Fujiwara no Teika, Japanese poet[41][42]",
    "November 10 – Pope Celestine IV[43][44]",
    "December 1 – Isabella of England, Holy Roman empress, spouse of Frederick II, Holy Roman Emperor (b. 1214)[45][46]",
    "Bernardo di Quintavalle, Italian follower of St. Francis of Assisi[47]",
    "Mary, Countess of Blois (b. 1200)[48]",
    "Buzád Hahót, Hungarian nobleman and Christian martyr[49]",
    "Ögedei Khan, 2nd Khagan of the Mongol Empire and successor to Genghis Khan (b. c. 1185)[50][51]",
    "Baba Ishak, charismatic Turkman preacher (b. c. 1239)[52][53]"
  ]
}