{
  "events": [
    "March – King Ferdinand III (the Saint) turns the independent Taifa of Murcia into a protectorate and initiates the process of the colonization and Christianization of the region. He receives the submission of the Moors under the terms of a peace agreement (the famous Treaty of Alcaraz).",
    "April 27 – Treaty of Bordeaux: King Louis IX (the Saint) and King Henry III agree to a truce that ends the Saintonge War. The truce does not stop the on-going clashes (and further tensions) between France and England.[1]",
    "Siege of Viterbo: Emperor Frederick II besieges Viterbo on request of the rebel citizens. The defenders are able to set fire to the siege towers and after signing a peace treaty, Frederick is persuaded to withdraw his army.[2]",
    "Siege of Montségur: French forces (some 10,000 men) begin the siege of Château de Montségur to raze the stronghold held by the rebellious Cathars. The castle is defended by some 100 troops and 500 refugees.[3]",
    "May 1 – The Castillan troops are garrisoned in Murcia, to support the Hudid Dynasty.[4]",
    "Spring – Henry III bestows the custody of Kenilworth Castle to Simon de Montfort. Simon's wife Eleanor, Henry's sister, already owned Odiham Castle (or King John's Castle) so Simon has two of the strongest fortresses in England under his control.",
    "June 12 – A Crusader force under Balian III, lord of Beirut, captures Tyre after a long siege. The barons seize the citadel on July 10, with the help of Alice, queen of Cyprus, whose forces arrive on June 15. This ending the War of the Lombards.[5]",
    "June 26 – Battle of Köse Dağ: The Mongols under Baiju Noyan defeat the Seljuk Turks of the Sultanate of Rum and their Byzantine allies. The Seljuks and the Empire of Trebizond become vassals of the Mongols.",
    "June 25 – Pope Innocent IV succeeds Celestine IV as the 180th pope of the Catholic Church, after a sede vacante of 7 months."
  ],
  "births": [
    "May 31 – James II, Aragonese ruler of Majorca (d. 1311)",
    "June 6 – Alix of Brittany, Breton noblewoman (d. 1288)",
    "June 28 – Go-Fukakusa, emperor of Japan (d. 1304)",
    "September 2\nGilbert de Clare, English nobleman (d. 1295)\nWalter Langton, bishop of Coventry (d. 1321)",
    "Gilbert de Clare, English nobleman (d. 1295)",
    "Walter Langton, bishop of Coventry (d. 1321)",
    "Alfonso Fernández el Niño, Spanish nobleman (d. 1281)",
    "An Hyang (or Ahn Yu), Korean Confucian scholar (d. 1306)",
    "Augustinus Triumphus, Italian hermit and writer (d. 1328)",
    "Awaji Nichiken, Japanese Buddhist monk (d. 1338)",
    "Giles of Rome, Italian friar and archbishop (d. 1316)",
    "John I of Chalon-Auxerre, French nobleman (d. 1309)",
    "Riccoldo da Monte di Croce, Italian missionary (d. 1320)",
    "Roger Bernard III, French nobleman and poet (d. 1302)",
    "Zhenjin (or Chingkim), Mongolian prince (d. 1286)"
  ],
  "deaths": [
    "January 17 – Herman V, German nobleman (b. 1180)",
    "January 19 – Konoe Iezane, Japanese nobleman (b. 1179)",
    "February 20 – Romano Bonaventura, Italian cardinal",
    "March 10 – Cyril III, patriarch of Alexandria (b. 1175)",
    "April 25 – Boniface of Valperga, Italian monk and bishop",
    "May 3 – Hawise of Chester, English noblewoman (b. 1180)",
    "May 4 – Hubert de Burgh, English Chief Justiciar (b. 1170)",
    "May 7 – Hugh d'Aubigny, English nobleman and knight",
    "June 4 – Constance, margravine of Meissen (b. 1212)",
    "June 26 – Dardin Shervashidze, Georgian nobleman",
    "August 16 – Stepan Tverdislavich, Russian posadnik",
    "October 15 – Hedwig of Silesia, Polish duchess (b. 1174)",
    "October 26 – Bernat Calbó (or Calvó), Catalan bishop",
    "Ermengol IX, Catalan nobleman and child ruler (b. 1235)",
    "Fujiwara no Reishi, Japanese empress consort (b. 1185)",
    "Haymo of Faversham, English priest and philosopher",
    "Indravarman II, Cambodian ruler of the Khmer Empire",
    "Maol Eoin Ó Crechain, Irish priest and archdeacon",
    "Margaret of Burgundy, countess of Savoy (b. 1192)",
    "Umm Assa'd bint Isam al-Himyari, Arab female poet"
  ]
}