{
  "events": [
    "April 6 – Saint Peter of Verona is assassinated by Carino of Balsamo.[1][2]",
    "May 15 – Pope Innocent IV issues the papal bull Ad exstirpanda, which authorizes the torture of heretics in the Medieval Inquisition. Torture quickly gains widespread usage across Catholic Europe.[3][4]",
    "June 1 – Alfonso X is proclaimed king of Castile and León.[5]",
    "July – The settlement of Stockholm in Sweden is founded, by Birger Jarl.[6][7]",
    "December 25 – Christopher I of Denmark is crowned King of Denmark, in the Lund Cathedral.[8][9]",
    "The Polish land of Lebus is incorporated into the German state of Brandenburg, marking the start of Brandenburg's expansion into previously Polish areas (Neumark).[10]",
    "The Lithuanian city of Klaipėda (Memel) is founded by the Teutonic Knights.[11][12]",
    "The town and monastery of Orval Abbey in Belgium burn to the ground; rebuilding takes 100 years.[13]",
    "Thomas Aquinas travels to the University of Paris, to begin his studies there for a master's degree.[14][15]",
    "In astronomy, work begins on the recording of the Alfonsine tables.[16]",
    "The classic Japanese text Jikkunsho is completed.[17][18]",
    "The Chinese era Chunyou ends.[19]",
    "The Mongols take the westernmost province of the Song Dynasty empire.[20]"
  ],
  "births": [
    "March 25 – Conradin, Duke of Swabia (d. 1268)[21][22]",
    "Safi-ad-din Ardabili, Persian Sufi leader[23][24]",
    "Eleanor de Montfort, princess of Wales (d. 1282)[25][26]"
  ],
  "deaths": [
    "January – Bohemond V, Prince of Antioch[27][28]",
    "January 23 – Isabella, Queen of Armenia[29]",
    "February 3 – Sviatoslav III of Vladimir, Prince of Novgorod (b. 1196)[30]",
    "April 6 – Saint Peter of Verona[2]",
    "May 3 or May 4 – Günther von Wüllersleben, Grand Master of the Teutonic Knights[31][32]",
    "May 30 – King Ferdinand III of Castile and Leon[33][34]",
    "June 6 – Robert Passelewe, Bishop of Chichester[35]",
    "June 9 – Otto I, Duke of Brunswick-Lüneburg[36][37]",
    "June 29 – Abel, King of Denmark (b. 1218)[38][39]",
    "August 1 – Giovanni da Pian del Carpine, Italian chronicler of the Mongol Empire[40][41]",
    "November 27 – Blanche of Castile, queen of Louis VIII of France and regent of France (b. 1188)[42][43]",
    "date unknown\nJohn of Basingstoke, English scholar and ecclesiastic[44][45]\nHenry I, Count of Anhalt[46]\nSorghaghtani Beki, Mongolian empress and regent[47][48]\nSaint Zdislava Berka[49]\nKujō Michiie, Japanese regent[50]\nCatherine of Ymseborg, Swedish queen consort[citation needed]\nYesu Mongke, Khan of the Chagatai Khanate[51]",
    "John of Basingstoke, English scholar and ecclesiastic[44][45]",
    "Henry I, Count of Anhalt[46]",
    "Sorghaghtani Beki, Mongolian empress and regent[47][48]",
    "Saint Zdislava Berka[49]",
    "Kujō Michiie, Japanese regent[50]",
    "Catherine of Ymseborg, Swedish queen consort[citation needed]",
    "Yesu Mongke, Khan of the Chagatai Khanate[51]"
  ]
}