{
  "events": [
    "March 13 – Treaty of Nymphaeum: Emperor Michael VIII (Palaiologos) signs a trade and defense agreement with the Republic of Genoa to counterweight the Venetian presence in the region. Genoa agrees to ally with the Empire of Nicaea by providing a fleet of up to 50 galleys during the projected Nicaean siege of Constantinople, while 16 galleys are to be immediately sent against the Latin Empire.[1]",
    "July – Michael VIII (Palaiologos) sends his general Alexios Strategopoulos with a small advance force of 800 soldiers, most of them Cumans, to keep watch on the Bulgarians and scout the defending positions of the Latin forces in the surroundings of Constantinople. When they reach the village of Selymbria, Strategopoulos is informed by local farmers that the entire Latin garrison and the Venetian fleet, are absent conducting a raid against the Nicaean island of Daphnousia. He decides not to lose such a golden opportunity and makes plans (without the consent of Michael) to retake the capital.[2]",
    "July 25 – Reconquest of Constantinople: Alexios Strategopoulos and his men hide at a monastery near the city gates, before entering through a secret passage. After a short struggle, the guards who are completely taken by surprise are killed and the Venetian quarter is set ablaze. Panic spreads through the capital and Emperor Baldwin II rushes out to save his life, evacuating along with many other Latins with the help of the Venetian fleet. Baldwin manages to escape to the still Latin-held parts of Greece, but Constantinople is lost for good.[3]",
    "June 12 – King Henry III of England obtains a papal bull releasing him from his oath to maintain the Provisions of Oxford, setting the stage for the Second Barons' War (1263–1267).[4]",
    "July 4 – Baybars becomes the new Mamluk Sultan of Egypt.[1]",
    "July 23 – Battle of Callann: The Normans, under John FitzGerald, 1st Baron Desmond, are defeated by the Gaelic forces of Fínghin Mac Carthaigh, King of Desmond.[5]",
    "August 15 – The Nicaean ruler Michael VIII Palaiologos is crowned Byzantine Emperor in Constantinople.[1]",
    "August 29 – Pope Urban IV succeeds Pope Alexander IV as the 182nd pope, the last man to do so without being a cardinal first.",
    "December 25 – The 11-year-old John IV Laskaris is blinded by order of his cousin and nominal co-ruler of the Byzantine Empire, Michael VIII Palaiologos, in Nicaea to render him ineligible for the throne, and he is exiled.",
    "The population of Greenland accepts the overlordship of the King of Norway.",
    "Livonian Crusade: The Estonian rebellion on Saaremaa Island is forced down by the Livonian Order.",
    "The Japanese Bun'ō era ends, and the Kōchō era begins.",
    "Baibars reestablishes the Abbasid Caliphate in Cairo.",
    "Béla IV of Hungary repels a Tatar invasion.",
    "Kublai Khan, who became a Khagan claimant in the previous year, releases 75 Song dynasty Chinese merchants from captivity, after they had been captured along the border of his Empire and the Southern Song dynasty of China. This is an act to increase his reputation amongst the Chinese, shore up his legitimacy as a just ruler, and to gain more defectors from the Southern Song dynasty.",
    "The Convent of Wurmsbach is established in Switzerland.",
    "The earliest extant Chinese illustration of \"Pascal's triangle\" is from Yang Hui's book Xiangjie Jiuzhang Suanfa, published this year, although knowledge of it existed in China by at least 1100."
  ],
  "births": [
    "February 1 – Walter de Stapledon, English bishop (d. 1326)",
    "February 11 – Otto III, Duke of Bavaria (d. 1312)",
    "February 28 – Margaret of Scotland, Queen of Norway (d. 1283)",
    "March 1 – Hugh le Despenser, 1st Earl of Winchester (d. 1326)",
    "July 25 – Arthur II, Duke of Brittany (d. 1312)",
    "October 9 – King Denis of Portugal (d. 1325)",
    "date unknown\nBohemond VII, Count of Tripoli, prince of Antioch (d. 1287)\nPrince Daniel of Moscow, son of Alexander Nevsky (d. 1303)\nKonoe Iemoto, Japanese kugyō (d. 1296)\nAlbertino Mussato, Italian statesman and writer (d. 1329)\nWładysław I the Elbow-high, King of Poland (d. 1333)\nConstantine Palaiologos, Byzantine prince and general (d. 1306)",
    "Bohemond VII, Count of Tripoli, prince of Antioch (d. 1287)",
    "Prince Daniel of Moscow, son of Alexander Nevsky (d. 1303)",
    "Konoe Iemoto, Japanese kugyō (d. 1296)",
    "Albertino Mussato, Italian statesman and writer (d. 1329)",
    "Władysław I the Elbow-high, King of Poland (d. 1333)",
    "Constantine Palaiologos, Byzantine prince and general (d. 1306)"
  ],
  "deaths": [
    "February 28 – Henry III, Duke of Brabant",
    "May 25 – Pope Alexander IV",
    "July 8 – Adolf IV of Holstein, Count of Schauenburg",
    "September – Plaisance of Antioch, queen of Cyprus",
    "September 18 – Konrad von Hochstaden, Archbishop of Cologne",
    "November 9 – Sanchia of Provence, queen consort of Germany",
    "date unknown\nAn-Nasir Dawud, Ayyubid sultan of Damascus and Emir of Kerak\nBettisia Gozzadini, Italian scholar (b. 1209)\nQin Jiushao, Chinese mathematician of the Song dynasty (b. 1202)\nPatriarch Nicephorus II of Constantinople\nStephen of Bourbon, French Dominican preacher (b. c. 1180)",
    "An-Nasir Dawud, Ayyubid sultan of Damascus and Emir of Kerak",
    "Bettisia Gozzadini, Italian scholar (b. 1209)",
    "Qin Jiushao, Chinese mathematician of the Song dynasty (b. 1202)",
    "Patriarch Nicephorus II of Constantinople",
    "Stephen of Bourbon, French Dominican preacher (b. c. 1180)"
  ]
}