{
  "events": [
    "July – Scottish–Norwegian War: Haakon IV of Norway sets sail to defend the Hebrides, against Alexander III of Scotland.",
    "October 2 – Battle of Largs: an inconclusive battle in the Scottish–Norwegian War fought in Scotland, between kings Haakon IV of Norway and Alexander III of Scotland.",
    "Mindaugas, the only Christian king of Lithuania, is assassinated by his cousin Treniota.",
    "The chieftains of the eastern part of Iceland become the last to pledge fealty to the King of Norway, bringing a more complete end to the Icelandic Commonwealth and the Age of the Sturlungs.",
    "Hulagu Khan is defeated in an attempted invasion, north of the Caucasus.",
    "Based on Magdeburg Law, Żnin (Poland) is given city rights.",
    "First half of the year – Battle of Settepozzi: A Venetian fleet defeats a superior Genoese-Byzantine fleet.",
    "King James I of Aragon conquers Crevillente, Spain from the Moors during the Reconquista.",
    "Alfonso X of Castile conquers Niebla from Ibn Mahfuz, thus terminating any Muslim presence in the western part of the peninsula.[1]",
    "Genoa captures the city of Chania on Crete, from the Venetians.",
    "The Savoy Palace is constructed in London by Peter II, Count of Savoy.",
    "Balliol College, Oxford is founded by John I de Balliol.",
    "Edward, heir to the throne of England, seizes £10,000, which had been deposited to the trust of the Knights Templar in London, by foreign merchants and English magnates.[2]",
    "The Bonsignori firm gains the full market of the transfer of fiscal revenue, from the papal estates to Rome.[3]",
    "Nahmanides, chief rabbi of Catalonia, defends the Talmud in an important disputation against Pablo Christiani, before King James I of Aragon.",
    "The doctrines of theologian Joachim of Fiore are condemned as heresy by the Roman Catholic Church, at a synod in Arles."
  ],
  "births": [
    "January 22 – Ibn Taymiyyah, Syrian philosopher and jurist (d. 1328)",
    "Theobald II, Duke of Lorraine (d. 1312)",
    "Yolande of Dreux, Queen of Scotland (d. 1322)"
  ],
  "deaths": [
    "January 16 – Shinran Shonin, Japanese founder of the Jodo Shinshu branch of Pure Land Buddhism (b. 1173)",
    "March – Manuel I Megas Komnenos, Emperor of Trebizond",
    "March 19 – Hugh of Saint-Cher, French cardinal",
    "November 8 – Matilda of Béthune, French countess",
    "November 14 – Alexander Nevsky, Grand Prince of Novgorod and Vladimir",
    "December 16 – King Haakon IV of Norway (b. 1204)",
    "December 24 – Hōjō Tokiyori, regent of Japan (b. 1227)",
    "date unknown\nBoniface, Count of Savoy\nBoroldai, general of the Golden Horde\nChandrabhanu, Thai king of Tambralinga\nHamo de Crevecoeur, Lord Warden of the Cinque Ports\nKing Mindaugas of Lithuania",
    "Boniface, Count of Savoy",
    "Boroldai, general of the Golden Horde",
    "Chandrabhanu, Thai king of Tambralinga",
    "Hamo de Crevecoeur, Lord Warden of the Cinque Ports",
    "King Mindaugas of Lithuania"
  ]
}