{
  "events": [
    "February 18 – Battle of Rakvere: The Livonian Order is defeated by Dovmont of Pskov.[1]",
    "April 4 – A five-year Byzantine–Venetian peace treaty is concluded between Venetian envoys and Emperor Michael VIII Palaiologos. It is ratified by the Doge of Venice Reniero Zeno on 30 June.[2]",
    "August 23 – Battle of Tagliacozzo: The army of Charles of Anjou defeats the Ghibellines supporters of Conradin of Hohenstaufen, marking the fall of the Hohenstaufen Family from the Imperial and Sicilian thrones, and leading to the new chapter of Angevin domination in Southern Italy.[3]",
    "October 29 – Conradin, the last legitimate male heir of the Hohenstaufen Dynasty of Kings of Germany and Holy Roman Emperors, is executed, along with his companion Frederick I, Margrave of Baden, by Charles I of Sicily, a political rival and ally to the hostile Roman Catholic Church.[4]",
    "King Stephen V of Hungary launches a war against Bulgaria.[5][6]",
    "The County of Wernigerode becomes a vassal state of the Margrave of Brandenburg.[7]",
    "New election procedures for the election of the doge are established in Venice, in order to reduce the influence of powerful individual families and possibly to prevent the popular Lorenzo Tiepolo from becoming elected.[8]",
    "Pope Clement IV dies; the following papal election fails to choose a new pope for almost three years, precipitating the later creation of stringent rules governing the electoral procedures.[9]",
    "Nicola Pisano completes the famous octagonal Gothic-style pulpit, at the Duomo di Siena.[10]",
    "The carnival in Venice is first recorded.[11]",
    "In France, the use of hops as the exclusive flavoring agent used in the manufacture of beer is made compulsory.[12]",
    "The town of Guta is founded (currently Kolárovo, Slovakia).[13][better source needed]",
    "May 18 – Battle of Antioch: The Principality of Antioch, a crusader state, falls to the Mamluk Sultan Baibars; his destruction of the city of Antioch is so great, as to permanently negate the city's importance.[14]",
    "The Battle of Xiangyang, a 6-year battle between the Chinese Song dynasty and the Mongol forces of Kublai Khan, begins in what is today Hubei.[15]",
    "Kublai Khan sends an emissary to the Kamakura shogunate of Japan, demanding an acknowledgment of suzerainty and payment of tribute; the Japanese refuse, starting a diplomatic back-and-forth, lasting until the Mongols attempt to invade in 1274.[16]",
    "An earthquake in Cilicia kills an estimated 60,000 people.[17]",
    "The Tibetan monk Drogön Chögyal Phagpa of the Sakya School completes the 'Phags-pa script, which was sponsored by Kublai Khan as a new writing system in his empire.[18]",
    "1268 Cilicia earthquake. It occurred northeast of the city of Adana in 1268. Over 60,000 people perished in the Armenian Kingdom of Cilicia in southern Asia Minor.[19][20]"
  ],
  "births": [
    "April/June – Philip IV of France (d. 1314)[21]",
    "Saint Clare of Montefalco (d. 1308)[22]",
    "Emperor Duanzong of China (d. 1278)[23]",
    "Mahaut, Countess of Artois (d. 1327)[24]",
    "Vedanta Desika, Indian Hindu poet and philosopher[25]"
  ],
  "deaths": [
    "May 15 – Peter II, Count of Savoy (b. 1203)[26]",
    "July 7 – Reniero Zeno, Doge of Venice[27]",
    "August 11 – Agnes of Faucigny, Dame ruler of Faucigny, countess consort of Savoy[28]",
    "October 29\nConradin, Duke of Swabia (executed) (b. 1252)[29]\nFrederick I, Margrave of Baden (executed) (b. 1249)[30]",
    "Conradin, Duke of Swabia (executed) (b. 1252)[29]",
    "Frederick I, Margrave of Baden (executed) (b. 1249)[30]",
    "November 29 – Pope Clement IV[9]",
    "December 9 – Vaišvilkas, Prince of Black Ruthenia[31]",
    "date unknown\nBarral of Baux, Grand Justiciar of Sicily[32]\nGeorge (son of David VII of Georgia), Crown Prince of Georgia (b. 1250)[citation needed]\nHenry de Bracton, English jurist[33]",
    "Barral of Baux, Grand Justiciar of Sicily[32]",
    "George (son of David VII of Georgia), Crown Prince of Georgia (b. 1250)[citation needed]",
    "Henry de Bracton, English jurist[33]"
  ]
}