{
  "events": [
    "End of the Almohad Dynasty:\nThe Berber Marinid completes the conquest of Morocco, replacing the Almohad dynasty which it defeated in Marrakesh.\nThe Almohad Dynasty of caliphs (not universally accepted), that once ruled most of North Africa and Al-Andalus (Moorish Spain), is extinguished when Idris II is murdered in the dynasty's last remaining possession, Marrakesh.",
    "The Berber Marinid completes the conquest of Morocco, replacing the Almohad dynasty which it defeated in Marrakesh.",
    "The Almohad Dynasty of caliphs (not universally accepted), that once ruled most of North Africa and Al-Andalus (Moorish Spain), is extinguished when Idris II is murdered in the dynasty's last remaining possession, Marrakesh.",
    "June 19 – King Louis IX of France orders all Jews found in public, without an identifying yellow badge, to be fined ten livres of silver.",
    "King Otakar II of Bohemia inherits Carinthia and part of Carniola, making him the most powerful prince within the Holy Roman Empire; the empire lacking an emperor during the ongoing “Great Interregnum”.",
    "To finance his crusade, Edward I of England obtains the right to levy a twentieth of the value of the Church’s wealth in England. That sum turns out to be insufficient, and Edward has to borrow to reach his target.[1]",
    "John Comyn begins the construction of Blair Castle, in Scotland.",
    "March – Ode de Pougy, Abbess of Notre Dame aux Nonnains, is excommunicated.",
    "The Latin Patriarch of Antioch is exiled after 171 years of holding the See, being displaced because of the East–West Schism of 1054. It, once again, reverts from possession of the Roman Catholic to the Eastern Orthodox Church.",
    "Pélerin de Maricourt first describes magnetic poles, and remarks on the nonexistence of isolated magnetic poles."
  ],
  "births": [
    "June 18 – Eleanor of England, Countess of Bar (d. 1298)",
    "date unknown\nPhilip of Artois, Lord of Conches, Nonancourt, and Domfront\nHuang Gongwang, Chinese painter (d. 1354)",
    "Philip of Artois, Lord of Conches, Nonancourt, and Domfront",
    "Huang Gongwang, Chinese painter (d. 1354)"
  ],
  "deaths": [
    "September – Idris II, Almohad Caliph",
    "October 27 – Ulrich III, Duke of Carinthia (b. c.1220)",
    "date unknown\nGuigues VII of Viennois, dauphin of Vienne (b. 1225)\nConstance of Aragon, Lady of Villena, Aragonese princess (b. 1239)\nOberto Pallavicino, Italian nobleman and military commander (b. 1197)\nVilain I of Aulnay, Marshal of Romania and Baron of Arcadia",
    "Guigues VII of Viennois, dauphin of Vienne (b. 1225)",
    "Constance of Aragon, Lady of Villena, Aragonese princess (b. 1239)",
    "Oberto Pallavicino, Italian nobleman and military commander (b. 1197)",
    "Vilain I of Aulnay, Marshal of Romania and Baron of Arcadia"
  ]
}