{
  "events": [
    "Before August – King Louis IX of France launches the Eighth Crusade, in an attempt to recapture the Crusader States from the Mamluk sultan Baibars; the opening engagement is a siege of Tunis.[1]",
    "August 25 – King Louis IX of France dies while besieging the city of Tunis, possibly due to poor quality drinking water.[2]",
    "October 30 – The siege of Tunis and the Eighth Crusade end, through an agreement between Charles I of Sicily (Louis IX's brother) and Muhammad I al-Mustansir, Khalif of Tunis.[3]",
    "August 10 (10 Nehasé 1262) – Yekuno Amlak overthrows the Ethiopian Zagwe Dynasty, claims the imperial throne and establishes the Solomonic Dynasty, which will last until 1974.[4]",
    "In Korea, the Sambyeolcho Rebellion begins against the Goryeo Dynasty, a puppet government of the Mongol Empire.[5]",
    "The ancient city of Ashkelon is captured from the Crusader States, and utterly destroyed by the Mamluk sultan Baibars, who goes so far as to fill in its important harbor, leaving the site desolate, and the city never to be rebuilt.[6]",
    "The city of Tabriz, in present-day Iran, is made capital of the Mongol Ilkhanate Empire (approximate date).[7]",
    "The independent state of Kutch is founded, in present-day India.[8]",
    "A census of the Chinese city of Hangzhou establishes that some 186,330 families reside within it, not including visitors and soldiers (Historian Jacques Gernet argues that this means a population of over 1 million inhabitants, making Hangzhou the most populous city in the world).[9]",
    "December 15 – The Nizari Ismaili garrison of Gerdkuh, Persia surrender after 17 years to the Mongols.[10]",
    "February 16 – Livonian Crusade - Battle of Karuse: The Grand Duchy of Lithuania defeats the Livonian Order decisively, on the frozen surface of the Baltic Sea.[11]",
    "September 1 – King Stephen V of Hungary writes his walk to the antiquum castellum near Miholjanec, where the Sword of Attila has been recently discovered.[citation needed]",
    "December – Crucial aspects of the philosophy of Averroism (itself based on Aristotle's works) are banned by the Roman Catholic Church, in a condemnation enacted by papal authority at the University of Paris.[12]",
    "The Summa Theologica, a work by Thomas Aquinas that is considered within the Roman Catholic Church to be the paramount expression of its theology, is completed (year uncertain).[13]",
    "Witelo translates Alhazen's 200-year-old treatise on optics, Kitab al-Manazir, from Arabic into Latin, bringing the work to European academic circles for the first time.[14]",
    "The Sanskrit fables known as the Panchatantra, dating from as early as 200 BCE, are translated into Latin, from a Hebrew version by John of Capua.[15]",
    "Construction of the Old New Synagogue in Prague is completed.[16]",
    "The cathedral on the Rock of Cashel in Ireland is completed.[17]",
    "Edmund, Earl of Cornwall, donates to the Cistercian Hailes Abbey in England (his father's foundation) a phial held to contain the Blood of Christ, acquired in the Holy Roman Empire; this becomes such a magnet for pilgrimage that within 7 years the monks are able to rebuild their abbey on a magnificent scale.[18]",
    "The Chronicle of Melrose is ended.[19]"
  ],
  "births": [
    "March 12 – Charles, Count of Valois, son of Philip III of France (d. 1325)[20]",
    "Theodore Metochites, Byzantine statesman and author[21]",
    "Michael of Cesena, Franciscan theologian (d. 1342)[22]",
    "Cino da Pistoia, Italian poet (d. 1336)[23]",
    "Isabella of Burgundy, Queen of Germany (d. 1323)[24]",
    "Ma Zhiyuan, Chinese poet[25]",
    "Namdev, Marathi saint and poet (d. 1350)[26]",
    "approximate – William Wallace, Scottish patriot[27]"
  ],
  "deaths": [
    "January 18 – Saint Margaret of Hungary (b. 1242)[28]",
    "February 23 – Saint Isabelle of France, French princess and saint (b. 1225)[29]",
    "March 17 – Philip of Montfort, Lord of Tyre[30]",
    "May 3 – Béla IV of Hungary (b. 1206)[31]",
    "July 9 – Stephen Báncsa, Hungarian cardinal (b. c. 1205)[32]",
    "July 18 – Boniface of Savoy, Archbishop of Canterbury[33]",
    "August 25\nKing Louis IX of France (b. 1214)[34]\nAlphonso of Brienne (b. c. 1225)[35]",
    "King Louis IX of France (b. 1214)[34]",
    "Alphonso of Brienne (b. c. 1225)[35]",
    "September 24 – Philip of Montfort, Lord of Castres[36]",
    "December 4 – Theobald II of Navarre (Theobald V of Champagne) (b. c. 1238)[37]",
    "David VII Ulu, King of Georgia (b. 1215)[38]",
    "Ibn Abi Usaibia, Syrian Arab medical historian (b. 1203)[39]",
    "Isaac ben Moses of Vienna, Jewish rabbi and scholar (b. 1200)[40]",
    "Roger Bigod, 4th Earl of Norfolk (b. 1212)[41]",
    "Uli I of Mali, second mansa of the Mali Empire[42]"
  ]
}