{
  "events": [
    "January 22 – Muhammad II becomes Sultan of the Emirate of Granada after the death of his father, Muhammad I, in a riding accident.",
    "September 29 – Rudolph I of Germany is elected King of Germany over rival candidate King Otakar II of Bohemia, ending the Interregnum; Otakar refuses to acknowledge Rudolph as the new king, leading to the outbreak of war in 1276. Rudolph is the first of many Habsburgs to hold the throne.",
    "October 6 – Thomas Aquinas writes Summa Theologica, a master work of Catholic theology, leaving it unfinished after having a mystical experience during Mass.",
    "The Constantinople suburb of Galata is given to the Republic of Genoa, by the Byzantine Emperor Michael VIII Palaiologos, in return for Genoa's support of the Empire after the Fourth Crusade, and the sacking of Constantinople.",
    "King Otakar II of Bohemia captures Bratislava from Hungary.",
    "The Congregatio Regni Tocius Sclavonie Generalis, with its decisions (statuta et constitutiones), is the oldest surviving document written by the Croatian parliament.",
    "Alfonso X of Castile creates and grants privileges to the Mesta to promote the woollen industry.",
    "July – The Sultan Baybars captures the last remaining stronghold of the Hashashin sect, al-Kahf Castle.[1]",
    "December – Followers of the recently deceased Jalal al-Din Muhammad Rumi establish the Sufi order of the Whirling Dervishes in the city of Konya (in modern-day Turkey).",
    "The Holy Redeemer khachkar, believed to be one of the finest examples of the art form, is carved in Haghpat, Armenia, by Vahram.",
    "January 31 – The six-year-long battle of Xiangyang ends as the commander of the Song Dynasty's forces surrender to Kublai Khan's Yuan Dynasty. The battle is the first in which firearms are used in combat.",
    "In Korea, the Sambyeolcho Rebellion against the Goryeo dynasty (a puppet government of the Yuan dynasty) ends as rebel forces are defeated by combined Yuan and Goryeo forces."
  ],
  "births": [
    "January 14 – Joan I of Navarre, queen regnant of Navarre, queen consort of France (d. 1305)[2]",
    "July 15 – Ewostatewos, Ethiopian monk and religious leader (d. 1352)",
    "November 24 – Alphonso, Earl of Chester, son of Edward I of England (d. 1284)",
    "November – Abu al-Fida, Syrian Arab historian (d. 1331)",
    "date unknown –  David VIII of Georgia (d. 1311)",
    "Henry VII, Holy Roman Emperor (approximate date; d. 1313)"
  ],
  "deaths": [
    "July 8 – Anno von Sangershausen, Master of the Livonian Order and Grand Master of the Teutonic Order from 1256 to 1273",
    "October – Baldwin II of Constantinople, last Latin Emperor of Constantinople (b. 1217)",
    "October 9 – Elisabeth of Bavaria, Queen of Germany (b. 1227)",
    "December 17 – Jalal al-Din Muhammad Rumi, Persian poet and Sufi mystic (b. 1207)"
  ]
}