{
  "events": [
    "The Marinid amir, Abu Yusuf Yaqub, enters peacefully into Ceuta, putting an end to some 40 years of the city's independence.[1]",
    "October 5 – November 20: Kublai Khan's Yuan dynasty attempts the first of two Mongol invasions of Japan (30,000 soldiers and support personnel sail from Korea); after the Mongols capture the islands of Tsushima and Iki, they are repulsed on the main island of Kyushu at the Battle of Bun'ei by amassed Japanese warriors and a strong storm which batters their forces and fleet. Credit for the storm – called a kamikaze, or divine wind – is given by the Japanese to the god Raijin.",
    "Nichiren, founder of Nichiren Buddhism, enters exile on Mount Minobu.",
    "May 7 – The Second Council of Lyons, held by the leadership of the Roman Catholic Church convenes to consider the liberation of the Holy Land via Crusades, and address the East-West Schism with the Byzantine church. The Council eventually approves a tithe to support efforts to liberate the Holy Land from Muslims, and reaches apparent resolution of the schism, which ultimately proves unsuccessful. All but four mendicant orders of friars are suppressed. Catholic teaching on Purgatory is defined for the first time.[2]",
    "November – The Diet of Nuremberg orders that all crown estates seized since the death of Frederick II, Holy Roman Emperor be restored to Rudolph I of Germany; almost all European rulers agree, with the notable exception of King Otakar II of Bohemia, who has benefited greatly by conquering or otherwise coming into possession of many of those lands.",
    "Pope Gregory X decrees that conclaves (meetings during which the electors have no contact with the outside) should be used for papal elections, reforming the electoral process which had taken over 3 years to elect him.",
    "Joseph ben Abraham Gikatilla writes Ginnat Egoz (Garden of Nuts).",
    "August 2\nKing Edward I of England finally returns from the Ninth Crusade to England, to be crowned king, two years after his father King Henry III's death.\nHis interim chancellor and effective regent, Walter de Merton retires from royal service, to make the final revisions to his statutes for the foundation of Merton College, Oxford, and take up the post of Bishop of Rochester.\nOne of Edward's first acts is to enforce a decree, requiring all English Jews to wear yellow badges.",
    "King Edward I of England finally returns from the Ninth Crusade to England, to be crowned king, two years after his father King Henry III's death.",
    "His interim chancellor and effective regent, Walter de Merton retires from royal service, to make the final revisions to his statutes for the foundation of Merton College, Oxford, and take up the post of Bishop of Rochester.",
    "One of Edward's first acts is to enforce a decree, requiring all English Jews to wear yellow badges.",
    "The first main survey of the Hundred Rolls, an English census seen as a follow up to the Domesday Book (completed in 1086), is begun; it lasts until 1275.",
    "May 1 – In Florence, nine-year-old Dante Alighieri first sees eight-year-old Beatrice, his lifelong muse.[3]",
    "Bonvesin da la Riva writes the didactic-allegoric poemet Liber di Tre Scricciur (Negra, Rubra, Aurea), the first text in the ancient Western Lombard language (still similar to other Gallo-Italian languages), and one of the first great literary works in Italy. It tells about Hell, Christ's Passion and Paradise; this plot prefigures Dante in his Comedia."
  ],
  "births": [
    "February 9 – Saint Louis of Toulouse (d. 1297)",
    "July 11 – Robert the Bruce, King of Scotland (d. 1329)",
    "Eric VI of Denmark (d. 1319)",
    "Béatrice de Planisoles, French noble Cathar (approximate date)",
    "Adam Murimuth, English ecclesiastic and chronicler (approximate date; d. 1347)",
    "Marchetto da Padova, Italian music theorist (approximate date)",
    "Imam Dhahabi, Syrian scholar"
  ],
  "deaths": [
    "February 19 – Lal Shahbaz Qalandar, Sufi philosopher and poet (b. 1177)",
    "March 7 – Saint Thomas Aquinas, Italian Catholic theologian (b. 1225)",
    "June 26 – Nasir al-Din al-Tusi, Persian scientist and writer (b. 1201)",
    "July 15 – Bonaventure, Italian theologian and saint (b. 1221)",
    "July 22 – Henry I of Navarre, Count of Champagne and Brie and King of Navarre (born c. 1244)",
    "August 15 – Robert de Sorbon, French theologian and founder of the Sorbonne (b. 1201)",
    "September 2 – Prince Munetaka, Japanese shōgun (b. 1242)",
    "date unknown\nAedh mac Felim Ó Conchobair, King of Connacht\nDouceline of Digne, French beguin (born c. 1215)\nHenry I Kőszegi, Hungarian baron (born c. 1210)[4]",
    "Aedh mac Felim Ó Conchobair, King of Connacht",
    "Douceline of Digne, French beguin (born c. 1215)",
    "Henry I Kőszegi, Hungarian baron (born c. 1210)[4]",
    "In Fiction[edit]",
    "The video-game Ghost of Tsushima is set in the year 1274.[5]"
  ]
}