{
  "events": [
    "The troops of the Marinid Dynasty take the city of Algiers, at that time independent.[1]",
    "March – The 200,000 multiethnic troops of the Mongol-led Yuan Dynasty, headed by the Turkish commander Bayan, face a Chinese Song Dynasty army of 130,000, led by the Song Chancellor Jia Sidao. The result is a decisive victory for the Yuan Dynasty, and soon after the much-vilified Jia Sidao is stripped of rank and title, and killed by one of his own guards, as he is sent to exile in Fujian by the Song court.",
    "March 4 – Chinese astronomers observe a total eclipse of the Sun in China.",
    "The invading forces of the Yuan Dynasty capture the Song Dynasty city of Suzhou.",
    "Marco Polo purportedly visits Xanadu, Kublai Khan's summer capital of the Yuan Dynasty.",
    "The city of Kunming is made capital of the Yunnan province of the Mongol Yuan Dynasty.",
    "Nestorian monk Rabban Bar Sauma begins his pilgrimage from China towards Jerusalem.",
    "The Japanese era Bun'ei ends, and the Kenji era begins.",
    "Alamut Castle is temporarily recaptured from the Mongols by a Nizari force under a son of Rukn al-Din Khurshah and a descendant of the Khwarezmshahs.[2][3]",
    "April 22 – The first Statute of Westminster is passed by the English Parliament, establishing a series of laws in its 51 clauses, including equal treatment of rich and poor, free and fair elections, and definition of bailable and non-bailable offenses.",
    "June 14 – Battle of Hova: Valdemar, King of Sweden is defeated by his brother Magnus, after which Magnus deposes him.",
    "July 22 – Magnus is elected the new king of Sweden.",
    "September 11 – 1275 British earthquake. The earthquake struck the south of Great Britain. The epicentre is unknown, although it may have been in the Portsmouth/Chichester area on the south coast of England[4] or in Glamorgan, Wales.[5]",
    "October 8 – Battle of Ronaldsway: Scottish forces defeat the Manx of the Isle of Man in a decisive battle, firmly establishing Scottish rule of the island.",
    "October 27 – Floris V, Count of Holland, grants the city of Amsterdam freedom from taxes.",
    "Eleanor de Montfort is captured by sailors in the employ of Edward I of England, to prevent her marriage to Llywelyn ap Gruffudd, prince of Wales; she is used as a bargaining chip over the coming years, in Edward's attempts to subjugate Llywelyn and Wales.",
    "The Mongol Golden Horde raids Lithuania for the third time.",
    "Around Ciney, in present day Wallonia, the War of the Cow begins; (ending in 1278).",
    "The first main survey of the Hundred Rolls, an English census seen as a follow-up to the Domesday Book completed in 1086, is finished; it began in 1274.",
    "Jean de Meun completes the French allegorical work of fiction, Roman de la Rose, with a second section (the first section was written by Guillaume de Lorris in 1230).",
    "In Ghent, the first instance is recorded of emission of life annuities by a town in the Low Countries; this event confirms a trend of consolidation of local public debt in north-western Europe, initiated in 1218 by Reims.[6]",
    "The verge escapement, a simple type of escapement used in clocks, is invented (exact year unknown).",
    "Ramon Llull establishes a school in Majorca to teach Arabic to preachers, in an attempt to aid proselytizing to Moors.  He also discovers diethyl ether.",
    "The era of the tosafot (medieval commentators on the Talmud) ends (it began in 1100)."
  ],
  "births": [
    "John II, Duke of Brabant (d. 1312)",
    "Bartholomew de Badlesmere, 1st Baron Badlesmere (d. 1322)",
    "Dnyaneshwar, Indian Hindu Marathi saint, philosopher and poet (d. 1296)",
    "Mondino de Liuzzi, Italian physician and anatomist (d. 1326)",
    "Giovanni d'Andrea, Italian jurist",
    "Eleanor of Brittany (abbess) (d. 1342)",
    "approximate date\nAymer de Valence, 2nd Earl of Pembroke, Franco-English nobleman (d. 1324)\nWilliam of Alnwick, English Franciscan theologian (d. 1333)\nWalter V, Count of Brienne, Duke of Athens (d. 1311)\nGediminas, Duke of Lithuania (d. 1341)\nJohn de Menteith, Scottish nobleman (d. 1323)\nGiovanni Villani, Florentine writer (d. 1348)",
    "Aymer de Valence, 2nd Earl of Pembroke, Franco-English nobleman (d. 1324)",
    "William of Alnwick, English Franciscan theologian (d. 1333)",
    "Walter V, Count of Brienne, Duke of Athens (d. 1311)",
    "Gediminas, Duke of Lithuania (d. 1341)",
    "John de Menteith, Scottish nobleman (d. 1323)",
    "Giovanni Villani, Florentine writer (d. 1348)"
  ],
  "deaths": [
    "February 26 – Margaret of England, Queen consort of the Scots (b. 1240)",
    "April 13 – Eleanor of England (b. 1215)",
    "August 15 – Lorenzo Tiepolo, Doge of Venice",
    "September 24 – Humphrey de Bohun, 2nd Earl of Hereford, Constable of England (b. 1208)",
    "September – Ferdinand de la Cerda, Crown Prince of Castile",
    "date unknown\nBohemond VI of Antioch (b. 1237)\nGeoffrey of Briel, Baron of Karytaina",
    "Bohemond VI of Antioch (b. 1237)",
    "Geoffrey of Briel, Baron of Karytaina"
  ]
}