{
  "events": [
    "Mamluk sultan Baibars conquers Al-Maris, previously part of Makuria, and annexes it into Egypt.",
    "A severe 23-year drought begins to affect the Grand Canyon area, eventually forcing the agriculture-dependent Anasazi culture to migrate out of the region.",
    "February – The court of the Southern Song Dynasty of China and hundreds of thousands of its citizens flee from Hangzhou to Fujian, and then Guangdong, in an effort to escape an invasion by Kublai Khan's Yuan Dynasty.",
    "June 14 – Remnants of the Song Chinese court in Fuzhou province conduct the coronation ceremony for the Prince Zhao Shi to become Emperor Duanzong of Song.",
    "Alamut Castle is again captured by the Mongols from a Nizari force, under a son of Rukn al-Din Khurshah and a descendant of the Khwarezmshahs.[1][2]",
    "March 9 – Augsburg becomes an Imperial Free City.  Ravensburg also does in the same year.",
    "June – King Rudolph I of Germany declares war on King Otakar II of Bohemia, a political rival; by November, Otakar II is forced to cede four important territories, as demanded by the Diet of Nuremberg in 1274.",
    "Stefan Dragutin of Serbia becomes King of Serbia.",
    "A Mudejar rebellion erupts in Valencia (it is put down in 1278).[3]",
    "Merton College, Oxford, is first recorded as having a collection of books, making its Library the world's oldest in continuous daily use.[4]",
    "Henry of Ghent becomes the last major theologian to openly consider annuities as usurious contract. The end of the debate allows for the expansion of the budding practice of renten emission, to become a staple of public finance in north-western Europe.[5]",
    "January 21 – Pope Innocent V succeeds Pope Gregory X, as the 185th pope.",
    "July 11 – Pope Adrian V (also referred to as Hadrian) succeeds Pope Innocent V, as the 186th pope.",
    "September 13 – Pope John XXI succeeds Pope Adrian V as the 187th pope, becoming the fourth man this calendar year to hold the office of pope.",
    "The foundation stone of the Minoritenkirche in Vienna is laid, by King Otakar II of Bohemia."
  ],
  "births": [
    "May 3 –Louis, Count of Évreux, son of King Philip III of France (d. 1319)",
    "September 29 –Christopher II of Denmark (d. 1332)",
    "October 19 – Prince Hisaaki, Japanese shōgun (d. 1328)",
    "Humphrey de Bohun, 4th Earl of Hereford (d. 1322)",
    "Matilda of Brunswick-Lüneburg, German ruler (d. 1318)",
    "Robert, King of Naples (d. 1343)",
    "Vakhtang III of Georgia (d. 1308)"
  ],
  "deaths": [
    "January 10 – Pope Gregory X",
    "June 22 – Pope Innocent V",
    "July 27 – King James I of Aragon (b. 1208)",
    "August 18 – Pope Adrian V",
    "November 30 – Kanezawa Sanetoki, Japanese member of the Hōjō clan (b. 1224)",
    "Guido Guinizelli, Italian poet",
    "Countess Ruler Mathilde of Saarbrücken (b. 1224)",
    "Vasily of Kostroma, Grand Duke of Vladimir (b. 1241)",
    "Ahmad al-Badawi, Moroccan Badawiyyah Sufi founder (b. 1199)"
  ]
}