{
  "events": [
    "March 7 – Condemnation of 1270: 219 philosophical and theological doctrines such as Averroism are prohibited from discussion in the University of Paris, under a decree promulgated by Étienne Tempier, Bishop of Paris.",
    "March 18 – Charles of Anjou buys the title to the Kingdom of Jerusalem from Mary of Antioch, for 1,000 bezants and an annual payment of 4,000 livres tournois.[1]",
    "March 19 – The Byzantine–Venetian treaty of 1277 is concluded, stipulating a two-year truce and renewing Venetian commercial privileges in the Byzantine Empire.[2]",
    "April 15 – Battle of Elbistan: Mamluk sultan Baibars invades the Seljuk Sultanate of Rûm, and defeats a Mongol army.",
    "November 25 – Pope Nicholas III succeeds Pope John XXI, as the 188th pope.",
    "Battle of Ngasaunggyan: Burma's Pagan Empire begins to disintegrate, after being defeated by Kublai Khan at Yunnan, near the Chinese border.",
    "Some 50,000 leaders and citizens of the Southern Song Dynasty of China become the first recorded inhabitants of Macau, as they seek refuge from the invading armies of the Yuan Dynasty. They also stay for a short period in Kowloon. Some hundred years later, the place where they stayed becomes Sung Wong Toi.",
    "The Treaty of Aberconwy is signed by Llywelyn ap Gruffudd, Prince of Wales, and King Edward I of England, ending the First Welsh War, in exchange for restrictions on Llywelyn's power.",
    "St George's Cross is first recorded in use, as the national flag of England.[3]",
    "In Japan, a 20 kilometer stone wall defending the coast of Hakata Bay in Fukuoka is completed; it is built in response to the attempted invasion by the Yuan Dynasty in 1274.",
    "In England, Roger Bacon, a Franciscan friar and University of Oxford lecturer, is arrested for spreading anti-Church views; specifically, the Church's stance on Greek philosopher Galen.[4]"
  ],
  "births": [
    "Sempad of Armenia,  king of the Armenian Kingdom of Cilicia (d. c. 1310)",
    "Isabella of Mar, Scottish countess, first wife of Robert Bruce (approximate date; d. 1296)",
    "Martha of Denmark, queen consort of Sweden (d. 1341)"
  ],
  "deaths": [
    "January–March – Philip of Sicily, titular King of Thessalonica",
    "April – Joachim Gutkeled[5]",
    "May 1 – Stefan Uroš I of Serbia",
    "May 20 – Pope John XXI (b. 1215)",
    "July 1 – Baibars, Mameluk sultan of Egypt (b. 1223)",
    "August 2 –  Mu'in al-Din Sulaiman Pervane, Chancellor and Regent of the Sultanate of Rum",
    "October 17 – Beatrice of Falkenburg, German queen consort (b. c. 1254)",
    "October 27 – Walter de Merton, Lord Chancellor of England and founder of Merton College, Oxford",
    "date unknown\nFolke Johansson Ängel, Archbishop of Uppsala since 1274\nLicoricia of Winchester, English businesswoman\nJacopo da Leona, Italian poet, at Volterra",
    "Folke Johansson Ängel, Archbishop of Uppsala since 1274",
    "Licoricia of Winchester, English businesswoman",
    "Jacopo da Leona, Italian poet, at Volterra"
  ]
}