{
  "events": [
    "February – The Japanese era Kenji ends, and the Kōan era begins.",
    "May 8 – Emperor Duanzong of Song China dies of illness, and is succeeded by his brother Zhao Bing, who becomes Emperor Huaizong of Song. Meanwhile, armed forces under the control of Mongol leader Kublai Khan draw closer to the remnants of the Song imperial court. A year later, at the Battle of Yamen, the Song Dynasty will cease to exist, becoming incorporated into the Yuan Dynasty of China.",
    "November 8 – Trần Thánh Tông, the second emperor of Vietnam's Trần dynasty, takes up the post of Retired Emperor, but continues for eleven years to co-rule with his son Trần Khâm.",
    "January – Charles of Anjou is crowned King of Jerusalem, and is acknowledged by the kingdom's barons at Acre.[1]",
    "May 1 – William II of Villehardouin, Prince of Achaea, dies. By the terms of the Treaty of Viterbo, his lands pass under the direct control of Charles of Anjou.[1]",
    "August 5 – King Alfonso X of Castile begins the Siege of Algeciras (at this time under the control of Morocco), the first of many the city will suffer during the Spanish Reconquista. He will be forced to abandon it about a year later.",
    "August 26 – Battle on the Marchfeld at Dürnkrut and Jedenspeigen: Kings Rudolf I of Germany and Ladislaus IV of Hungary defeat King Ottokar II of Bohemia, in a match of over 80,000 men and the largest battle of knights in the Middle Ages. The battle ends a power struggle between Rudolph and Otakar over the fate of central Europe, and Rudolf's House of Habsburg will continue to rule Austria and other captured territories, until the end of World War I in 1918.",
    "September 8 – The independence, boundaries, and political structure of Andorra are agreed to by the Catalan Bishop of Urgell and the Count of Foix.",
    "September 29 – Peter III of Aragon takes the Muslim stronghold of Montesa, putting an end to two years of Mudéjar rebellion. The defeated Muslims are expelled from the realm, and go into exile.[2]",
    "The so-called War of the Cow, which had begun in 1275 in what will become Wallonia, ends.",
    "The earliest known written copy of the Avesta, a collection of ancient sacred Persian Zoroastrian texts previously passed down orally, is produced.",
    "Giles of Lessines writes his De usuris. He estimates that some credit contracts need not to be usurious, as \"future things are not estimated to be of such value as those collected in the instant\". The prevalence of this view in the usury debate allows for the development of the financial industry in Roman Catholic Europe.[3]",
    "An edict by Pope Nicholas III requires all Jews to attend conversion sermons."
  ],
  "births": [
    "March 11 – Mary of Woodstock, daughter of Edward I of England",
    "November 10 – Philip I, Prince of Taranto (d. 1331)",
    "Constantine I (III), King of Armenia (d. c. 1310)",
    "Rita of Armenia, Byzantine empress consort (d. 1333)",
    "Ferdinand of Majorca (d. 1316)",
    "Thomas, 2nd Earl of Lancaster (d. 1322)"
  ],
  "deaths": [
    "Lý Chiêu Hoàng, former Vietnamese empress and empress consort (b. 1218)",
    "May 1 – William II of Villehardouin",
    "May 8 – Emperor Duanzong of Song China (b. 1268)",
    "June 30 – Pierre de la Broce, French courtier",
    "August 26 – King Ottokar II of Bohemia"
  ]
}