{
  "events": [
    "June 23 – Reconquista – Battle of Moclín: Troops of the Emirate of Granada defeat those of the Kingdom of Castile, and Kingdom of León.[1]",
    "September 27 – King Magnus III of Sweden founds a Swedish nobility, by enacting a law accepting a contribution of a cavalry-member in lieu of ordinary tax payments.[2]",
    "Construction on the northern section of the Grand Canal of China is begun.[3]",
    "The final expansion of Lincoln Cathedral in England is completed.[4]",
    "Tsar Ivan Asen III of Bulgaria flees from Tarnovo, ending the Asen Dynasty in Bulgaria.[5]",
    "Syria attempts to secede from the Mamluk Sultanate of Egypt, but Al Mansur Qalawun defeats the rebels, and keeps Syria within the Egyptian sultanate.[6]",
    "The second of two main surveys of the Hundred Rolls, an English census seen as a follow up to the Domesday Book completed in 1086, is completed; it began in 1279.",
    "Turin is conquered by Thomas III of Savoy, becoming the capital of the House of Savoy.[7]",
    "Approximate date\nThe Ancestors of the Māori people from eastern Polynesia become the first human settlers of New Zealand.[8]\nThe Wolf minimum of solar activity begins.[9]",
    "The Ancestors of the Māori people from eastern Polynesia become the first human settlers of New Zealand.[8]",
    "The Wolf minimum of solar activity begins.[9]"
  ],
  "births": [
    "Birger, King of Sweden, Swedish monarch (d. 1321)[10]",
    "Wu Zhen, Chinese painter (d. 1354)[11]",
    "Approximate date\nAnna of Kashin, Russian saint (d. 1368)[12]\nMusa I of Mali, West African emperor (d. c.1337)",
    "Anna of Kashin, Russian saint (d. 1368)[12]",
    "Musa I of Mali, West African emperor (d. c.1337)"
  ],
  "deaths": [
    "February 10 – Margaret II, Countess of Flanders (b. 1202)[13]",
    "May 9 – Magnus VI of Norway[14]",
    "August 22 – Pope Nicholas III (b. 1218)[15]",
    "November 15 – Albertus Magnus, German theologian[16]",
    "January 1 – Ertuğrul father of Osman I[17]"
  ]
}