{
  "events": [
    "March – Dafydd ap Gruffydd, brother of Prince of Wales Llywelyn ap Gruffudd, attacks an English castle; his brother feels compelled to support him, despite being unprepared for war.  Their actions lead to the final English conquest of Wales, by King Edward I of England.",
    "March 30 – The Sicilian rebellion, known as the Sicilian Vespers, begins against the rule of Angevin King Charles I of Sicily; over the next six weeks, thousands of French are killed.  The rebellion forces Charles to abandon the Ninth Crusade, while still en route to the target city of Constantinople, and allows King Peter III of Aragon to take over rule of the island from Charles (which in turn leads to Peter's excommunication by Pope Martin IV).",
    "May 15 – Battle of Forlì between Guelphs and Ghibellines: the French army under Jean d'Eppe is defeated, by Guido I da Montefeltro.",
    "June – The army of Peter III of Aragon lands in North Africa in Collo, to support the rebellious governor of Constantine, Ibn Wazir. But the uprising has been put down by the Hafsid ruler. Peter, wary of the situation in Sicily, quickly sails off and fails to take advantage of the state of rebellion in North Africa.[1]",
    "June 26 – King Denis of Portugal marries Elizabeth of Aragon in Trancoso.",
    "August 30 – Peter III of Aragon, originally traveling with his fleet on a military expedition against Tunis, ends up in the Sicilian town of Trapani, after he was asked by the inhabitants of Palermo to help in the fight against Charles of Anjou.",
    "September 4 – Peter III of Aragon becomes King of Sicily.",
    "September or October – Battle of Lake Hód between the Kingdom of Hungary and the Cumans: King Ladislaus IV of Hungary defeats the invading army.[2]",
    "December 11 – Battle of Orewin Bridge in mid-Wales: Llywelyn ap Gruffudd is killed, and the Welsh suffer their final decisive defeat at the hands of the English.",
    "December – Holy Roman Emperor Rudolf I of Germany invests his sons Albert I of Germany and Rudolf II of Austria as co-rulers of the duchies of Austria and Styria, thus founding the Habsburg Dynasty in those territories.",
    "Battle of Vronen: Floris V, Count of Holland defeats the Frisians and retrieves the body of his father, some 26 years dead.",
    "King Stefan Dragutin of Serbia breaks his leg while hunting and becomes ill; he gives the throne to his younger brother Stefan Milutin.",
    "The king of Aragon, Peter III, obtains the support of Nasrid Granada in preparation for the incoming Aragonese Crusade, led by Philip the Fair of France.[3]",
    "Hertford College is founded, at the University of Oxford.",
    "The form for the Trial of the Pyx, during which it is confirmed that newly minted coins conform to required standards, is established.",
    "The first evidence is discovered of the existence of consolidated public debt in Bruges, confirming the expansion of use of annuities, to fund government expenditure to the Low Countries.[4]",
    "The most recent eruption of Larderello, a volcano in southern Tuscany, is observed.",
    "The technology of watermarks is introduced by paper manufacturers of Bologna, Italy.",
    "In England, the Archbishop of Canterbury orders all the synagogues of London to close, and forbids Jewish doctors from practicing on non-Jews.",
    "Construction of Albi Cathedral in Languedoc begins."
  ],
  "births": [
    "February 2 – Maud Chaworth, Countess of Leicester",
    "April 1 – Louis IV, Holy Roman Emperor (d. 1347)",
    "April 15 – Frederick IV, Duke of Lorraine (d. 1329)",
    "May 5 – Juan Manuel, Prince of Villena (d. 1348)",
    "date unknown\nOshin, King of Armenia (d. 1320)\nPope Innocent VI (d. 1362)\nÖz Beg Khan, Mongol leader of the Golden Horde (d. 1341)",
    "Oshin, King of Armenia (d. 1320)",
    "Pope Innocent VI (d. 1362)",
    "Öz Beg Khan, Mongol leader of the Golden Horde (d. 1341)"
  ],
  "deaths": [
    "January 9 – Abû 'Uthmân Sa'îd ibn Hakam al Qurashi, Ra'îs of Manûrqa",
    "April 1 –Abaqa Khan, khan of the Mongol Ilkhanate",
    "April 10 – Ahmad Fanakati, Chief minister under Kublai Khan",
    "June 19 – Eleanor de Montfort, Welsh princess, wife of Llywelyn ap Gruffudd (b. 1252; childbirth)",
    "August 25 – Thomas de Cantilupe, English saint",
    "September 9 – Saint Ingrid of Skänninge, Swedish saint",
    "October 13 – Nichiren, Japanese founder of Nichiren Buddhism",
    "October 30 – Roger Mortimer, 1st Baron Mortimer",
    "December – Margaret Sambiria, Danish regent",
    "December 11\nLlywelyn ap Gruffudd, Prince of Wales\nMichael VIII Palaiologos, Byzantine emperor[5]",
    "Llywelyn ap Gruffudd, Prince of Wales",
    "Michael VIII Palaiologos, Byzantine emperor[5]",
    "date unknown – George Akropolites, Byzantine historian and statesman"
  ]
}