{
  "events": [
    "Year without winter – Exceptionally rare instance of uninterrupted transition, from autumn 1289 to the following spring, in Great Britain and mainland western Europe.[1]",
    "March 1 – The University of Coimbra is founded in Lisbon, Portugal by King Denis of Portugal; it moves to Coimbra in 1308.",
    "July 10 – Ladislaus IV of Hungary is assassinated by three Cumans (Árbóc, Törtel and Kemence), at the castle of Körösszeg (modern-day Cheresig) in Romania.",
    "July 18 – Edict of Expulsion: King Edward I of England orders all Jews (at this time probably numbering around 2,000) to leave England by November 1 (All Saints' Day);[2] on the Hebrew calendar this is Tisha B'Av, a day that commemorates many calamities.",
    "July 23 – Andrew III of Hungary is crowned in Székesfehérvár[3][4] by Lodomer, Archbishop of Esztergom, having escaped from captivity in Vienna.",
    "August 1 – The country of Wallachia is founded (traditional date).",
    "December – The twelve Eleanor crosses are erected between Lincolnshire and London in England, as King Edward I mourns the death of his queen consort, Eleanor of Castile.",
    "December 18 – Upon the death of Magnus III, he is succeeded by his 10-year-old son Birger as king of Sweden. Although Sweden is an elective monarchy at this time, Birger has been appointed heir to the throne already in 1284.",
    "Construction of Llandaff Cathedral is completed in Cardiff, Wales, 170 years after it was begun.",
    "The Mongol Golden Horde invades the Bessarabia region of Moldavia.",
    "The second of the Statutes of Mortmain are passed under King Edward I of England, which prevents land from passing into possession of the church. The statute Quia Emptores is also passed, reforming the feudal system of land leases, and allowing the sale of fee simple estates.",
    "King Denis of Portugal decrees that Portuguese is the official language of Portugal, replacing classical Latin in that capacity.",
    "Construction on the Akershus Fortress of Oslo, Norway is begun.",
    "September 27 –  The 6.8 Ms  Chihli earthquake affects the province of Hebei, China with a maximum Mercalli intensity of IX (Violent), killing 7,270–100,000.",
    "The founding Mamluk dynasty of the Sultanate of Delhi is overthrown, by Jalal ud din Firuz Khalji of the Khalji dynasty.",
    "Dnyaneshwari was written in India. This holy book is a commentary on Bhagvad Gita. It was narrated by St. Gnyaneshwar"
  ],
  "births": [
    "August 4 – Leopold I, Duke of Austria (d. 1326)",
    "Margaret of Burgundy, Queen of France (d. 1315)",
    "Jean de Muris, French philosopher and mathematician (d. 1351)"
  ],
  "deaths": [
    "January 28 – Dervorguilla of Galloway, Scottish noble, mother of king John Balliol of Scotland (b. c. 1210)",
    "May 10 – Rudolf II, Duke of Austria 1282–1283 (b. 1270)",
    "June 8 – Beatrice Portinari, Italian object of Dante Alighieri's adoration (b. 1266)",
    "June 23 – Henryk IV Probus, duke of Wrocław since 1266, and high duke of Kraków since 1268 (b. c. 1258)",
    "July 10 – Ladislaus IV, king of Hungary since 1272 (b. 1262)",
    "September 26 – Margaret, Maid of Norway, Queen of Scotland (b. 1283)",
    "November 10 – Al-Mansur Qalawun, Sultan of Egypt since 1279 (b. c. 1222)",
    "November 28 – Eleanor of Castile, queen of Edward I of England (b. 1241)",
    "December 18 – Magnus III, king of Sweden since 1275 (b. 1240)",
    "Patriarch Gregory II of Constantinople 1283–1289 (b. 1241)"
  ]
}