{
  "events": [
    "Spring – Vandino and Ugolino Vivaldi set sail from Genoa with the goal of reaching India; they never return.",
    "May 10 – Scottish nobles recognize the authority of King Edward I of England in mediating the resolution of the succession crisis created by the death of King Alexander III of Scotland five years earlier.",
    "c. August 1 – Federal Charter of 1291 by which the \"three forest cantons\" (Waldstätte) of Switzerland (Schwyz, Uri and Unterwalden) form an eternal alliance intended to protect themselves from the newly-powerful House of Habsburg, a starting point for growth of the Old Swiss Confederacy. This year is also the traditional date of the Rütlischwur, the swearing of an oath by the three cantonal representatives at Rütli meadow.[1]",
    "Sancho IV of Castile breaks the siege of Alonso Pérez de Guzmán in Tarifa by Moors of the Marinid Sultanate.[citation needed]",
    "Pope Nicholas IV confirms the independence of San Marino by papal bull.",
    "All glassmakers in Venice are forced to move to the island of Murano, in order to contain the risk of fire, thus establishing the glass industry there.",
    "Klenová Castle is constructed in southern Bohemia as part of a frontier defense system.",
    "King Andrew III of Hungary gives royal town privileges to Bratislava, the modern-day capital of Slovakia.",
    "May 18 – The Siege of Acre ends when Al-Ashraf Khalil of Egypt captures Acre, thus exterminating the Crusader Kingdom of Jerusalem (the final Christian landholding remaining from the Crusades) and ending the Ninth Crusade and effectively all Crusades, by eliminating the possibility of further attacks on the Holy Land.",
    "The artificial Kunming Lake is constructed as a reservoir for Dadu in Yuan dynasty China by famous engineer and astronomer Guo Shoujing.",
    "Emperor Kameyama of Japan establishes the Zen Buddhist temple of Nanzenji in Kyoto.",
    "Four towns of the county of Holland (Dordrecht, Haarlem, Leiden and Alkmaar) and two of the county of Zeeland (Middelburg and Zierikzee) agree for the first time to collectively secure a loan by their sovereign, Floris V. This system gives important securities to the lenders, and allows the ruler to access the same low interest rates as the cities’ governments.[2]",
    "May – According to legend, the Santa Casa is carried by angels from Nazareth to Tersatto in Croatia en route to Loreto, Italy."
  ],
  "births": [
    "February 8 – King Afonso IV of Portugal (d. 1357)[3]",
    "October 31 – Philippe de Vitry, French composer (d. 1361)",
    "December 15 – Aymon, Count of Savoy (d. 1343)",
    "Pope Clement VI,  born Pierre Roger, French-born pontiff (d. 1352)",
    "Margareta Ebner, German nun (d. 1351)",
    "Theodore I, Marquis of Montferrat (d. 1338)"
  ],
  "deaths": [
    "March 10 – Arghun, Mongol ruler in Persia",
    "May 20 – Jalaluddin Surkh-Posh Bukhari, Bukharan Sayyid Sufi saint",
    "June 18 – King Alfonso III of Aragon (b. 1265)[4]",
    "July 15 – Rudolf I of Germany, Holy Roman Emperor, first Habsburg king (b. 1218)",
    "Hong Dagu, Korean military leader (b. 1244)",
    "Talabuga, Mongol khan of the Blue Horde from 1287, executed"
  ]
}