{
  "events": [
    "December – Mamluk sultan of Egypt Khalil is assassinated by his regent Baydara, who briefly claims the sultanate, before being assassinated himself by a rival political faction.[1]",
    "May 26 – An earthquake in Kamakura, Japan kills an estimated 23,000.[2]",
    "May 31 – The forces of Raden Wijaya win a major victory in the Mongol invasion of Java, which is considered to be the founding date of the city of Surabaya.",
    "The Japanese era Shōō ends, and the Einin era begins.[3]",
    "Khubilai sends a fleet to the islands of Southeast Asia, including Java.[4]",
    "The Hindu Majapahit Empire is founded by Kertarajasa in Java. It benefits from internal conflict and Mongol intervention, to defeat the Singhasari Kingdom and establish the empire.[5]",
    "Torkel Knutsson leads Sweden in beginning the Third Swedish Crusade against unchristianized Finnish Karelia.[6] In the same year, the construction of Vyborg Castle began by orders of Knutsson.[7]",
    "The Ordinances of Justice are enacted in the Commune of Florence.[8]",
    "The Isle of Wight is sold to King Edward I of England by Isabella de Forz, Countess of Devon, for 6,000 marks.[9]",
    "Dante Alighieri completes the book of verse La Vita Nuova.[10]",
    "May 20 – King Sancho IV of Castile creates the Studium General, forerunner to the modern Complutense University of Madrid.[11]",
    "January – Ignatius bar Wahib becomes Syriac Orthodox Patriarch of Mardin.[12]"
  ],
  "births": [
    "John of Ruysbroeck, Flemish mystic (approximate date; d. 1381)[13]",
    "Margaret de Clare, English noblewoman (d. 1342)[14]",
    "Fedlim Ó Conchobair, King of Connacht (d. 1316)[15]",
    "Philip V of France (d. 1322)[16]",
    "Philip VI of France (d. 1350)[17]",
    "Walter Stewart, 6th High Steward of Scotland (d. 1326)[18]"
  ],
  "deaths": [
    "May 2 – Meir of Rothenburg, German rabbi (b. c.1215)[19]",
    "June 29 – Henry of Ghent, philosopher (b. c.1217)[20]",
    "November 10 – Isabella de Forz, Countess of Devon (b. 1237)[21]",
    "December 14 – Al-Ashraf Khalil, Mamluk sultan of Egypt (assassinated)[22]",
    "date unknown\nDavid VI Narin, King of Georgia (b. 1225)[23]\nWilliam of Rubruck, Flemish Franciscan missionary (approximate date; b. c.1220)[24]",
    "David VI Narin, King of Georgia (b. 1225)[23]",
    "William of Rubruck, Flemish Franciscan missionary (approximate date; b. c.1220)[24]"
  ]
}