{
  "events": [
    "February 18 – Kublai Khan dies; by this time the separation of the four khanates of the Mongol Empire (the Chagatai Khanate in Central Asia, the Golden Horde in Russia, the Ilkhanate in Persia, and the Yuan Dynasty in China) has deepened.[1]",
    "July 5 – Following the Papal election, 1292–94, Pope Celestine V succeeds Nicholas IV, becoming the 192nd pope.[2]",
    "Autumn – In response to the actions of new royal administrators in north and west Wales, Madog ap Llywelyn leads a revolt against his English overlords.[3]",
    "December 24 – Pope Boniface VIII succeeds Pope Celestine V, becoming the 193rd pope, after Celestine V abdicates the papacy on December 13, only five months after reluctantly accepting his surprise election on July 5, wishing to return to his life as an ascetic hermit.[4]",
    "John Balliol, King of Scotland, decides to refuse King Edward I of England's demands for support in a planned invasion of France, the result being the negotiation of the Auld Alliance with France and Norway in the following year. These actions play a part in precipitating the Scottish Wars of Independence, which begin in 1296.[5][6]",
    "Strata Florida Abbey is rebuilt; it had been destroyed some years earlier, during King Edward I of England's conquest of Wales.[7]",
    "Architect Arnolfo di Cambio designs Florence Cathedral (Cattedrale di Santa Maria del Fiore, better known simply as Il Duomo); he also begins work on the Basilica of Santa Croce, Florence.[8][9]",
    "England and Portugal enter into the first iteration of the Anglo-Portuguese Alliance, the oldest alliance in the world still in force.[10]",
    "Edward I of England and Philip the Fair of France declare war on each other. To finance this war, both kings lay taxes on the clergy. Pope Boniface VIII insists that kings gain papal consent for taxation of the clergy, and forbids churchmen to pay taxes.[11]"
  ],
  "births": [
    "June 18 or June 19 – Charles IV of France (d. 1328)[12]",
    "John, Duke of Durazzo (d. 1336)[13]",
    "date unknown – Kusunoki Masashige, Japanese samurai (d. 1336)[14]\nJoan of Valois, Countess of Hainaut (d. 1342)[15]",
    "Joan of Valois, Countess of Hainaut (d. 1342)[15]"
  ],
  "deaths": [
    "February 18 – Kublai Khan of the Mongol Empire (b. 1215)[16]",
    "May 3 – John I, Duke of Brabant[17]",
    "June 12 – John I of Brienne, Count of Eu[18]",
    "December 25 – Mestwin II, Duke of Pomerania[19]",
    "date unknown\nEmperor Yagbe'u Seyon of Ethiopia[20]\nBrunetto Latini, Florentine philosopher (b. c. 1220)[21]\nDmitri of Pereslavl, Grand Duke of Vladimir-Suzdal[22]",
    "Emperor Yagbe'u Seyon of Ethiopia[20]",
    "Brunetto Latini, Florentine philosopher (b. c. 1220)[21]",
    "Dmitri of Pereslavl, Grand Duke of Vladimir-Suzdal[22]"
  ]
}