{
  "events": [
    "June 20 – Pope Boniface VIII proposes the Treaty of Anagni, seeking to bring peace between the house of Anjou and Sicily; the effort is in vain.",
    "June 26 – Przemysł II is crowned King of Poland in Gniezno Cathedral, the first coronation of a Polish ruler in 219 years.",
    "October 23 – The first treaty forming the Auld Alliance, between Scotland and France against England, is signed in Paris.",
    "November 13 – King Edward I of England summons the Model Parliament to Westminster, the composition of which serves as a model for later parliaments.[1]",
    "Mongol leader Ghazan Khan converts to Islam, ending a line of Tantric Buddhist leaders.",
    "Jayavarman VIII of the Khmer Empire in Cambodia abdicates; Srindravarman succeeds him.",
    "Marco Polo returns to Venice, from his travels to China.",
    "Philip IV of France and Pope Boniface VIII begin having disagreements.",
    "Construction begins on Beaumaris Castle in Anglesey, the last of the ring of castles built by Edward I of England, to subdue Wales.[2]"
  ],
  "births": [
    "September 16 – Elizabeth de Clare, English noblewoman (d. 1360)",
    "date unknown\nIsabella of France, queen of England (d. 1358)\nJohn IV, Duke of Brittany (d. 1345)\nOdo IV, Duke of Burgundy (d. 1350)\nJean Buridan, French philosopher (d. 1363)[3]",
    "Isabella of France, queen of England (d. 1358)",
    "John IV, Duke of Brittany (d. 1345)",
    "Odo IV, Duke of Burgundy (d. 1350)",
    "Jean Buridan, French philosopher (d. 1363)[3]",
    "probable\nReginald de Cobham, 1st Baron Cobham (d. 1361)\nJoanna of Flanders, military leader in the War of the Breton Succession (approximate date; d. 1374)\nNicephorus Gregoras, Byzantine historian (approximate date; d. 1360)\nSaint Roch, French saint (approximate date; d. 1327)",
    "Reginald de Cobham, 1st Baron Cobham (d. 1361)",
    "Joanna of Flanders, military leader in the War of the Breton Succession (approximate date; d. 1374)",
    "Nicephorus Gregoras, Byzantine historian (approximate date; d. 1360)",
    "Saint Roch, French saint (approximate date; d. 1327)"
  ],
  "deaths": [
    "April 25 – King Sancho IV of Castile (b. 1257)",
    "August 12 – Charles Martel of Anjou (b. 1271)",
    "October – Meinhard, Duke of Carinthia (b. 1238)",
    "December 7 – Gilbert de Clare, 7th Earl of Gloucester, 6th Earl of Hertford, English politician (b. 1243)",
    "December 20 – Margaret of Provence, queen of Louis IX of France (b. c. 1221)",
    "date unknown – Guy of Charpigny",
    "date unknown – Padishah Khatun, Mongolian poet, sovereign queen of Kirman (1291-95)"
  ]
}