{
  "events": [
    "August 28 – Emperor Go-Fushimi succeeds Emperor Fushimi on the throne of Japan.",
    "John Tarchaneiotes is appointed governor of the southern portions of Byzantine Anatolia.",
    "April 20 – Rintfleisch-Pogrom: The Jews of Röttingen are burned en masse; other Jewish communities are destroyed later in the year.",
    "June 1 – Battle of Turaida: Residents of Riga and the Grand Duchy of Lithuania defeat the Livonian Order.",
    "July 2 – Battle of Göllheim:[1] Albert I of Habsburg defeats and kills Adolf of Nassau-Weilburg.",
    "July 22 – Edward I of England defeats a Scottish army led by William Wallace in the Battle of Falkirk.[1]",
    "August 1 – The \"ideal city\" of Marciac, Gascogne, France is founded by King Philip IV of France and Guichard de Marzé.[2]",
    "September 9 – Battle of Curzola: The Genoese fleet defeats the Venetians. Marco Polo is one of the prisoners taken, and while in prison in Genoa, he begins dictating his Travels to Rustichello da Pisa.",
    "After a year's siege, the revolting commune of Palestrina near Rome surrenders, and is razed to the ground and salted by order of Pope Boniface VIII, in an act of debellatio.",
    "The foreign creditors of the Sienese Gran Tavola Bank start demanding their deposits back, thus accelerating the liquidity crisis faced by the firm.[3]",
    "Ambrose, Augustine, Jerome, and Pope Gregory I are named the first Doctors of the Church. They are known collectively as the Great Doctors of the Western Church.",
    "The Chinese governmental minister Wang Zhen invents a wooden movable type printing (Bi Sheng invented ceramic movable type in the 11th Century)."
  ],
  "births": [
    "December 12 – Albert II, Duke of Austria (d. 1358)",
    "date unknown\nCharles, Duke of Calabria, a grandson of Sicilian King Charles II of Naples (d. 1328)\nElisabeth of Carinthia, queen consort of Sicily (d. after 1347)\nAbu'l-Qasim Ibn Juzayy al-Kalbi, Andalusian Islamic scholar (d. 1340)\nSir Andrew Murray, Scottish soldier (d. 1338)",
    "Charles, Duke of Calabria, a grandson of Sicilian King Charles II of Naples (d. 1328)",
    "Elisabeth of Carinthia, queen consort of Sicily (d. after 1347)",
    "Abu'l-Qasim Ibn Juzayy al-Kalbi, Andalusian Islamic scholar (d. 1340)",
    "Sir Andrew Murray, Scottish soldier (d. 1338)"
  ],
  "deaths": [
    "January 2 – Lodomer, Hungarian archbishop",
    "April 17 – Árni Þorláksson, Icelandic bishop (b. 1237)",
    "June 11 – Yolanda of Poland, Hungarian princess (b. 1235)",
    "July 2 – King Adolf of Germany (b. c. 1255)",
    "July 13 or July 16 – Jacobus de Voragine, Italian chronicler and archbishop of Genoa",
    "July 22 – Sir John de Graham, Scottish soldier at the Battle of Falkirk",
    "July 23 – King Thoros III, King of Armenia (b. c. 1271)",
    "August 1 – Mordechai ben Hillel, German rabbi, in Rintfleisch massacres (b. c. 1250)",
    "August 28 – William Houghton, English-born Archbishop of Dublin",
    "August 29 – Eleanor of England, Countess of Bar (b. 1269)",
    "September 11 – Philip of Artois, French soldier (b. 1269)",
    "September 29 – Guido I da Montefeltro, Italian military strategist and Franciscan (b. 1223)",
    "November 19 – Mechtilde, Saxon saint (b. c. 1240)",
    "December 9 – Archibald, Scottish prelate",
    "December 31 – Humphrey de Bohun, 3rd Earl of Hereford, English soldier (b. 1249)",
    "date unknown\nAuhaduddin Kermani, Persian Sufi poet\nGerard of Lunel, French saint\nJohn of Procida, Italian physician and diplomat (b. 1210)\nRam Khamhaeng, Thai king of Sukhothai (b. c. 1237)\nSmilets of Bulgaria, Emperor (tsar)\nNino Visconti, ruler of Gallula",
    "Auhaduddin Kermani, Persian Sufi poet",
    "Gerard of Lunel, French saint",
    "John of Procida, Italian physician and diplomat (b. 1210)",
    "Ram Khamhaeng, Thai king of Sukhothai (b. c. 1237)",
    "Smilets of Bulgaria, Emperor (tsar)",
    "Nino Visconti, ruler of Gallula",
    "probable\nWilliam the Hardy, Lord of Douglas, Scottish warlord\nThomas the Rhymer, Scottish minstrel",
    "William the Hardy, Lord of Douglas, Scottish warlord",
    "Thomas the Rhymer, Scottish minstrel"
  ]
}