{
  "events": [
    "February 24 – Alauddin Khalji, sultan of Delhi, sends his generals Ulugh Khan and Nusrat Khan to conquer Gujarat.",
    "May 10 – Kyawswa of Pagan and Crown Prince Theingapati are executed at Myinsaing, by the three brothers of the Myinsaing Kingdom (nominally Kyawswa's viceroys), as traitors for submitting to the Mongol Empire.",
    "July 27 – Osman I declares his Anatolian beylik (principality) to be independent of the Seljuq Dynasty Sultanate of Rum, originating the Ottoman Empire, with Söğüt as the original capital, which will last until the 1920s.",
    "A Mongol khan launches a campaign into India with 200,000 men, but Alauddin Khalji, sultan of Delhi, defeats them.",
    "The Kingdom of Singapura is founded by Sang Nila Utama, a Srivijaya prince.",
    "April – The Scots take Stirling Castle from the English, after a siege.",
    "April 1 – Kings Towne on the River Hull (Kingston upon Hull) is granted city status, by Royal Charter of King Edward I of England.",
    "June 27 – Pope Boniface VIII issues the papal bull Scimus, fili condemning King Edward I of England invasion and occupation of Scotland.[1]",
    "July 31 – Pisa and Genoa agree to a thirty-year truce. Part of the treaty includes the end of the Pisan support to Genoa's enemies, in particular Sinucello della Rocca in Corsica.[2]",
    "November 1 – Håkon V Magnusson becomes king of Norway.",
    "December 1 – Battle of Falconaria: Frederick II of Sicily defeats Philip I of Taranto.",
    "The House of Holland becomes extinct. The County of Holland becomes part of a personal union with the County of Hainaut.",
    "Early evidence is uncovered of the king of England borrowing from the Italian merchants. Edward I obtains a loan of 2,000 pollard marks, from agents of the Frescobaldi Firm in London.[3]",
    "The city of Florence bans the use of Arabic numerals for commerce, allowing only Roman numerals."
  ],
  "births": [
    "date unknown\nAlfonso IV of Aragon (d. 1366)\nPierre Bertrand de Colombier, French cardinal and diplomat (d. 1361)\nDmitri of Tver, Grand Prince of Vladimir (d. 1326)\nMaria of Aragon, princess of Aragon (d. 1316)",
    "Alfonso IV of Aragon (d. 1366)",
    "Pierre Bertrand de Colombier, French cardinal and diplomat (d. 1361)",
    "Dmitri of Tver, Grand Prince of Vladimir (d. 1326)",
    "Maria of Aragon, princess of Aragon (d. 1316)",
    "probable\nRanulf Higdon, English chronicler (d. c. 1363)\nMalatesta II Malatesta, Italian condottiero (d. 1364)\nNicholas of Autrecourt, French philosopher and theologian (d. 1369)",
    "Ranulf Higdon, English chronicler (d. c. 1363)",
    "Malatesta II Malatesta, Italian condottiero (d. 1364)",
    "Nicholas of Autrecourt, French philosopher and theologian (d. 1369)"
  ],
  "deaths": [
    "May 10\nKyawswa of Pagan, deposed ruler of the Pagan Kingdom (born 1260)\nTheingapati, heir to the Pagan Kingdom",
    "Kyawswa of Pagan, deposed ruler of the Pagan Kingdom (born 1260)",
    "Theingapati, heir to the Pagan Kingdom",
    "May 17 – Daumantas of Pskov, Lithuanian prince (b. c. 1240)",
    "July 15 – King Eric II of Norway (b. c. 1268)",
    "August 1 – Conrad de Lichtenberg, Bishop of Strasbourg (b. 1240)",
    "November 10 – John I, Count of Holland (b. 1284)",
    "November 13 – Oliver Sutton, Bishop of Lincoln",
    "December 9 – Bohemond I, Archbishop of Trier",
    "December 31 – Margaret, Countess of Anjou (b. 1273)",
    "date unknown\nJohn Giffard, English baron (b. 1232)\nGottfried Hagen, German chronicler (b. 1230)\nNogai Khan, ruler of the Golden Horde\nZafar Khan, Indian military leader\nYakut al-Mustasim, Turkish secretary of the last Abbasid caliph",
    "John Giffard, English baron (b. 1232)",
    "Gottfried Hagen, German chronicler (b. 1230)",
    "Nogai Khan, ruler of the Golden Horde",
    "Zafar Khan, Indian military leader",
    "Yakut al-Mustasim, Turkish secretary of the last Abbasid caliph"
  ]
}