{
  "events": [
    "February 22 – The Jubilee of Pope Boniface VIII is celebrated. It is at this celebration that Giovanni Villani decides to write his universal history of Florence, the Cronica.",
    "June 15 – The city of Bilbao receives a royal foundation charter.",
    "June 17 – Turku Cathedral is consecrated.",
    "Money from Florence, Italy becomes the first international currency.",
    "Philip IV of France begins his attempt to annex Flanders.",
    "Wenceslas II of Bohemia becomes King of Poland.",
    "A census in Imperial China finds that it has roughly 60 million inhabitants.",
    "The Tuareg establish a state centered on Agadez.",
    "Amsterdam is officially declared a city.",
    "Jacob ben Machir is appointed dean of the medical school at Montpellier, France.",
    "Aztec culture starts in Mesoamerica (approximate date).",
    "The Dulcinian sect begins when Gherardo Segarelli, founder of the Apostolic Brethren, is burned at the stake in Parma, during a brutal repression of the Apostolics.",
    "Cumbric goes extinct in southern Scotland (latest approximate date)"
  ],
  "births": [
    "June 1 – Thomas of Brotherton, 1st Earl of Norfolk, son of Edward I of England (d. 1338)[1]",
    "September 27 – Adolf, Count Palatine of the Rhine (d. 1327)[2]",
    "date unknown",
    "John III, Duke of Brabant (d. 1355)[3]",
    "Khutughtu Khan, Emperor Mingzong of Yuan, emperor of the Yuan Dynasty (d. 1329)",
    "Jeanne de Clisson, French noblewoman and privateer (d. 1359)[4]",
    "Chihab Addine Abul-Abbas Ahmad ben Fadhl Al-Umari, Arab historian (d. 1384)",
    "probable",
    "Dionigi di Borgo San Sepolcro, Italian Augustinian monk (d. 1342)",
    "Geoffroi de Charny, French knight and chivalric writer (d. 1356)",
    "Richard FitzRalph, Archbishop of Armagh (d. 1360)",
    "Taddeo Gaddi, Italian painter and architect (d. 1366)",
    "Ibn Kathir, Syrian Islamic scholar (d. 1373)",
    "Laurence Minot, English poet (d. 1352)",
    "John of Winterthur, Swiss historian"
  ],
  "deaths": [
    "February 19 – Munio of Zamora, Spanish General of the Dominican Order",
    "July 18 – Gerard Segarelli, Italian founder of the Apostolic Brethren (burned at stake)",
    "September – Edmund, 2nd Earl of Cornwall (approximate date; b. 1249)",
    "December – Jean de Montfort-Castres, Count of Squillace",
    "date unknown",
    "Guido Cavalcanti, Italian poet (b. 1250)",
    "Tsar Chaka, Mongol ruler of Bulgaria",
    "Berengaria of Castile, Lady of Guadalajara, Spanish ruler (b. 1253)",
    "Tran Hung Dao, Vietnamese general",
    "Jacob van Maerlant, Flemish poet",
    "Jeanne de Montfort de Chambéon, Swiss ruler (b. 1250)",
    "William of Nangis, French chronicler"
  ]
}