{
  "events": [
    "February 9 – Wars of Scottish Independence: John \"Red\" Comyn, Lord of Badenoch, negotiates a peace with the Kingdom of England.[1]",
    "July 20 – Fall of Stirling Castle: Edward I of England takes the last rebel stronghold in the Wars of Scottish Independence.",
    "August 17 – The Battle of Mons-en-Pévèle is fought to a draw, between the French army and the Flemish militias.",
    "October 24 – Sasa Bey of the Beylik of Menteşe conquers Ephesus from the Eastern Roman Empire, massacring and deporting its native population.[2]",
    "James II of Aragon reconquers Villena, Spain.",
    "Holland and Zeeland are occupied by John II, Duke of Brabant and Guy of Dampierre. John II, Count of Hainaut recovers the counties.",
    "Ala-ud-din Khalji, Sultan of Delhi, conquers Gujarat.",
    "A peace treaty, signed between the khanates of the Mongol Empire, ends the Mongol civil war.",
    "The Genoese Benedetto I Zaccaria takes control of Chios Island from the Byzantine Empire, establishing an autonomous lordship there.[3][4]",
    "The construction of Ypres Cloth Hall is completed."
  ],
  "births": [
    "February 25 – Ibn Battuta, Moroccan jurist and explorer",
    "July 20 – Petrarch, Italian poet (d. 1374)",
    "William de Clinton, 1st Earl of Huntingdon",
    "Marie of Luxembourg, Queen of France (d. 1324)",
    "Louis I of Flanders (d. 1346)",
    "Jayaatu Khan, emperor of the Yuan Dynasty (d. 1332)",
    "Günther von Schwarzburg, German king (d. 1349)"
  ],
  "deaths": [
    "March 7 or 8 – Bartolomeo I della Scala, lord of Verona",
    "May 11 – Mahmud Ghazan, Mongol ruler (b. 1271)",
    "May 23 – Jehan de Lescurel, French poet and composer",
    "July 7 – Pope Benedict XI (b. 1240)",
    "July 17 – Edmund Mortimer, 2nd Baron Wigmore",
    "August 17 – Emperor Go-Fukakusa of Japan (b. 1243)",
    "August 22 – John II, Count of Hainaut (b. 1247)",
    "September – John de Warenne, 6th Earl of Surrey, English soldier",
    "December 23 – Matilda of Habsburg, duchess regent of Bavaria  (b. 1253)"
  ]
}