{
  "events": [
    "February 10 – Scottish Wars of Independence: Before the high altar of Greyfriars Church in Dumfries, Robert the Bruce murders John Comyn, his leading political rival, sparking revolution.",
    "March 25 – Robert the Bruce becomes King of the Scots.",
    "May – Hugh the younger Despenser, favourite of Edward, Prince of Wales, marries heiress Eleanor de Clare.",
    "May 15 –  One of the first exchange contracts (cambium) to mention the city of Bruges involves two parties: Giovanni Villani, representing the Peruzzi Company, granting a loan to Tommaso Fini, representing the Gallerani Company of Siena.",
    "June – The Knights Hospitaller conquer the islands of Kos (briefly) and Kastellorizo, and begin their conquest of Rhodes.[1]",
    "June 19 – Battle of Methven: The forces of the Earl of Pembroke defeat Bruce's Scottish rebels.",
    "August - September – The English army sacks Kildrummy Castle, captures and executes Nigel Bruce (brother of Robert I),  and captures Queen Elizabeth de Burgh, Christina Bruce and Mary Bruce (sisters of Robert I), and Marjorie Bruce, daughter of Robert I.",
    "September 29 – The Hatuna Games are played in Sweden.",
    "December 6 – The monetary policy of Philippe le Bel triggers a revolt in Paris. The provost's house is burned, and the king has to flee to the fortress of the Temple .[2]",
    "Philip IV of France exiles all the Jews from France, and confiscates their property.[3]",
    "Storkyrkan, the current cathedral of Stockholm, is consecrated.[4]",
    "In London, a city ordinance decrees that heating with coal is forbidden, when Parliament is in session (the ordinance is not particularly effective).[5]",
    "The Mongols raid India."
  ],
  "births": [
    "August 8 – Rudolf II, Duke of Bavaria (d. 1353)",
    "Isabella, Countess of Brienne, vassal ruler and claimant (d. 1360)",
    "Ashikaga Tadayoshi, general of the Northern and Southern Courts (d. 1352)",
    "Sasaki Takauji, Japanese poet, warrior, and bureaucrat (d. 1373)"
  ],
  "deaths": [
    "February 10 – John \"the Red\" Comyn, Scottish nobleman",
    "March – Araniko, Nepali artist (b. 1245)",
    "March 21 – Robert II, Duke of Burgundy (b. 1248)",
    "May 5 – Constantine Palaiologos, Byzantine prince and general (b. 1261)",
    "August 4 – King Wenceslaus III of Bohemia (b. 1289)",
    "December 6 – Roger Bigod, 5th Earl of Norfolk (b. 1270)",
    "Robert de Burghersh, 1st Baron Burghersh",
    "Khutulun, Mongol princess and warrior (b. 1260)"
  ]
}