{
  "events": [
    "January 6 – Henry VII is crowned King of Italy in Milan, and on February 12 crushes a local rebellion.",
    "March 15 – Battle of Halmyros: The Catalan Company defeats Walter V, Count of Brienne and his forces, to take control of the Duchy of Athens.[1]",
    "April 7 – Battle of Wopławki: The Teutonic Knights defeat the Grand Duchy of Lithuania.",
    "August 16 – The Parliament of England presents the Ordinances of 1311 to King Edward II (document dated 5 October; published on 11 October); these substitute the 21 Lord Ordainers for the King as the effective government of the country.[2]",
    "October 16 – The Council of Vienne begins.",
    "Bolingbroke Castle passes to the House of Lancaster.",
    "Lincoln Cathedral in England is completed; with the spire reaching around 525 feet (160 m),[3] it becomes the world's tallest structure (surpassing the Great Pyramid of Giza, which held the record for almost 4,000 years), a record it holds until the spire is blown down in 1549."
  ],
  "births": [
    "January 28 or 1312 – Joan II of Navarre, queen regnant of Navarre (d. 1349)",
    "June 24 or 1314 – Philippa of Hainault, queen of Edward III of England (d. 1369)",
    "August 13 – King Alfonso XI of Castile (d. 1350)",
    "July 1 – Liu Bowen, Chinese military strategist, officer, statesman and poet (d. 1375)",
    "date unknown\nPeter I, Duke of Bourbon (d. 1356)\nMargaret II, Countess of Hainaut (d. 1356)",
    "Peter I, Duke of Bourbon (d. 1356)",
    "Margaret II, Countess of Hainaut (d. 1356)"
  ],
  "deaths": [
    "January 27 – Külüg Khan, Emperor Wuzong of Yuan",
    "March 3 – Antony Bek, bishop of Durham",
    "March 15 – at the Battle of Halmyros:\nWalter V, Count of Brienne, Duke of Athens\nThomas III d'Autremencourt, Lord of Salona, Marshal of Achaea\nAlbert Pallavicini, Margrave of Bodonitza\nGeorge I Ghisi, Triarch of Euboea, Baron of Chalandritsa, Lord of Tinos, Mykonos, Serifos and Keos",
    "Walter V, Count of Brienne, Duke of Athens",
    "Thomas III d'Autremencourt, Lord of Salona, Marshal of Achaea",
    "Albert Pallavicini, Margrave of Bodonitza",
    "George I Ghisi, Triarch of Euboea, Baron of Chalandritsa, Lord of Tinos, Mykonos, Serifos and Keos",
    "May 29 – James II of Majorca (b. 1243)",
    "August 13 – Pietro Gradenigo, Doge of Venice",
    "September 5 – Amadeus Aba, Hungarian oligarch",
    "December 14 – Margaret of Brabant, German queen consort (b. 1276)",
    "date unknown\nDavid VIII of Georgia (b. 1273)\nArnold of Villanova, Spanish alchemist and physician (b. 1235)\nMangrai, founding king of Lan Na (b. 1238)",
    "David VIII of Georgia (b. 1273)",
    "Arnold of Villanova, Spanish alchemist and physician (b. 1235)",
    "Mangrai, founding king of Lan Na (b. 1238)",
    "probable – Bernard Saisset, Occitan bishop of Pamiers (b. 1232)"
  ]
}