{
  "events": [
    "April – Pope Clement V forcibly disbands the Knights Templar. This is following years of persecution of the Knights Templar, initially started on Friday, October 13, 1307, in collusion with King Philip \"The Fair\" Le Bel of France.",
    "June 15 – Battle of Rozgony: King Charles I of Hungary defeats the family of Palatine Amade Aba.",
    "June 29 – Henry VII, Holy Roman Emperor is crowned in the Lateran Palace, due to St Peter's Basilica being occupied by Romans hostile to him.",
    "September 27 – The Charter of Kortenberg is signed, and is possibly the first constitution which allows democratic decisions in feudal mainland Europe.",
    "October 31 – Henry VII, Holy Roman Emperor is forced to abandon his campaign against Florence.",
    "Battle of Amorgos: The Knights Hospitaller, newly based on Rhodes, defeat a Turkish fleet.[1]",
    "The Siege of Rostock begins.",
    "The Canary Islands are \"rediscovered\" by Lancelotto Malocello, a Genoese navigator, who sails to Lanzarote, and remains there for almost two decades.[2]",
    "Mansa Musa starts to rule the Mali Empire (approximate date).",
    "Öljaitü of the Ilkhanate briefly raids into Syria. He withdrew in the same year, ending the Mongol invasions of the Levant[3][4]"
  ],
  "births": [
    "November 13 – King Edward III of England (d. 1377)[5]",
    "date unknown\nWilliam Donn de Burgh, 3rd Earl of Ulster (d. 1333)\nAgnes, Countess of Dunbar, defender of Dunbar (d. 1369)\nWilliam II, Duke of Athens (d. 1338)",
    "William Donn de Burgh, 3rd Earl of Ulster (d. 1333)",
    "Agnes, Countess of Dunbar, defender of Dunbar (d. 1369)",
    "William II, Duke of Athens (d. 1338)"
  ],
  "deaths": [
    "May 13 – Theobald II, Duke of Lorraine (b. 1263)",
    "June 19 – Piers Gaveston, favourite of Edward II of England",
    "August 27 – Arthur II, Duke of Brittany (b. 1262)",
    "September 7 – King Ferdinand IV of Castile (b. 1285)[6]",
    "October 27\nJohn II, Duke of Brabant (b. 1275)\nGentile Portino da Montefiore, Italian cardinal[7]",
    "John II, Duke of Brabant (b. 1275)",
    "Gentile Portino da Montefiore, Italian cardinal[7]",
    "November 6 – Christina von Stommeln, Roman Catholic mystic and stigmatic (b. 1242)",
    "November 9 – Otto III, Duke of Bavaria (b. 1261)",
    "December 7 – Michael II, Syriac Orthodox Patriarch of Antioch[8]",
    "date unknown\nEschiva of Ibelin, sovereign Lady of Beirut (b. 1253)\nTokhta, khan of the Blue Horde\nZayn al-Din al-Amidi, blind Arab scholar",
    "Eschiva of Ibelin, sovereign Lady of Beirut (b. 1253)",
    "Tokhta, khan of the Blue Horde",
    "Zayn al-Din al-Amidi, blind Arab scholar"
  ]
}