{
  "events": [
    "March 18 – Jacques de Molay, the 23rd and last Grand Master of the Knights Templar, is burned at the stake in Paris, France.",
    "April 4 – Exeter College, Oxford is founded in England by Walter de Stapledon, Bishop of Exeter.",
    "June 24 – Battle of Bannockburn: Scottish forces led by Robert the Bruce defeat Edward II of England, regaining Scotland's independence.[1]",
    "August 31 – King Haakon V of Norway moves his capital from Bergen to Oslo, where he builds Akershus Fortress, from which Norway is ruled for the next 500 years.",
    "October 19 – Frederick the Fair of the House of Habsburg is elected King of the Romans at Sachsenhausen (Frankfurt am Main), by four of the electors, being crowned on November 25 at Bonn Minster.",
    "October 20 – Louis IV of the House of Wittelsbach is elected King of the Romans at Sachsenhausen by five of the electors, being crowned on November 25 at Aachen.",
    "November 29 – Philip IV of France dies, possibly very much affected by the Tour de Nesle Affair, and is succeeded by Louis X.",
    "Undated – Amda Seyon starts to rule as Emperor of Ethiopia. He defeats the Muslims at Ifat."
  ],
  "births": [
    "March 10 – King Ramathibodi I of Ayutthaya (d. 1369)",
    "June 24 – Philippa of Hainault, Queen consort of Edward III of England (d. 1369)",
    "date unknown – Valdemar III of Denmark (d. 1364)"
  ],
  "deaths": [
    "January 30 – Nicholas III of Saint Omer, co-lord of Thebes, Marshal of Achaea",
    "February 8 – Helen of Anjou, queen of Serbia (b. 1236)",
    "March 4 – Jakub Świnka, Polish Catholic priest",
    "March 18\nJacques de Molay, last Grand Master of the Knights Templar\nGeoffroy de Charney, Preceptor of Normandy for the Knights Templar",
    "Jacques de Molay, last Grand Master of the Knights Templar",
    "Geoffroy de Charney, Preceptor of Normandy for the Knights Templar",
    "April 20 – Pope Clement V (b. 1264)",
    "June 23 – Henry de Bohun, English knight personally killed by Robert the Bruce",
    "October 21 – Geoffrey de Geneville, 1st Baron Geneville",
    "November 20 – Albert the Degenerate, Landgrave of Thuringia",
    "November 29 – King Philip IV of France (b. 1268)",
    "date unknown – Giovanni Pisano, Italian sculptor (b. 1250)"
  ]
}