{
  "events": [
    "May 9 – Eudes IV succeeds Hugh V as Duke of Burgundy.",
    "August – Louis X is crowned King of France at Reims.",
    "August 13 – Louis X of France marries Clemence d'Anjou.",
    "August 29 – Battle of Montecatini: Pisa defeats the forces of  Florence and Naples.",
    "September – Battle of Moiry Pass (Bruce campaign in Ireland): Edward Bruce (brother of the King of Scotland), with a Scots-Irish army, defeats a garrison of Hiberno-Norman troops of the Lordship of Ireland at Armagh, as part of his attempt to revive the High Kingship of Ireland.",
    "October 25 – Banastre Rebellion: Adam Banastre, Henry de Lea and William Bradshaw attack Liverpool Castle.",
    "November 15 – Battle of Morgarten: The Swiss defeat Leopold of Austria on the shore of the Ägerisee, ensuring independence for the Swiss Confederation.[1]",
    "Louis X of France abolishes slavery within the Kingdom of France.",
    "Hōjō Mototoki becomes Kamakura shōgun of Japan.",
    "John XIII Glykys becomes Patriarch of Constantinople.",
    "Flushing, Netherlands is granted city rights.",
    "Witzlaw III, prince of Rügen, builds Hejehdbhdd castle at Barth.",
    "Emir Ismael Abu-I-Walid orders the Jews of Granada to don the yellow badge.",
    "Dassel, Germany is granted city rights.",
    "The Kos Fortress is erected by the Knights Hospitallers in Greece.",
    "The Arsenian schism ends.",
    "History of Sudan (Coming of Islam to the Turkiyah): A Muslim prince of Nubian royal blood ascends the throne of Dongola as king.",
    "Estimation: Cairo, capital of Mamluk Egypt becomes the largest city of the world, taking the lead from Hangzhou in Mongolian China.",
    "The Borough of Liverpool, along with Liverpool Castle, is granted to Robert de Holland.",
    "The Great Famine of 1315–1317 begins."
  ],
  "births": [
    "April 5 – James III of Majorca (d. 1349)",
    "May 20 – Bonne of Luxembourg, Queen of John II of France (d. 1349)"
  ],
  "deaths": [
    "February or March – Margaret of Villehardouin, Lady of Akova (b. 1266)",
    "March 10 – Agnes Blannbekin, Austrian Beguine mystic[2]",
    "May 9 – Hugh V, Duke of Burgundy (b. 1282)",
    "June 29 – Ramon Llull, Spanish philosopher (b. 1235)",
    "August 12 – Guy de Beauchamp, 10th Earl of Warwick, English nobleman",
    "August 15 or April 30 – Margaret of Burgundy, Queen of France (b. 1290), during imprisonment",
    "August 29\nCharles of Taranto (b. 1296)\nPeter Tempesta, Count of Eboli (b. 1291)",
    "Charles of Taranto (b. 1296)",
    "Peter Tempesta, Count of Eboli (b. 1291)"
  ]
}