{
  "events": [
    "January 28–March 18 – Llywelyn Bren revolts against English rule in Wales.",
    "February 22 – Battle of Picotin: Catalan forces of Ferdinand of Majorca defeat those of Matilda of Hainaut on the Peloponnese.",
    "July 5 – Battle of Manolada: Forces of the Duchy of Burgundy defeat the Kingdom of Majorca, kill its king, Ferdinand, and conquer the Principality of Achaea.",
    "August – Battle of Gransee: A North German-Danish alliance, led by Henry II of Mecklenburg, decisively defeats the forces of Waldemar of Brandenburg.",
    "August 7 – Pope John XXII succeeds Pope Clement V as the 196th pope.",
    "August 10 – Second Battle of Athenry: Norman rule is retained in Ireland, at the cost of over 5,000 dead.",
    "The Great Famine of 1315–1317 is at its peak.",
    "The Pound sterling experiences the greatest year of inflation in its history, at 100.04 percent, losing over half its value.[1]",
    "The Au peninsula in Switzerland is first mentioned as \"Owe\", belonging to the commandry of the Knights Hospitaller in Bubikon."
  ],
  "births": [
    "March 2 – King Robert II of Scotland (d. 1390)",
    "April or May – Magnus IV, king of Sweden 1319–1364 (d. 1374)",
    "May 14 – Charles IV, Holy Roman Emperor and king of Bohemia (d. November 29 1378)",
    "November 7 – Simeon of Russia (d. 1353)",
    "November 15 – King John I of France (d. November 20)",
    "date unknown – Fa Ngum, King of Lan Xang (d. 1393)"
  ],
  "deaths": [
    "March 2 – Marjorie Bruce, Scottish princess, daughter of Robert I of Scotland (b. 1296)",
    "March 12 – King Stefan Dragutin of Serbia",
    "June 5 – King Louis X of France (b. 1289)",
    "July 5 – Infante Ferdinand of Majorca (b. 1278)",
    "August 2 – Louis of Burgundy, Prince of Achaea (b. 1297)",
    "August 10 – Felim mac Aedh Ua Conchobair, King of Connacht (in battle)",
    "November 20 – King John I of France (b. November 15)",
    "date unknown\nGuillaume Guiart, French chronicler and poet\nGuo Shoujing, Chinese astronomer and mathematician\nVytenis, Grand Prince of Lithuania\nAlauddin Khalji, sultan of Delhi, India\nSang Sapurba, progenitor of the Malay kings of Malacca and Majapahit (b. 1245)\nÖljaitü, Khan of the Ilkhanate",
    "Guillaume Guiart, French chronicler and poet",
    "Guo Shoujing, Chinese astronomer and mathematician",
    "Vytenis, Grand Prince of Lithuania",
    "Alauddin Khalji, sultan of Delhi, India",
    "Sang Sapurba, progenitor of the Malay kings of Malacca and Majapahit (b. 1245)",
    "Öljaitü, Khan of the Ilkhanate"
  ]
}