{
  "events": [
    "March – King Birger of Sweden is deposed, and forced to flee to Denmark (alternative date is April).",
    "April 1 – Berwick-upon-Tweed is retaken by the Scottish from the English.",
    "April – The inhabitants of Benevento, Italy rise against the Pope, and demand some political autonomy. The rebellion is crushed by William of Frejus, and the archbishop of Naples.[1]",
    "May 11 – Battle of Dysert O'Dea: The Irish armies of Conor O'Dea defeat the Hiberno-Normans under Richard de Clare.",
    "June 27 – Mats Kettilmundsson is appointed regent (rikshövitsman) of Sweden, in the absence of a Swedish king.",
    "October 14 – Battle of Faughart: A Hiberno-Norman force defeats a Scots-Irish army commanded by Edward Bruce (who is killed in the battle), ending the Bruce campaign in Ireland.",
    "Emperor Go-Daigo succeeds Emperor Hanazono on the throne of Japan.",
    "Pope John XXII declares the doctrines of the Franciscans, advocating ecclesiastical poverty, erroneous.",
    "Disease hits cattle and sheep, reducing the herds and flocks in Europe.",
    "Qala'un Mosque, Cairo, Egypt is founded by Al-Nasr Muhammad."
  ],
  "births": [
    "June 18 – Eleanor of Woodstock, countess regent of Guelders, eldest daughter of King Edward II of England (d. 1355)[2]",
    "September 11 – Eleanor of Lancaster (d. 1372)",
    "date unknown – Margarete Maultasch, Countess of Tyrol (d. 1369)",
    "probable\nAlbert II, Duke of Mecklenburg\nPope Urban VI (d. 1389)",
    "Albert II, Duke of Mecklenburg",
    "Pope Urban VI (d. 1389)"
  ],
  "deaths": [
    "February 14 – Marguerite of France, queen of Edward I of England (b. 1282)",
    "October 14 – Edward Bruce, High King of Ireland (b. 1275)",
    "November 22 – Mikhail Yaroslavich, Russian prince (b. 1271)",
    "date unknown\nLlywelyn Bren, Welsh rebel\nHeinrich Frauenlob, Bohemian musician\nRashid-al-Din Hamadani, Persian writer and historian (b. 1247)\nErik Magnusson, Swedish Duke, brother of King Birger (starved in a dungeon at Nyköpingshus)\nValdemar Magnusson, Swedish Duke, brother of King Birger (starved in a dungeon at Nyköpingshus)",
    "Llywelyn Bren, Welsh rebel",
    "Heinrich Frauenlob, Bohemian musician",
    "Rashid-al-Din Hamadani, Persian writer and historian (b. 1247)",
    "Erik Magnusson, Swedish Duke, brother of King Birger (starved in a dungeon at Nyköpingshus)",
    "Valdemar Magnusson, Swedish Duke, brother of King Birger (starved in a dungeon at Nyköpingshus)"
  ]
}