{
  "events": [
    "c. May–June – Leper scare: Rumours that lepers (acting on the orders of Jews bribed by Moors) are attempting to poison the Christian population spread throughout southern France.",
    "August 14 – King Edward II of England reluctantly agrees to demands from his barons to send Hugh le Despenser, 1st Earl of Winchester, and his son Hugh Despenser the Younger into exile.[1]",
    "October 29 – King Stephen Uroš II Milutin of Serbia dies. His son Stephen Constantine claims the throne, but Constantine's younger half-brother Stephen Uroš III Dečanski succeeds.",
    "The Byzantine civil war of 1321–28 begins, when Andronikos III Palaiologos initiates an uprising against Andronikos II Palaiologos.[2]",
    "A bad harvest brings famine in Europe.",
    "The Anatolian beylik of Teke is established.",
    "Gračanica monastery in Kosovo is rebuilt by the Serbian king Stefan Milutin.",
    "Spitakavor Monastery is completed in Armenia.",
    "The University of Florence is established.[3]",
    "The Kebra Negast is translated from Arabic to Ge'ez, according to its colophon."
  ],
  "births": [
    "February 5 – John II, Marquess of Montferrat (d. 1372)",
    "July 5 – Joan of The Tower, queen consort of Scotland (d. 1362)",
    "August 29 – John of Artois, Count of Eu, French soldier (d. 1387)",
    "date unknown\nJames I, Count of Urgell\nKhwaja Bande Nawaz, Sufi saint (d. 1422)",
    "James I, Count of Urgell",
    "Khwaja Bande Nawaz, Sufi saint (d. 1422)",
    "probable – Emperor John III of Trebizond (d. 1362)"
  ],
  "deaths": [
    "January 12 or 1322 – Maria of Brabant, queen consort of Philip III of France (b. 1256)",
    "January 13 – Bonacossa Borri, Lady of Milan (b. 1254)",
    "February 25 – Beatrice d'Avesnes, consort of Henry VI, Count of Luxembourg",
    "March 18 – Matthew III Csák, Hungarian oligarch (b. c.1260/5)",
    "April 8 – Thomas of Tolentino, Italian Franciscan missionary, martyred (b. c. 1255)",
    "April 17 – Infanta Blanche of Portugal, daughter of King Afonso III of Portugal and Urraca of Castile (b. 1259)",
    "April 27 – Nicolò Albertini, Italian cardinal statesman (b. c. 1250)",
    "May 31 – Birger, King of Sweden (b. 1280)",
    "July 1 – María de Molina, queen consort of Castile (b. c. 1265)",
    "September 14 – Dante Alighieri, Italian poet (b. 1265)[4]",
    "October 29 – Stefan Milutin, King of Serbia (b. c. 1253)",
    "November 9 – Walter Langton, bishop of Lichfield and treasurer of England (b. 1243)",
    "date unknown\nMarianus III of Arborea, Giudice\nMubarak Khan, Khilji regent, murdered\nReginald of Burgundy, Count of Montbéliard\nWitte van Haemstede, Dutch prince (b. 1280/2)",
    "Marianus III of Arborea, Giudice",
    "Mubarak Khan, Khilji regent, murdered",
    "Reginald of Burgundy, Count of Montbéliard",
    "Witte van Haemstede, Dutch prince (b. 1280/2)",
    "probable – Ibn al-Banna' al-Marrakushi, Arab mathematician (b. 1256)",
    "See also[edit]",
    "List of state leaders in 1321",
    "1321 in Scotland"
  ]
}