{
  "events": [
    "23 March – Pope John XXII excommunicates German king Louis IV, as Louis had not sought papal approval during his conflict with Frederick the Fair.   Louis in turn declares the pope a heretic, because of John's opposition against the view of Christ's absolute poverty held by some Franciscans.",
    "Marsilius of Padua writes his defence of the secular state, Defensor pacis.",
    "Emperor Musa I of Mali arrives in Cairo on his hajj to Mecca, accompanied by an entourage numbering in the thousands, and with hundreds of pounds of gold. This display of wealth garners the Mali Empire a place on European maps in 1395. On his return journey, he peacefully annexes Timbuktu. He is said to have told the Arabic historian Al-Umari that \"his predecessors had launched two expeditions from West Africa to discover the limits of the Atlantic Ocean.\""
  ],
  "births": [
    "March 5 – King David II of Scotland (d. 1371)[1]",
    "date unknown\nPrince Dmitry of Suzdal (d. 1383)\nLouis of Durazzo, Count of Gravina and Morrone (d. 1362)\nConstance of Sicily, princess regent of Sicily (d. 1355)\nGiovanni Manfredi, lord of Faenza (d. 1373)\nPrince Tsunenaga, Japanese imperial prince (d. 1338)",
    "Prince Dmitry of Suzdal (d. 1383)",
    "Louis of Durazzo, Count of Gravina and Morrone (d. 1362)",
    "Constance of Sicily, princess regent of Sicily (d. 1355)",
    "Giovanni Manfredi, lord of Faenza (d. 1373)",
    "Prince Tsunenaga, Japanese imperial prince (d. 1338)",
    "probable – Manuel II, Emperor of Trebizond (d. 1333)"
  ],
  "deaths": [
    "January 8 or January 9 – Marco Polo, Italian explorer (b. 1254)",
    "February 11 – Karl von Trier, Grand Master of the Teutonic Order",
    "March 26 – Marie de Luxembourg, Queen of France (b. 1304) (carriage accident)",
    "June 23 – Aymer de Valence, 2nd Earl of Pembroke (b. c.1275)",
    "July 16 – Emperor Go-Uda of Japan (b. 1265)",
    "August 16 or August 17 – Irene of Brunswick, Empress of Constantinople (b. c. 1293)",
    "August 31 – Henry II of Jerusalem (b. 1271)",
    "November 1 – John de Halton, Bishop of Carlisle",
    "November 3 – Petronilla de Meath, Irish servant and suspected witch (burned at stake)",
    "date unknown\nDino Compagni, Italian historian (b. c. 1255)\nHedwig of Holstein, queen consort of Sweden (b. 1260)\nKing Sancho of Majorca (b. 1274)",
    "Dino Compagni, Italian historian (b. c. 1255)",
    "Hedwig of Holstein, queen consort of Sweden (b. 1260)",
    "King Sancho of Majorca (b. 1274)"
  ]
}