{
  "events": [
    "January 24 – Philippa of Hainault marries King Edward III of England a year after his coronation.[1] The marriage produces ten children, the eldest of whom is Edward the Black Prince.",
    "May 1 – Treaty of Edinburgh–Northampton: England recognises Scotland as an independent nation, after the Wars of Scottish Independence.",
    "May 12 – Antipope Nicholas V is consecrated at St. Peter's Basilica in Rome by the bishop of Venice.",
    "May 26 – William of Ockham secretly leaves Avignon, under threat from Pope John XXII.",
    "May 29 – King Philip VI of France is crowned, founding the House of Valois, after the death of King Charles IV of France, who has no sons to inherit.",
    "August 23 – Battle of Cassel: French troops stop an uprising of Flemish farmers.",
    "Undated – The Augustiner-Bräu is first recorded as the brewery of an Augustinian monastery at Munich.[2]"
  ],
  "births": [
    "April 1 – Blanche of France, Duchess of Orléans (d. 1393)",
    "May 7 – Louis VI the Roman, Duke of Bavaria and Elector of Brandenburg (d. 1365)",
    "June 25 – William de Montagu, 2nd Earl of Salisbury, English military leader (d. 1397)",
    "September 29 – Joan of Kent, princess of Wales, spouse of Edward the Black Prince (d. 1385)",
    "October 9 – King Peter I of Cyprus (d. 1369)",
    "October 21 – Hongwu Emperor of China (d. 1398)",
    "November 11 – Roger Mortimer, 2nd Earl of March, English military leader (d. 1360)",
    "November 25 – Antipope Benedict XIII, born Pedro Martínez de Luna (d. 1423)",
    "date unknown\nArchibald Douglas, 3rd Earl of Douglas (\"Archibald the Grim\", \"Black Archibald\"), Scottish magnate and warrior (d. 1400)\nEmperor Go-Murakami of Japan (d. 1368)",
    "Archibald Douglas, 3rd Earl of Douglas (\"Archibald the Grim\", \"Black Archibald\"), Scottish magnate and warrior (d. 1400)",
    "Emperor Go-Murakami of Japan (d. 1368)"
  ],
  "deaths": [
    "February 1 – King Charles IV of France (b. 1294)[3]",
    "August 15 – Yesün Temür, emperor of the Yuan dynasty (b. 1293)",
    "August 23 – Nicolaas Zannekin, Flemish peasant leader (in the battle of Cassel)[4]",
    "September 26 – Ibn Taymiyyah, Islamic scholar and philosopher of Harran (b. 1263)[5]",
    "October 12 (or 13) – Clementia of Hungary, Queen consort of France and Navarre (b. 1293)[6]",
    "November 16 – Prince Hisaaki, Japanese shōgun (b. 1276)",
    "date unknown\nMeister Eckhart, German theologian (b. 1260)\nAndronikos Angelos Palaiologos, Byzantine nobleman and governor (b. ca. 1282)",
    "Meister Eckhart, German theologian (b. 1260)",
    "Andronikos Angelos Palaiologos, Byzantine nobleman and governor (b. ca. 1282)"
  ]
}