{
  "events": [
    "March 16 – Edward, the Black Prince establishes the Duchy of Cornwall, becoming the first English Duke.[1]",
    "May 24 – Philip VI of France confiscates Gascony from English control.[2]",
    "August – English forces relieve Stirling Castle, ending Edward III of England's last campaign in Scotland.[2]",
    "October – Hundred Years' War: Edward III of England formally rejects Philip VI's claim to the French throne, initiating hostilities between France and England.[2][3]",
    "November – Battle of Cadzand: English troops raid the Flemish island of Cadzand.",
    "Bisham Priory is founded in England.",
    "The Scaligeri Family loses control of Padua; Alberto della Scala, patron of the music of the Trecento, moves to Verona.",
    "Petrarch, \"father\" of Renaissance humanism, first visits Rome to wander its mysterious ruins, with an eye for aesthetics as well as for history, exciting a renewed interest in Classical civilisation.",
    "The Sofia Psalter is produced in Bulgaria.",
    "The famine in China, which had lasted since 1332 and killed 6,000,000 comes to an end."
  ],
  "births": [
    "February 25 – Wenceslaus I, Duke of Luxembourg, Czech Duke of Luxembourg (d. 1383)",
    "date unknown\nLouis II, Duke of Bourbon (d. 1410)\nJean Froissart, historian and courtier from Hainaut (d. 1405)\nBianca of Savoy, lady consort of Milan (d. 1387)\nJeong Mong-ju, Goryeo diplomat and poet (d. 1392)\nRobert III of Scotland, second monarch from the House of Stewart to rule Scotland (d. 1406)",
    "Louis II, Duke of Bourbon (d. 1410)",
    "Jean Froissart, historian and courtier from Hainaut (d. 1405)",
    "Bianca of Savoy, lady consort of Milan (d. 1387)",
    "Jeong Mong-ju, Goryeo diplomat and poet (d. 1392)",
    "Robert III of Scotland, second monarch from the House of Stewart to rule Scotland (d. 1406)"
  ],
  "deaths": [
    "January 8 – Giotto di Bondone, Italian painter (b. 1267)",
    "June 7 – William I, Count of Hainaut (b. 1286)",
    "June 15 – Angelo da Clareno, Italian Franciscan and leader of a group of Fraticelli (b. 1247)",
    "June 25 – Frederick III of Sicily (b. 1272)",
    "June 30 – Eleanor de Clare, politically active English noble (b. 1290)",
    "date unknown\nWilliam Frangipani, Latin Archbishop of Patras\nMusa I of Mali, ruler of the Malian Empire (b. c.1280)\nPrince Narinaga, Japanese Shōgun (b. 1326, d. either 1337 or 1344, the sources are contradictory)",
    "William Frangipani, Latin Archbishop of Patras",
    "Musa I of Mali, ruler of the Malian Empire (b. c.1280)",
    "Prince Narinaga, Japanese Shōgun (b. 1326, d. either 1337 or 1344, the sources are contradictory)"
  ]
}