{
  "events": [
    "January 1 – Louis IV's son, Louis VI the Roman, marries Cunigunde, a Lithuanian princess.",
    "January 17 – The Turks attack Smyrna.",
    "March 15 – The Miracle of the Host occurs (as commemorated in Amsterdam).",
    "March 24 – Guy de Chauliac observes the planets Saturn, Jupiter, and Mars conjoined in the sky, under the sign of Aquarius, and a solar eclipse on the same day. This sign is interpreted as foreboding by many, and Chauliac will later blame it for the Black Plague.[1][2]",
    "April – Edward III of England offers \"defiance\" of Philip VI of France.",
    "April 22 – Battle of Gamenario: The Lombards defeat the Angevins in the northwest region of present-day Italy, just southeast of Turin.",
    "May – The Turks, led by Umur Beg, sail from Asia Minor to the Balkan Peninsula, and raid Bulgarian territory.[3]",
    "July 7 – Battle of Peritheorion: the forces of Momchil, autonomous ruler of the Rhodope, are defeated by the Turkish allies of John VI Kantakouzenos.[4]",
    "August - Gascon campaign of 1345 -  Battle of Bergerac, Gascony: English troops are victorious over the French. [5]",
    "September – Holland, Hainaut and Zeeland are inherited by Louis IV, Holy Roman Emperor, and remain part of the imperial crown domain until 1347.",
    "September 18 – Andrew, Duke of Calabria is assassinated in Naples (d. in Aversa).",
    "September 26 – Battle of Warns: The Frisians defeat the forces of Holland under William II, Count of Hainaut, in the midst of the Friso-Hollandic Wars.",
    "October 21 – Battle of Auberoche in Gascony: The English defeat the French.[6]",
    "November 8 – The English take La Réole in Gascony.[7]",
    "December – The English take Aiguillon in Gascony.",
    "Asia[edit]",
    "Western Europe[edit]",
    "Central Europe[edit]",
    "Sweden and Lithuania[edit]",
    "Balkans[edit]",
    "Anatolian Peninsula[edit]",
    "Africa[edit]"
  ],
  "births": [
    "January 8 – Kadi Burhan al-Din, poet, kadi, and ruler of Sivas (d. 1398)[43]",
    "March 25 or 1347 – Blanche of Lancaster, wife of John of Gaunt, 1st Duke of Lancaster (d. 1369)",
    "October 31 – King Fernando I of Portugal (d. 1383)",
    "December 7 – Thado Minbya, founder of the Ava kingdom (d. 1367)",
    "date unknown\nKing Charles III of Naples, reign 1381–1386 (d. 1386)\nEleanor Maltravers, English noblewoman (d. 1405)\nJohn Wolflin (d. 1393)\nQueen Helen of Bosnia (d. 1399)",
    "King Charles III of Naples, reign 1381–1386 (d. 1386)",
    "Eleanor Maltravers, English noblewoman (d. 1405)",
    "John Wolflin (d. 1393)",
    "Queen Helen of Bosnia (d. 1399)"
  ],
  "deaths": [
    "January 17\nMartino Zaccaria, former Genoese Lord of Chios (killed by Turks at Smyrna)\nHenry of Asti, titular Latin Patriarch of Constantinople (killed by Turks at Smyrna)",
    "Martino Zaccaria, former Genoese Lord of Chios (killed by Turks at Smyrna)",
    "Henry of Asti, titular Latin Patriarch of Constantinople (killed by Turks at Smyrna)",
    "September 18 – Andrew, Duke of Calabria (b. 1327)",
    "September 22 – Henry, 3rd Earl of Lancaster, English politician (b. 1281)",
    "April 14 – Richard Aungerville (also known as Richard De Bury), English writer and bishop (b. 1287)",
    "June 11 – Alexios Apokaukos, chief minister of the Byzantine Empire (lynched by political prisoners)",
    "July 7 – Momchil, semi-independent brigand ruler in the Rhodope Mountains (killed in battle)",
    "July 24 – Jacob van Artevelde, Flemish statesman (b. 1290) (killed by mob)",
    "July 28 – Sancia of Majorca, queen regent of Naples (b. c. 1285)",
    "September 26 – William II, Count of Hainaut (killed in the Battle of Warns)",
    "November 13 – Constance of Peñafiel, queen of Pedro I of Portugal (b. 1323)",
    "date unknown\nAedh mac Tairdelbach Ó Conchobair, King of Connacht\nJohn Vatatzes, Byzantine general (murdered)\nJohn Apokaukos, governor of Thessalonica (executed)",
    "Aedh mac Tairdelbach Ó Conchobair, King of Connacht",
    "John Vatatzes, Byzantine general (murdered)",
    "John Apokaukos, governor of Thessalonica (executed)"
  ]
}