{
  "events": [
    "Spring – A severe Black Death epidemic begins in the Crimea.[1]",
    "March 18 – The French prepare to defend the channel coasts.[2]",
    "April 1–August 20 – Siege of Aiguillon: The French fail to take Aiguillon from its English defenders.[2]",
    "April 16 – The Serbian Empire is proclaimed in Skopje by Dusan Silni, occupying much of South-Eastern Europe.[3]",
    "May–June – An English invasion fleet assembles at Portsmouth.[2]",
    "June 9 – Battle of St Pol de Léon: The English army defeats Charles of Blois in Brittany.[2]",
    "June 20 – The English win a small victory at La Roche-Derrien in Brittany.[2]",
    "June 24 – The leaders of Ghent, Bruges and Ypres agree to support Edward III.[2]",
    "July – Edward III orders the closing of English ports to stop information from reaching France.[2]",
    "July 3 – The English fleet attempts to sail from Portsmouth to Normandy, but is forced back by contrary winds.[2]",
    "July 11 – Charles IV, Count of Luxembourg and King of Bohemia, is elected King of the Romans.[4]",
    "July 11–12 – Edward III and the English army cross the English Channel and begin an invasion of France.[5]",
    "July 12–18 – The English raid and burn neighbouring towns and villages in the Cotentin Peninsula.[5]",
    "July 26 – Battle of Caen (1346): an English army captures and sacks the French city of Caen.[6]",
    "August 10 – Jaume Ferrer sets out from Majorca for the \"River of Gold\", the Senegal River.[7]",
    "August 24 – Battle of Blanchetaque: The English defeat the French.",
    "August 26 – Battle of Crécy: The English defeat the French, in the first European battle where gunpowder is used.[8]",
    "September 4 – The English begin the siege of Calais.[8]",
    "September–October – Anglo-Gascon offensives overrun large parts of south west France.[9]",
    "October 4 – The English capture and sack the French city of Poitiers.[10]",
    "October 17 – Battle of Neville's Cross: The English army defeats the Scots.[11]",
    "October–November – Several Mongol towns in the Crimea are cleared of inhabitants by the Black Death.[1]",
    "Repairs are made in the Hagia Sophia.",
    "Asia[edit]",
    "Europe[edit]"
  ],
  "births": [
    "July 20 – Margaret, Countess of Pembroke, English princess, daughter of King Edward III of England (d. 1361)[40]",
    "date unknown – Eustache Deschamps, French poet (d. 1406)[41]"
  ],
  "deaths": [
    "February 10 – Blessed Clare of Rimini (b. 1282)[42]",
    "March 28 – Venturino of Bergamo, Dominican preacher (b. 1304)[43]",
    "August – Muhammad Aytimur, leader of the Sarbadars of Sabzewar (alternative date is September)[44]",
    "August 26 (killed in the Battle of Crécy):\nCharles II, Count of Alençon (b. 1297)[45]\nLouis I, Count of Flanders (b. 1304)[46]\nLouis II, Count of Blois\nJohn of Bohemia (b. 1296)[4]\nRudolph, Duke of Lorraine (b. 1320)[47]",
    "Charles II, Count of Alençon (b. 1297)[45]",
    "Louis I, Count of Flanders (b. 1304)[46]",
    "Louis II, Count of Blois",
    "John of Bohemia (b. 1296)[4]",
    "Rudolph, Duke of Lorraine (b. 1320)[47]",
    "October – Raghnall Mac Ruaidhrí, Scottish magnate",
    "October 17 (killed in the Battle of Neville's Cross):\nJohn Randolph, 3rd Earl of Moray[48]\nMaurice de Moravia, Earl of Strathearn[49]",
    "John Randolph, 3rd Earl of Moray[48]",
    "Maurice de Moravia, Earl of Strathearn[49]",
    "November 14 – Ostasio I da Polenta, Lord of Ravenna (assassinated)[50]",
    "November 27 – Saint Gregory of Sinai (b. c. 1260)[51]",
    "date unknown\nEustace Folville, English outlaw[52]\nHélion de Villeneuve, Grand Master of the Knights of St John[53]",
    "Eustace Folville, English outlaw[52]",
    "Hélion de Villeneuve, Grand Master of the Knights of St John[53]"
  ]
}