{
  "events": [
    "January 26 – Charles University in Prague is founded by a bull issued by Pope Clement VI at the request of Charles I, King of Bohemia.",
    "February 2 – The Byzantine civil war of 1341–1347 between John VI Kantakouzenos and the regency for John V Palaiologos ends with Kantakouzenos entering Constantinople.",
    "April – The Knights Hospitaller defeat a Turkish fleet, and sink 100 ships off Imbros.[1]",
    "May\nThe agreement reorganizing the Byzantine Empire's affairs is finalized, as Anna of Savoy's son John V Palaiologos marries Kantakouzenos' 15-year-old daughter Helena.\nGenoese ships fleeing the 1331 Black Death plague in Theodosia stop in Constantinople, contaminating the city.",
    "The agreement reorganizing the Byzantine Empire's affairs is finalized, as Anna of Savoy's son John V Palaiologos marries Kantakouzenos' 15-year-old daughter Helena.",
    "Genoese ships fleeing the 1331 Black Death plague in Theodosia stop in Constantinople, contaminating the city.",
    "May 20 – Cola di Rienzo, a Roman commoner, declares himself Emperor of Rome, in response to years of baronial power struggles.",
    "August 2 – The Islamic Bahmani Kingdom is established on the Indian subcontinent.",
    "September – Hundred Years' War: The English win the city of Calais.",
    "September 1 – The Black Death reaches the French port city of Marseilles.",
    "October – Ships arrive in the Sicilian city of Messina, carrying people afflicted by the Black Plague onboard.",
    "November\nPope Clement VI unites several of Rome's upper-class nobility, who drive Cola di Rienzo out of the city.\nKing Phillip of France meets with the Estates General to ask for funds to further the war effort against the English.",
    "Pope Clement VI unites several of Rome's upper-class nobility, who drive Cola di Rienzo out of the city.",
    "King Phillip of France meets with the Estates General to ask for funds to further the war effort against the English.",
    "November 1 – The Black Death spreads to Aix-en-Provence in France.",
    "December – Plague hits the island of Majorca.",
    "December 24 – Pembroke College in the University of Cambridge, England, is founded by Marie de St Pol, Countess of Pembroke, as the Hall of Valence Marie.",
    "December 25 – The first cases of the plague are recorded in the city of Split, in Croatia.",
    "December 27 – To fund military operations in Corsica, the Republic of Genoa has to borrow at 20%, from an association of creditors known as the Compera nuova acquisitionis Corsicæ.[2]",
    "Asia[edit]",
    "Europe[edit]"
  ],
  "births": [
    "February 6 – Dorothea of Montau, German hermitess and visionary (d. 1394)",
    "February 27 – Alberto d'Este, Lord of Ferrara and Modena (d. 1393)",
    "March 25 – Catherine of Siena, Italian saint (d. 1380)",
    "March 31 – Frederick III, Duke of Austria, second son of Duke Albert II of Austria (d. 1362)",
    "July 28 – Margherita of Durazzo, Queen consort of Charles III of Naples (d. 1412)",
    "August 29 – John Hastings, 2nd Earl of Pembroke, English nobleman and soldier (d. 1375)",
    "date unknown\nEleanor of Arborea, ruler of Sardinia (d. 1404)\nElizabeth of Pomerania, fourth and final wife of Charles IV, Holy Roman Emperor (d. 1393)\nEmperor Go-Kameyama, 99th Emperor of Japan (d. 1424)\nRichardis of Schwerin, queen consort of Sweden (d. 1377)",
    "Eleanor of Arborea, ruler of Sardinia (d. 1404)",
    "Elizabeth of Pomerania, fourth and final wife of Charles IV, Holy Roman Emperor (d. 1393)",
    "Emperor Go-Kameyama, 99th Emperor of Japan (d. 1424)",
    "Richardis of Schwerin, queen consort of Sweden (d. 1377)"
  ],
  "deaths": [
    "February 2 – Thomas Bek, Bishop of Lincoln (b. 1282)",
    "May 30 – John Darcy, 1st Baron Darcy de Knayth, English peer (b. 1290)",
    "June – John de Warenne, 7th Earl of Surrey, English nobleman (b. 1286)",
    "June 11 – Bartholomew of San Concordio, Italian Dominican canonist and man of letters (b. 1260)",
    "October 11 – Louis IV, Holy Roman Emperor (b. 1282)",
    "November – Richard de Pilmuir,  bishop of Dunkeld",
    "November 12 – John of Viktring, Austrian chronicler and political advisor in Carinthia (b. 1270–1280)",
    "November 15 – James I of Urgell, Prince of Aragon (b. 1321)",
    "date unknown\nShah Jalal, Sufi saint of Bengal (b. 1271)\nWilliam of Ockham, English philosopher (b. 1288)\nBlanca de La Cerda y Lara, Spanish noblewoman (b. 1317)\nJohn de Egglescliffe, English bishop\nAdam Murimuth, English ecclesiastic and chronicler (b. 1274)\nPeter III of Arborea, Judge of Arborea\nLamberto II and Pandolfo da Polenta, brothers and lords of Ravenna and Cervia\nKokan Shiren, Japanese Rinzai Zen patriarch and celebrated Chinese poet (b. 1278)\nSang Nila Utama, Founder and First King of Singapura",
    "Shah Jalal, Sufi saint of Bengal (b. 1271)",
    "William of Ockham, English philosopher (b. 1288)",
    "Blanca de La Cerda y Lara, Spanish noblewoman (b. 1317)",
    "John de Egglescliffe, English bishop",
    "Adam Murimuth, English ecclesiastic and chronicler (b. 1274)",
    "Peter III of Arborea, Judge of Arborea",
    "Lamberto II and Pandolfo da Polenta, brothers and lords of Ravenna and Cervia",
    "Kokan Shiren, Japanese Rinzai Zen patriarch and celebrated Chinese poet (b. 1278)",
    "Sang Nila Utama, Founder and First King of Singapura",
    "See also[edit]",
    "1331"
  ]
}