{
  "events": [
    "January 20 – Edward Balliol surrenders his title as King of Scotland, to Edward III of England.",
    "September 19 – Hundred Years' War – Battle of Poitiers: The English, commanded by Edward, the Black Prince, defeat the French, capturing King John II of France.",
    "October 17 – Erik XII proclaims himself king of Sweden, in opposition to his father, King Magnus IV. Thus begins a civil war in Sweden between father and son, which will last until Erik's death in 1359.",
    "October 18 (St Luke's Day) – The Basel earthquake affects northern Switzerland, with a maximum MSK intensity of IX–X (Destructive–Devastating), leaving around 1,000 dead.",
    "December 25 – Charles IV, Holy Roman Emperor, promulgates the Golden Bull, a constitution for his empire.",
    "The city of Lwów is granted Magdeburg rights by Casimir III of Poland.",
    "The majority of the Great Pyramid of Giza's limestone casing stones are removed by Bahri Sultan An-Nasir Nasir-ad-Din al-Hasan, to build fortresses and mosques in the nearby city of Cairo, leaving the first of the Seven Wonders of the Ancient World in the step-stone condition in which it remains today.",
    "Burnt Candlemas: Edward III of England burns down every town and village in Lothian, Scotland.",
    "The Hanseatic League, a trading alliance between many cities in northern Europe, is officially founded.",
    "Ghazan II replaces Anushirwan, as ruler of the Ilkhanate in Persia.",
    "Zhu Yuanzhang, one of the leaders in the Red Turban Rebellion, captures the city of Nanjing from the Mongol-led Yuan dynasty in China; from then on it becomes his base of power, and the capital of a new dynasty he will establish in 1368, the Ming dynasty.",
    "The Castelvecchio Bridge in Verona is probably completed this year; its main span of 48.7 m (160 ft) is the world's longest arch at this time."
  ],
  "births": [
    "July 29 – Martin of Aragon (d. 1410)",
    "date unknown – Robert IV of Artois, Count of Eu (d. 1387)\nIngegerd Knutsdotter, Swedish abbess (d. 1412)",
    "Ingegerd Knutsdotter, Swedish abbess (d. 1412)"
  ],
  "deaths": [
    "June 23 – Margaret II, Countess of Hainaut (b. 1311)",
    "September 19 (killed at the Battle of Poitiers):\nPeter I, Duke of Bourbon (b. 1311)\nWalter VI, Count of Brienne, Constable of France (b. 1304)",
    "Peter I, Duke of Bourbon (b. 1311)",
    "Walter VI, Count of Brienne, Constable of France (b. 1304)",
    "date unknown\nHarihara I, founder of the Vijayanagara Empire\nZheng Yunduan, Chinese poet (b. c. 1327)",
    "Harihara I, founder of the Vijayanagara Empire",
    "Zheng Yunduan, Chinese poet (b. c. 1327)"
  ]
}