{
  "events": [
    "April 28 – Erik Magnusson is recognized as king of most of Sweden, in opposition to his father, King Magnus.[1]",
    "May 28 – Peter I becomes King of Portugal, after the death of his father, Alfonso IV.[2]",
    "July 9 – Charles Bridge in Prague is founded.[3]",
    "King David II of Scotland is released by the English, in return for a ransom.[4]",
    "Berdibek succeeds Jani Beg, as Khan of the Blue Horde.[5]",
    "Battle of Bubat: The Sundanese royal family is massacred by the Majapahit Army on the orders of Gajah Mada; the death toll includes Sundanese King Lingga Buana and Princess Dyah Pitaloka Citraresmi, who commits suicide.",
    "Rao Kanhadev becomes Rathore ruler of Marwar (now part of India).[6]",
    "Influenza is first identified as a disease.[7]",
    "The first public exhibition of the Shroud of Turin is recorded.[8]",
    "The Blue Horde unseats Ghazan II as the ruler of the Il-Khanate, and appoints their own governor.",
    "The Wat Phra Si Rattana Mahathat (Famous Wat Yai) Temple is constructed in Phitsanulok, Thailand.[9]",
    "In France, the Estates General passes Étienne Marcel's Great Ordinance in an attempt to impose limits on the monarchy, in particular in fiscal and monetary matters.[10]"
  ],
  "births": [
    "April 11 – King John I of Portugal (d. 1433)[11]",
    "date unknown\nArt mac Art MacMurrough-Kavanagh, King of Leinster (d. 1417)\nHugo von Montfort, Austrian minstrel (d. 1423)\nAnna of Trebizond, Queen of Georgia (d. 1406)\nFang Xiaoru, Confucian scholar (d. 1402)\nJe Tsongkhapa, founder of the Geluk school of Tibetan Buddhism (d. 1419)",
    "Art mac Art MacMurrough-Kavanagh, King of Leinster (d. 1417)",
    "Hugo von Montfort, Austrian minstrel (d. 1423)",
    "Anna of Trebizond, Queen of Georgia (d. 1406)",
    "Fang Xiaoru, Confucian scholar (d. 1402)",
    "Je Tsongkhapa, founder of the Geluk school of Tibetan Buddhism (d. 1419)"
  ],
  "deaths": [
    "January 18 – Maria of Portugal, infanta (b. 1313)",
    "May 28 – King Afonso IV of Portugal (b. 1291)[12]",
    "July 13 – Bartolus de Saxoferrato, Italian jurist (b. 1313)",
    "date unknown\nZiauddin Barani, historian and political thinker of the Delhi Sultanate (b. 1285)\nJani Beg, Khan of the Blue Horde\nKazerouni, Masoud, Persian physician\nRao Tida, Rathore ruler of Marwar",
    "Ziauddin Barani, historian and political thinker of the Delhi Sultanate (b. 1285)",
    "Jani Beg, Khan of the Blue Horde",
    "Kazerouni, Masoud, Persian physician",
    "Rao Tida, Rathore ruler of Marwar"
  ]
}