{
  "events": [
    "May 25 – The French States-General repudiates the terms of the Second Treaty of London, signed earlier in the year between England and France.",
    "June 21 – Upon the death of Erik Magnusson, his claims to the Swedish throne die with him, and power is restored undivided to his father, King Magnus.",
    "July 4 – Francesco II Ordelaffi surrenders to the Papal commander, Gil de Albornoz.",
    "December 19 – The Courts of the Principality of Catalonia are held in Cervera, giving birth to the Deputation the General of Catalonia (Diputació del General de Catalunya), also called Generalitat of Catalonia (Generalitat de Catalunya).",
    "Berlin joins the Hanseatic League.",
    "Margarete Maultasch, Countess of Tyrol, and her husband, Louis of Bavaria, are absolved from excommunication.",
    "Abu Salim Ali II overthrows Muhammad II as Said, as ruler of the Merinid Dynasty, in present-day Morocco.",
    "Bogdan I becomes Prince of Moldavia (now Moldova), after freeing it from Hungarian control. He will be ancestor of the House of Bogdan, who will rule Moldavia for more than three centuries.",
    "The Zayanids under Abu Hamuw II recapture Algeria.",
    "Shah Mahmud overthrows his brother, Shah Shuja, as leader of the Muzaffarid tribe in Persia.",
    "Qulpa becomes Khan of the Blue Horde, after the death of Berdi Beg.",
    "Ismail II overthrows his uncle, Muhammed V, as King of Granada (in present-day Spain).",
    "Ananda Patel (considered common ancestor for most of current population of Bhadran) moved to Bhadran from Anklav.",
    "probable date – Battle of Megara: A Christian coalition defeats a Turkish raider fleet."
  ],
  "births": [
    "January 11 – Emperor Go-En'yū of Japan (d. 1393)",
    "July 15 – Antonio Correr, Spanish cardinal (d. 1445)",
    "probable – Owain Glyndŵr, last Welsh Prince of Wales (d. 1416)"
  ],
  "deaths": [
    "June 21 – Erik Magnusson, king of Sweden since 1356 (b. 1339)",
    "October 10 – King Hugh IV of Cyprus (b. 1310)",
    "October 25 – Beatrice of Castile, queen consort of Portugal (b. 1293)",
    "November 13 – Ivan II of Russia, Grand Duke of Moscovy (b. 1326)[1]",
    "December 14 – Cangrande II della Scala, Lord of Verona (b. 1332)",
    "date unknown – Jeanne de Clisson, French noblewoman and privateer (b. 1300)[2]"
  ]
}