{
  "events": [
    "March 13 – Henry II deposes his half-brother, Pedro of Castile, to become King of Castile.",
    "October 12 – Frederick III of Sicily forbids decorations on synagogues.",
    "October 26 – Comet 55P/Tempel–Tuttle passes 0.0229 AU (3,430,000 km; 2,130,000 mi) from Earth.[1]",
    "Thomas Fraser obtains lands in Aberdeenshire, upon which he starts the building of a towerhouse, that will later be known as Muchalls Castle.",
    "Muhammed V builds the Granada Hospital in Granada (in present-day Spain).",
    "War continues between the Hindu Vijayanagar Empire and the Muslim Bahmani Sultanate in present-day southern India. Tens of thousands of civilians are massacred by each side.",
    "Dmitri Donskoi, ruler of Moscow and Vladimir, makes peace with Dmitri Konstantinovich, former ruler of Vladimir.",
    "Abu Faris Abd al-Aziz I of Morocco succeeds assassinated Abu Zayyan, as Sultan of the Marinid Empire in Morocco.",
    "The Den Hoorn brewery is founded at Leuven in the Low Countries. In 1708 this would be renamed the Brouwerij Artois, and later releases a beer named Stella Artois.",
    "The Statutes of Kilkenny are passed in Ireland.",
    "Zhu Yuanzhang, leader of the Red Turban Rebellion that will overthrow the Yuan Dynasty, and establish the Ming Dynasty two years later, begins building the walls for a new capital city at Nanjing."
  ],
  "births": [
    "May 11 – Anne of Bohemia, queen of Richard II of England (d. 1394)[2]",
    "August 28 – Jean Le Maingre, marshal of France (d. 1421)",
    "date unknown\nLady Elizabeth FitzAlan, English noblewoman (d. 1425)\nMiran Shah, governor of Azerbaijan (d. 1408)",
    "Lady Elizabeth FitzAlan, English noblewoman (d. 1425)",
    "Miran Shah, governor of Azerbaijan (d. 1408)",
    "Approximate\nEleanor de Bohun, English noble (d.1399)[3]",
    "Eleanor de Bohun, English noble (d.1399)[3]"
  ],
  "deaths": [
    "January 25 – Henry Suso, German mystic (b. c. 1295)",
    "April 26 – Simon Islip, Archbishop of Canterbury",
    "May 20 – Maria of Calabria, Empress of Constantinople (b. 1329)",
    "Summer – Ming Yuzhen, founder of the rebel empire of Daxia (b. 1331)",
    "October 14 – Ibn Nubata, Arab poet (b. 1287)[4]",
    "October 18 – Petrus Torkilsson, Archbishop of Uppsala"
  ]
}