{
  "events": [
    "April 9 – Timur becomes first Amir of the Timurid Empire, following the Siege of Balkh which establishes his rule over the Chagatai Khanate, completing his conquest of Central Asia and parts of Persia.",
    "May 24 – The Treaty of Stralsund ends the war between Denmark and the Hanseatic League.",
    "September 19 – Hundred Years' War: Siege of Limoges – The English led by Edward the Black Prince retake the city from the French[1] by storm with wide destruction, effectively ending the Limoges enamel industry.",
    "October 20 – Philip of Anjou, Titular Emperor of Constantinople, marries as his second wife Elizabeth of Slavonia (daughter of Stephen of Anjou and Margaret of Bavaria).",
    "November 5 – Casimir III the Great, king of Poland, dies and is succeeded jointly by his sister, Elizabeth of Kujavia, and her son, Louis I of Hungary, beginning the rule of the country by the Capet-Anjou family.",
    "November 15 – Trần Nghệ Tông deposes Dương Nhật Lễ as emperor of Đại Việt, modern-day Vietnam.",
    "December 4 – Hundred Years' War: Battle of Pontvallain – A French army under Bertrand du Guesclin heavily defeats an English force in surprise attacks in north-west France.",
    "December 20 – Pope Gregory XI succeeds Pope Urban V, as the 201st pope.",
    "For the second time since 1368, the Grand Duchy of Moscow attacks Tver, which again counter-attacks, with the aid of the Grand Duchy of Lithuania and the Blue Horde.",
    "Khun Luang Pa-Ngua, ruler of Suphanburi, marches and usurps the throne of the Ayutthaya Kingdom.",
    "The city of Xi'an in Ming dynasty China is given a new defensive city wall.",
    "Hugues Aubriot begins construction of the fortress of the Bastille in Paris.",
    "The steel crossbow is first used as a weapon of war."
  ],
  "births": [
    "April 11 – Frederick I, Elector of Saxony (d. 1428)",
    "July 23 – Pier Paolo Vergerio the Elder, Italian humanist (d. 1444 or 1445)",
    "date unknown\nErasmo of Narni, Italian mercenary (d. 1443)\nGuarino da Verona, Italian humanist (d. 1460)\nJohn VII Palaiologos, Byzantine Emperor (d. 1408)\nKing Olav IV of Norway (d. 1387)\nJan Piast, Duke of Ziebice (d. 1428)\nJan Sindel, Polish scientist (d. 1443)",
    "Erasmo of Narni, Italian mercenary (d. 1443)",
    "Guarino da Verona, Italian humanist (d. 1460)",
    "John VII Palaiologos, Byzantine Emperor (d. 1408)",
    "King Olav IV of Norway (d. 1387)",
    "Jan Piast, Duke of Ziebice (d. 1428)",
    "Jan Sindel, Polish scientist (d. 1443)",
    "probable\nJoan of Navarre, Queen of England, Duchess regent of Brittany (d. 1437)\nJohn Lydgate, English Benedictine monk and poet (d. 1451)\nPaulus Vladimiri, Polish scholar (d. 1435)\nDuke William of Austria (d. 1406)",
    "Joan of Navarre, Queen of England, Duchess regent of Brittany (d. 1437)",
    "John Lydgate, English Benedictine monk and poet (d. 1451)",
    "Paulus Vladimiri, Polish scholar (d. 1435)",
    "Duke William of Austria (d. 1406)"
  ],
  "deaths": [
    "May 31 – St. Vitalis of Assisi, Italian hermit (b. 1295)",
    "c. September 20 – Edward of Angoulême, French-born royal prince of England (b. 1365)",
    "November 5 – Casimir III the Great, King of Poland (b. 1310)",
    "December 19 – Pope Urban V (b. 1310)[2]",
    "date unknown\nSimeon Uroš, Emperor of Serbs and Greeks and half-brother of Stefan Dušan (b. 1326)\nVedanta Desika, Indian Hindu guru and poet (b. 1269)\nYang Weizhen, Chinese painter (b. c. 1296)\nToghon Temür, Emperor Huizong of Yuan dynasty China (b. 1320)",
    "Simeon Uroš, Emperor of Serbs and Greeks and half-brother of Stefan Dušan (b. 1326)",
    "Vedanta Desika, Indian Hindu guru and poet (b. 1269)",
    "Yang Weizhen, Chinese painter (b. c. 1296)",
    "Toghon Temür, Emperor Huizong of Yuan dynasty China (b. 1320)",
    "probable date – Empress Gi of Yuan dynasty China (b. 1315)"
  ]
}