{
  "events": [
    "March 24 – The Treaty of Santarém is signed between Ferdinand I of Portugal and Henry II of Castile, ending the second war between the two countries.",
    "April 28 – Hundred Years' War: The French re-capture most of Brittany from the English, but are unable to take Brest.[1]",
    "May 13 – English anchoress Dame Julian of Norwich receives the sixteen Revelations of Divine Love.",
    "June 16 – The Anglo-Portuguese Treaty is signed in London, and is the oldest active treaty in the world.[2][3]",
    "August – Hundred Years' War: John of Gaunt launches a new invasion of France.[2]",
    "November? – Philip II, Prince of Taranto hands over the rule of Achaea (modern-day southern Greece) to his cousin, Joanna I of Naples.",
    "Louis I of Hungary takes Severin again, but the Vlachs will recover it in 1376–1377.",
    "Byzantine co-emperor Andronikos IV Palaiologos rebels against his father, John V Palaiologos, for agreeing to let Constantinople become a vassal of the Ottoman Empire. After the rebellion fails, Ottoman Emperor Murad I commands John V Palaiologos to blind his son.",
    "Assassination of Constantine IV, ruler of the Armenian Kingdom of Cilicia (modern-day southern Turkey); he will be succeeded by his distant cousin Leo V.",
    "The death of Sultan Muhammad III ibn Abd al-Aziz begins a period of political instability in Morocco.",
    "The city of Phnom Penh (modern-day capital city of Cambodia) is founded.",
    "Bristol is made a county corporate, the first town in the Kingdom of England outside London to be granted this status.",
    "A city wall is built around Lisbon, Portugal to resist invasion by Castile.",
    "Merton College Library is built in Oxford, England.",
    "The Adina Mosque is built in Bengal.",
    "The Chinese emperor of the Ming dynasty, the Hongwu Emperor, suspends the traditional civil service examination system after complaining that the 120 new jinshi degree-holders are too incompetent to hold office; he instead relies solely upon a system of recommendations, until the civil service exams are reinstated in 1384."
  ],
  "births": [
    "March 29 – Marie d'Alençon, French princess (d. 1417)",
    "June 25 – Queen Joanna II of Naples (d. 1435)",
    "September 22 – Thomas le Despenser, 1st Earl of Gloucester (d. 1400)",
    "date unknown\nEdward of Norwich, 2nd Duke of York (d. 1415)\nMargery Kempe, writer of the first autobiography in English",
    "Edward of Norwich, 2nd Duke of York (d. 1415)",
    "Margery Kempe, writer of the first autobiography in English"
  ],
  "deaths": [
    "January 16 – Humphrey de Bohun, 7th Earl of Hereford (b. 1342)",
    "February – Ibn Kathir, Mamluk Islamic scholar (b. 1301)",
    "July 23 – Saint Birgitta, Swedish saint (b. 1303)",
    "November 3 – Jeanne de Valois, Queen of Navarre (b. 1343)",
    "December 7 – Rafał of Tarnów, Polish nobleman (b. c. 1330)",
    "date unknown\nConstantine IV, King of Armenia (assassinated)\nRobert le Coq, French bishop and councillor\nTiphaine Raguenel, Breton astrologer (b. c. 1335)",
    "Constantine IV, King of Armenia (assassinated)",
    "Robert le Coq, French bishop and councillor",
    "Tiphaine Raguenel, Breton astrologer (b. c. 1335)"
  ]
}