{
  "events": [
    "February 28 – Richard II of England grants Geoffrey Chaucer 20 pounds a year for life, for his services as a diplomat and Clerk of The King's Works.[1]",
    "June 11 – The Venetians take over possession of Argos, from Despot Theodore I Palaiologos.[2]",
    "September 17 – King Charles VI of France orders the expulsion of all Jews from France.[3]",
    "September 28 – Antipope Benedict XIII is elected to succeed Antipope Clement VII.[4]",
    "October 10 – Battle of Karanovasa: Wallachia (now southern Romania) resists an invasion by the Ottomans, and their Serb and Bulgarian vassals.[5]",
    "November 29 – The capital city of the Joseon Dynasty (in present-day Korea) is moved from Gaegyeong (now Gaeseong) to Hanseong (now Seoul).",
    "The Ottomans conquer Thessaly (now eastern Greece) and begin an eight-year siege of Constantinople, in the Byzantine Empire. In the same year, they begin building the Anadoluhisarı fortress to defend themselves during the siege.[6]",
    "Ashikaga Yoshimitsu retires as shōgun of Japan, and is succeeded by his son, Ashikaga Yoshimochi.",
    "Gyeongbokgung Palace and the Jongmyo royal ancestral shrine are built in Hanseong (now Seoul).",
    "After the death of Sultan Mahmud II, civil war breaks out in the Delhi Sultanate, splitting the state between east and west.",
    "Battle of Ros-Mhic-Thriúin: The Kingdom of Leinster, led by King Art mac Art MacMurrough-Kavanagh, defeats an invading army from England, led by King Richard II of England and Roger Mortimer, 4th Earl of March.",
    "Ştefan I succeeds Roman I, as Prince of Moldavia (now Moldova and eastern Romania).",
    "Abu Zayyan II succeeds his brother, Abul Hadjdjadj I, as ruler of the Abdalwadid Dynasty in present-day eastern Algeria.[7]",
    "Abd al-Aziz II succeeds Abu al-Abbas Ahmad II, as ruler of the Hafsid Dynasty in present-day Tunisia.[8]",
    "The Allgäuer Brauhaus brewery is founded in present-day Germany.[9]",
    "The Hongwu Emperor of the Ming dynasty in China orders the Ministry of Public Works to issue a public notice, that every 100 households in the lijia system are to set aside 2 mu (1,390 m2) of land, for planting mulberry and jujube trees."
  ],
  "births": [
    "March 4 – Prince Henry the Navigator, Portuguese patron of exploration (d. 1460)[10]",
    "June 4 – Philippa of England, Queen of Denmark, Norway and Sweden (d. 1430)[11]",
    "July 12 – Ashikaga Yoshinori, Japanese shōgun (d. 1441)",
    "July 25 – James I of Scotland (d. 1437)[12]",
    "November 24 – Charles, Duke of Orléans, French poet (d. 1465)[13]",
    "date unknown\nUlugh Beg, Timurid ruler and astronomer (d. 1449)\nIkkyū, Japanese Zen Buddhist priest and poet (d. 1481)\nMichael de la Pole, 3rd Earl of Suffolk (d. 1415)[14]",
    "Ulugh Beg, Timurid ruler and astronomer (d. 1449)",
    "Ikkyū, Japanese Zen Buddhist priest and poet (d. 1481)",
    "Michael de la Pole, 3rd Earl of Suffolk (d. 1415)[14]",
    "probable – Cymburgis of Masovia, Duchess of Austria"
  ],
  "deaths": [
    "June 25 – Dorothea of Montau, German hermitess (b. 1347)[15]",
    "March 17 – Louis, Count of Enghien, Count of Conversano and Brienne",
    "March 24 – Constance of Castile, claimant to the throne of Castile",
    "June 4 – Mary de Bohun, English countess, married to Henry IV of England[16]",
    "June 7 – Anne of Bohemia, queen of Richard II of England (plague) (b. 1366)[17]",
    "August 27 – Emperor Chōkei of Japan (b. 1343)",
    "September 16 – Antipope Clement VII (b. 1342)[18]",
    "December 28 – Maria Angelina Doukaina Palaiologina, basilissa of Epirus (b. 1350)",
    "date unknown\nJohn Hawkwood, English mercenary (b. 1320)\nFazlallah Astarabadi, Persian founder of the mystical Hurufism sect (executed)\nSultan Mahmud II of the Delhi Sultanate\nFormer King Gongyang of Goryeo (b. 1345)",
    "John Hawkwood, English mercenary (b. 1320)",
    "Fazlallah Astarabadi, Persian founder of the mystical Hurufism sect (executed)",
    "Sultan Mahmud II of the Delhi Sultanate",
    "Former King Gongyang of Goryeo (b. 1345)"
  ]
}