{
  "events": [
    "January 19 – Hundred Years' War: Rouen surrenders to Henry V of England, which brings Normandy under the control of England.",
    "June 20 – The Ōei Invasion of Tsushima Island, Japan by Joseon Korea begins.",
    "July 30 – The first Defenestration of Prague occurs in Bohemia.",
    "August – Siege of Ceuta: The Portuguese successfully defend off the invading Moroccans who attempt to retake the city of Ceuta.",
    "September 10 – John the Fearless, Duke of Burgundy is assassinated by adherents of the Dauphin.",
    "November – The Ottoman–Venetian peace treaty ends four years of conflict, by recognizing Venetian possessions in the Aegean and the Balkans.",
    "December 22 – Ceará wins its 6th Campeonato Cearense in a row against the Tapeba's Team. Reinaldo Aleluia scored twice on the final game.",
    "Portuguese sea captains João Gonçalves Zarco and Tristão Vaz Teixeira, at the service of Prince Henry the Navigator, discover the Madeira Islands.",
    "The University of Rostock is established as the oldest university of northern Europe.",
    "The Timurid ruler of Persia, Mirza Shahrukh (r. 1404–1447), sends a large embassy to the court of the Yongle Emperor of China. One of the Persian envoys, Ghiyāth al-dīn Naqqāsh, keeps a diary of his travels throughout China, which soon becomes widely known throughout Iranian and the Turkic Middle East, thanks to its inclusion into historical works by Hafiz-i Abru, and Abdur Razzaq. Naqqash writes about China's wealthy economy and huge urban markets, its efficient courier system as compared to that in Persia, the hospitality of his hosts at the courier stations in providing comfortable lodging and food, and the fine luxurious goods and craftsmanship of the Chinese.",
    "Mihail I defends Wallachia against the Ottomans, with Hungarian help."
  ],
  "births": [
    "February – Abu 'Amr 'Uthman,  Hafsid caliph of Ifriqiya (d. 1488)",
    "February 16 – John I, Duke of Cleves (d. 1481)",
    "March 24 – Ginevra d'Este (d. 1440)",
    "June 24 – John of Sahagún, Spanish Augustinian friar, priest and saint (d. 1479)",
    "July 10 – Emperor Go-Hanazono of Japan (d. 1471)",
    "November 1 – Albert II, Duke of Brunswick-Grubenhagen (d. 1485)",
    "date unknown\nAbd al-Haqq II, last Marinid Sultan of Morocco (d. 1465)\nBarbara Fugger, German banker (d. 1497)",
    "Abd al-Haqq II, last Marinid Sultan of Morocco (d. 1465)",
    "Barbara Fugger, German banker (d. 1497)"
  ],
  "deaths": [
    "April 5 – Vincent Ferrer, Spanish missionary and saint (b. 1350)",
    "August 16 – Wenceslaus, King of the Romans, King of Bohemia (b. 1361)",
    "September 10 – John the Fearless, Duke of Burgundy (assassinated) (b. 1371)",
    "December 17 – William Gascoigne, Chief Justice of England",
    "December 22 – Antipope John XXIII",
    "date unknown\nJe Tsongkhapa, founder of the Geluk school of Tibetan Buddhism (b. 1357)\nStella de’ Tolomei, Italian courtier",
    "Je Tsongkhapa, founder of the Geluk school of Tibetan Buddhism (b. 1357)",
    "Stella de’ Tolomei, Italian courtier"
  ]
}