{
  "events": [
    "March – The Çelebi Sultan Mehmed Mosque in Didymoteicho is inaugurated.",
    "May 21 – Treaty of Troyes:  With the Burgundian faction dominant in France, King Charles VI of France acknowledges Henry V of England as his heir, and as virtual ruler of most of France.[1]",
    "May 25 –  Henry the Navigator is appointed governor of the Portuguese Order of Christ.",
    "June 2 – Catherine of Valois marries King Henry V of England.[2]",
    "June 7 – Troops of the Republic of Venice capture Udine after a long siege, ending the independence of the Patriarchal State of Friuli, run by the Patriarch of Aquileia.",
    "August 7 – Construction of the dome of Florence Cathedral is started, after Filippo Brunelleschi wins the commission for his \"double shell\" design.",
    "September 1 – a 9.4 MS-strong earthquake shakes Chile's Atacama Region causing tsunamis in Chile as well as Hawaii and Japan.[3][4]",
    "October 22 – Ghiyāth al-dīn Naqqāsh, an envoy of the embassy sent by the Timurid ruler of Persia, Mirza Shahrukh (r. 1404–1447), to the Ming Dynasty of China during the reign of the Yongle Emperor (r. 1402–1424), records his sight and travel over a large floating pontoon bridge at Lanzhou (constructed earlier in 1372) as he crosses the Yellow River on this day. He writes that it was: \"...composed of twenty three boats, of great excellence and strength attached together by a long chain of iron as thick as a man's thigh, and this was moored on each side to an iron post as thick as a man's waist extending a distance of ten cubits on the land and planted firmly in the ground, the boats being fastened to this chain by means of big hooks. There were placed big wooden planks over the boats so firmly and evenly that all the animals were made to pass over it without difficulty.\"",
    "October 28 – Beijing is officially designated the capital of the Ming Dynasty, during the same year that the Forbidden City, the seat of government, is completed.",
    "November 1 – Hussite Wars – Battle of Vyšehrad: Sigismund, Holy Roman Emperor, fails and is ejected from Bohemia.",
    "Henry V of England commences construction of the ship Grace Dieu.",
    "Tang Saier starts a rebellion against the emperor of China, and takes two cities with her rebel army, before she is defeated.[5]",
    "Construction begins on the Temple of Heaven in Beijing, China, while the palace complex of the Forbidden City is completed. In this year the Yongle Emperor confers the title \"Beijing\" (\"Northern Capital\") for the Ming Dynasty's new capital city, replacing Nanjing.",
    "Radu II Praznaglava, supported by the Ottomans, and Dan II, with Hungarian help, start a seven-years-long struggle for the throne of Wallachia, after Mihail I is killed in a battle. The throne of Wallachia will switch from one to another about four times until 1427, when Radu II dies.",
    "Alexandru cel Bun defends Moldavia against the first incursion by the Ottomans, at Cetatea Albă."
  ],
  "births": [
    "February 9 – Dorothea of Brandenburg, Duchess of Mecklenburg (d. 1491)",
    "April 23 – George of Poděbrady, King of Bohemia (d. 1471)[6]",
    "June 5 – Anna of Saxony, Landgravine of Hesse, German royalty (d. 1462)[7]",
    "July 19 – William VIII, Marquess of Montferrat (d. 1483)[8]",
    "October 1 – Elisabeth of Cleves, Countess of Schwarzburg-Blankenburg, German noble (d. 1488)",
    "date unknown\nJean Fouquet, French painter (d. 1481)\nNicolas Jenson, French engraver (d. 1480)\nAntoinette de Maignelais, mistress of Charles VII of France (d. 1474)\nTomás de Torquemada, first grand inquisitor of Spain (d. 1490)[9]",
    "Jean Fouquet, French painter (d. 1481)",
    "Nicolas Jenson, French engraver (d. 1480)",
    "Antoinette de Maignelais, mistress of Charles VII of France (d. 1474)",
    "Tomás de Torquemada, first grand inquisitor of Spain (d. 1490)[9]"
  ],
  "deaths": [
    "June 11 – John III, Burgrave of Nuremberg (b. c. 1369)",
    "August – Mihail I, ruler of Wallachia (killed in battle)",
    "August 9 – Pierre d'Ailly, French theologian and cardinal (b. 1351)",
    "September 3 – Robert Stewart, Duke of Albany, regent of Scotland",
    "date unknown\nAndrew of Wyntoun, Scottish chronicler (b. 1350)[10]\nMarina Galina, Dogaressa of Venice\nEpiphanius the Wise, Russian saint[11]\nKing Lukeni lua Nimi of the Kingdom of Kongo (b. 1380)",
    "Andrew of Wyntoun, Scottish chronicler (b. 1350)[10]",
    "Marina Galina, Dogaressa of Venice",
    "Epiphanius the Wise, Russian saint[11]",
    "King Lukeni lua Nimi of the Kingdom of Kongo (b. 1380)"
  ]
}