{
  "events": [
    "April 27 – Hussite Wars – Battle of Hořice: The Taborites decisively beat the Utraquists.[1]",
    "May 21–22 – Byzantine–Ottoman Wars: The Ottoman governor of Thessaly, Turakhan Beg, breaks through the Hexamilion wall, and ravages the Peloponnese Peninsula.[2]",
    "July 31 – Hundred Years' War – Battle of Cravant: The French army is defeated at Cravant, on the banks of the River Yonne near Auxerre, by the English and their Burgundian allies.",
    "August – The Treaty of Sveti Srdj ends the Second Scutari War, waged between the Serbian Despotate and the Venetian Republic, over Scutari, and other former possessions of Zeta, captured by the Venetians.[3]",
    "The three independent boroughs of Pamplona are united into a single town by royal decree, after centuries of feuds.",
    "Dan II of Wallachia, with Hungarian help, wins two battles against the Ottomans."
  ],
  "births": [
    "April 4 – Johann II of Nassau-Saarbrücken, Count of Nassau-Saarbrücken (1429–1472) (d. 1472)",
    "May 18 – Lady Katherine Percy, English nobility (d. 1475)",
    "May 30 – Georg von Peuerbach, Austrian astronomer (d. 1461)",
    "June 2 – Ferdinand I of Naples (d. 1494)",
    "June 15 – Gabriele Sforza, Archbishop of Milan (d. 1457)",
    "July 3 – Louis XI of France, monarch of the House of Valois, King of France from 1461 to 1483 (d. 1483)[4]",
    "July 6 – Antonio Manetti, Italian mathematician and architect (d. 1497)",
    "August 24 – Thomas Rotherham, English cleric (d. 1500)",
    "September 10 – Eleanor, Princess of Asturias (d. 1425)",
    "August – Demetrios Chalkokondyles, Greek scholar (d. 1511)"
  ],
  "deaths": [
    "January 23 – Margaret of Bavaria, Burgundian regent (b. 1363)",
    "March – Richard Whittington, Lord Mayor of London (b. 1358)",
    "May 23 – Antipope Benedict XIII (b. 1328)[5]",
    "October 20 – Henry Bowet, Archbishop of York",
    "November 1 – Nicholas Eudaimonoioannes, Byzantine diplomat",
    "December 15 – Michael Küchmeister von Sternberg, Grand Master of the Teutonic Knights"
  ]
}