{
  "events": [
    "January 9 – Pretrial investigations for Joan of Arc begin at Rouen in France, which is under English occupation.",
    "February 21 – The trial of Joan of Arc for heresy begins.",
    "March – Alexander I Aldea takes the throne of Wallachia with support from Alexander I of Moldavia.",
    "March 3 – Pope Eugene IV succeeds Pope Martin V, to become the 207th pope.",
    "May 30 – Nineteen-year-old Joan of Arc is burned at the stake in Rouen.",
    "June 16 – The Teutonic Knights and Švitrigaila sign the Treaty of Christmemel, creating an anti-Polish alliance.",
    "September – Battle of Inverlochy: Donald Balloch defeats the Royalists.",
    "October 30 – The Treaty of Medina del Campo is signed, consolidating peace between Portugal and Castille.",
    "November 9 – The Battle of Ilava: The Hungarians defeat the Hussite army.",
    "November 18 – A treaty in Suceava concludes an attack on Poland, launched this year by Alexander I of Moldavia during the Lithuanian Civil War.",
    "December 13 – Vlad, future Prince of Wallachia as Vlad II Dracul, is made a member of the Order of the Dragon. Because of this, his son Vlad III the Impaler will inspire the literary figure named Dracula.",
    "December 16 – Henry VI of England is crowned King of France at Notre-Dame de Paris.",
    "The University of Poitiers is founded.",
    "The Ayutthaya Kingdom besieges Angkor and sacks the Khmer capital, ending the Khmer Empire.",
    "Nezahualcoyotl is crowned Tlatoani of the Kingdom of Texcoco.",
    "Byzantine–Ottoman Wars: The Ottoman governor of Thessaly Turahan Bey breaks through the Hexamilion wall for the second time, and ravages the Peloponnese Peninsula.[1]"
  ],
  "births": [
    "January 1 – Pope Alexander VI (d. 1503)[2]",
    "October 26 – Ercole I d'Este, Duke of Ferrara, Italian politician (d. 1505)",
    "November or December – Vlad III the Impaler, Prince of Wallachia (d. 1476)",
    "date unknown\nWilliam Elphinstone, Scottish statesman (d. 1514)\nHelena Palaiologina, Despotess of Serbia (d. 1473)\nLadislaus Hunyadi, Hungarian statesman and warrior (d. 1457)",
    "William Elphinstone, Scottish statesman (d. 1514)",
    "Helena Palaiologina, Despotess of Serbia (d. 1473)",
    "Ladislaus Hunyadi, Hungarian statesman and warrior (d. 1457)",
    "probable\nWilliam Hastings, 1st Baron Hastings (d. 1483)\nJohn Neville, 1st Marquess of Montagu, English politician (d. 1471)\nFrançois Villon, French poet\nVlad III, Prince of Wallachia, A member of the House of Drăculești, as well as the Voivode of Wallachia 1456-1462",
    "William Hastings, 1st Baron Hastings (d. 1483)",
    "John Neville, 1st Marquess of Montagu, English politician (d. 1471)",
    "François Villon, French poet",
    "Vlad III, Prince of Wallachia, A member of the House of Drăculești, as well as the Voivode of Wallachia 1456-1462"
  ],
  "deaths": [
    "January 25 – Charles II, Duke of Lorraine (b. 1364)",
    "February 20 – Pope Martin V (b. 1368)[3]",
    "April 1 – Nuno Álvares Pereira, Portuguese general and religious figure",
    "April 5 – Bernard I, Margrave of Baden-Baden (b. 1364)",
    "April 19 – Adolph III, Count of Waldeck (b. 1362)",
    "May 30 – Joan of Arc, French soldier and saint (b. c. 1412)",
    "September 6 – Demetrios Laskaris Leontares, Byzantine soldier and statesman",
    "December 8 – Hedwig Jagiellon, Polish and Lithuanian princess (b. 1408)",
    "date unknown\nMakhdoom Ali Mahimi, Indian Sufi mystic\nStanisław of Skarbimierz, Polish theologian (b. 1360)\nViolant of Bar, queen regent of Aragon (b. 1365)[4]",
    "Makhdoom Ali Mahimi, Indian Sufi mystic",
    "Stanisław of Skarbimierz, Polish theologian (b. 1360)",
    "Violant of Bar, queen regent of Aragon (b. 1365)[4]"
  ]
}