{
  "events": [
    "May 31 – Sigismund is crowned Holy Roman Emperor in Rome.[1] There has been no crowned Emperor since the death of his father, Charles IV, in 1378.",
    "August 14 – Edward I becomes King of Portugal.[2]",
    "September – Cosimo de' Medici, later the de facto ruler of Florence and patron of Marsilio Ficino, is exiled by the Albizzi/Strozzi faction (Cosimo returns a year later, in September 1434).[3]",
    "October – Iliaș of Moldavia is deposed by his half-brother and joint ruler Stephen II.[4]",
    "The Ming Dynasty in China completes its last great maritime expedition, led by Admiral Zheng He;[5] the fleet would be dispersed, altering the balance of power in the Indian Ocean, and making it easier for Portugal and other Western naval powers to gain dominance over the seas.",
    "In Ming Dynasty China, cotton is listed as a permanent item of trade, on the tax registers of Songjiang prefecture.[6]",
    "Kalantiaw (of what would later be known as the Philippines) supposedly promulgates the legal code eventually referred to as the Code of Kalantiaw. Modern historians doubt its existence.[7]"
  ],
  "births": [
    "August 31 – Sigismondo d'Este, Italian nobleman (d. 1507)",
    "September 17 – James of Portugal, Portuguese cardinal (d. 1459)[8]",
    "September 24 – Shekha of Amarsar, Rajput chieftain (d. 1488)",
    "September 27 – Stanisław Kazimierczyk, Polish canon regular and saint (d. 1489)[9]",
    "October 19 – Marsilio Ficino, Florentine philosopher (d. 1499)[10]",
    "November 10\nCharles the Bold, Duke of Burgundy (d. 1477)[11]\nJeanne de Laval, French noble, queen consort of Naples (d. 1498)[12]",
    "Charles the Bold, Duke of Burgundy (d. 1477)[11]",
    "Jeanne de Laval, French noble, queen consort of Naples (d. 1498)[12]",
    "date unknown\nStephen III of Moldavia, prince from 1457 (d. 1504)[13]\nGiovanni Giocondo, Veronese-born friar, architect and classical scholar (d. 1515)[14]",
    "Stephen III of Moldavia, prince from 1457 (d. 1504)[13]",
    "Giovanni Giocondo, Veronese-born friar, architect and classical scholar (d. 1515)[14]",
    "probable – Kettil Karlsson, regent of Sweden from 1464 (d. 1465)"
  ],
  "deaths": [
    "April 14 – Lidwina, Dutch saint (b. 1380)[15]",
    "August 14 – King John I of Portugal (b. 1357)[16]",
    "August 30 – Peter I, Count of Saint-Pol (b. 1390)[17]",
    "September – Zweder van Culemborg, Bishop of Utrecht (birth year unknown)[18]",
    "September 28 – Přemek I, Duke of Opava (b. c.1365)[19]",
    "December 1 – Emperor Go-Komatsu, the 100th emperor of Japan (b. 1377)[citation needed]"
  ]
}