{
  "events": [
    "April 14 – The foundation stone of Nantes Cathedral in Nantes, France, is laid.[1]",
    "May 30 – Hussite Wars – Battle of Lipany: The Catholics and Ultraquists defeat the Taborites, ending the Hussite Wars.[2]",
    "June 19 or 20 – Zara Yaqob becomes Emperor of Ethiopia.[3]",
    "Late June – Miner Engelbrekt Engelbrektsson begins a Swedish rebellion against King Eric of Pomerania (named the Engelbrekt rebellion after him), eventually leading to the deposition of the king.",
    "July 10–August 9 – Suero de Quiñones and his companions stage the Passo Honroso, at the Órbigo in León.",
    "August 16 – King Eric of Pomerania is deposed from the Swedish throne at a meeting in Vadstena. He still retains power in Denmark and Norway, though.",
    "September – Cosimo de' Medici returns to Florence, one year after being exiled by the Albizzi and Strozzi faction.[4]",
    "October 21 – The University of Catania is founded in Italy.[5]",
    "Jan van Eyck paints the Arnolfini Portrait.[6]",
    "Explorer Gil Eanes rounds Cape Bojador in Western Sahara, thus destroying the legends of the \"Dark Sea\".",
    "Portuguese traders deliver their first cargo of African slaves to Lisbon.",
    "In Ming Dynasty China, a long episode of drought, flood, locust infestation, and famine cripple agriculture and commerce in areas throughout the country, until 1448.",
    "The Puke Feud occurs in Sweden."
  ],
  "births": [
    "January 7 – Adolf, Duke of Bavaria (d. 1441)",
    "March 12 – William III, Count of Henneberg-Schleusingen (d. 1480)",
    "March 19 – Ashikaga Yoshikatsu, Japanese shōgun (d. 1443)",
    "March 25 – Eustochia Smeralda Calafato, Italian saint (d. 1485)",
    "June 13 – Cristoforo della Rovere, Roman Catholic cardinal (d. 1478)",
    "September 18 – Eleanor of Portugal, Holy Roman Empress (d. 1467)[7]",
    "September 23 – Yolande of Valois, Duchess consort of Savoy (d. 1478)",
    "December 28 – Antonio Grimani, Italian admiral (d. 1523)",
    "probable\nIsabella of Bourbon, Burgundian countess, spouse of Charles the Bold (d. 1465)\nMatteo Maria Boiardo, Italian poet (d. 1494)\nKano Masanobu, Japanese painter (d. 1530)",
    "Isabella of Bourbon, Burgundian countess, spouse of Charles the Bold (d. 1465)",
    "Matteo Maria Boiardo, Italian poet (d. 1494)",
    "Kano Masanobu, Japanese painter (d. 1530)"
  ],
  "deaths": [
    "January – John I, Duke of Bourbon (b. 1381)[8]",
    "April 20 – Alexandra of Lithuania, Duchess of Masovia",
    "May 30 –  Prokop the Great, Hussite general (b. 1380)",
    "June –  Amda Iyasus, Emperor of Ethiopia[9]",
    "June 1 – King Wladislaus II of Poland (age unknown)[10]",
    "June 5  – Yuri IV, Russian grand prince (b. 1374)",
    "November 12 – King Louis III of Anjou (b. 1403)"
  ]
}