{
  "events": [
    "February – The Republic of Venice annexes the seigniory of Ravenna, ending the da Polenta Dynasty.",
    "February 12 – King's College, Cambridge, is founded by King Henry VI of England.[1]",
    "March 1 – Battle of Samobor: The army of Ulrich II, Count of Celje, defeats the army of Stjepan Banić at Samobor, Croatia in union with Hungary.",
    "November 10 – Alfonso V of Aragon lays siege to Naples.",
    "November 20 – The Peace of Cremona (1441) ends the war between the Republic of Venice and the Duchy of Milan.[2]",
    "Ouagadougou becomes the capital of the Mossi Kingdoms.",
    "Two subjects of the Ethiopian Empire attend a Christian ecclesiastical council at Florence as part of negotiations concerning a possible union of Coptic Orthodoxy and the Latin Church. This is the earliest recorded contact of the Ethiopian branch of the Coptic Church with Europe.",
    "A revolt occurs in the Mayan nation of Mayapan; the Maya civilization splits into warring city-states.",
    "With the help of the Grand Duchy of Lithuania, governor Hacı I Giray declares his province independent of the Golden Horde and establishes the Crimean Khanate.",
    "Nuno Tristão reaches the Ras Nouadhibou (Cabo Branco) on the western coast of Africa. This is probably the first voyage where a caravel is used for maritime exploration.",
    "The first enslaved black Africans are brought to Europe at Lagos in Kingdom of Portugal."
  ],
  "births": [
    "February 9 – Ali-Shir Nava'i, Central Asian poet, politician and writer (d. 1501)",
    "March 24 – Ernest, Elector of Saxony, German ruler of Saxony (d. 1486)",
    "June 25 – Federico I Gonzaga, Marquess of Mantua (1478–1484) (d. 1484)",
    "June 27 – John III, Count of Nassau-Weilburg, German nobleman (d. 1480)",
    "July 23 – Danjong of Joseon, King of Joseon (d. 1457)",
    "November 11 – Charlotte of Savoy, French queen (d. 1483)"
  ],
  "deaths": [
    "March 8 – Margaret of Burgundy, Duchess of Bavaria",
    "April 1 – Blanche I of Navarre, Queen of Navarre (1425–1441) and Regent of Sicily (1404–1405 and 1408–1415)",
    "June 14 – Corrado IV Trinci, former lord of Foligno",
    "July 9 – Jan van Eyck, Dutch painter[3]",
    "July 12 – Kyōgoku Takakazu, Japanese noble and vassal of Ashikaga Yoshinori",
    "July 12 – Ashikaga Yoshinori, Japanese shōgun (b. 1394)",
    "September 25 – Akamatsu Mitsusuke, Japanese samurai",
    "October 24 – Adolf, Duke of Bavaria (b. 1434)",
    "October 27 – Margery Jourdemayne, Englishwoman executed for treasonable witchcraft",
    "November 18 – Roger Bolingbroke, English cleric, astronomer, astrologer, magister and alleged necromancer[4]",
    "December 26 – Niccolò III d'Este, Marquis of Ferrara (b. 1383)"
  ]
}