{
  "events": [
    "March 2 – The League of Lezhë, an alliance of Albanian principalities, is established in Lezhë; George Kastrioti Skanderbeg is proclaimed commander of the Albanian resistance.",
    "May 22 – The Treaty of Tours, signed between England and France, secures a truce in the Hundred Years' War for five years.",
    "June 15 – Cosimo de' Medici founds the Laurentian Library in Florence.",
    "June 29 – Battle of Torvioll: Skanderbeg defeats an Ottoman army.",
    "August 6 – A Portuguese fleet of caravels, led by Lançarote de Freitas, lands 235 slaves at Algarve, Portugal.[1]",
    "August 15 – The Peace of Szeged is signed between the Turkish Ottoman Empire and Hungary.",
    "August 26 – Old Zürich War – Battle of St. Jakob an der Birs: Charles VII of France, seeking to send away troublesome troops made idle by the truce with England, sends his son (the Dauphin Louis) with a large army into Switzerland, to support the claims of Frederick III, Holy Roman Emperor. The massively outnumbered Swiss force is destroyed in this battle, but inflict such casualties on the French that they withdraw.",
    "August – After making peace with the Karamanids, Ottoman Sultan Murad II abdicates in favor of his son Mehmed II.",
    "November 10 – Battle of Varna: The crusading forces of King Władysław III of Poland and Hungary are defeated by the Turks, under Sultan Murad II. Władysław is killed, ending the Jagiellonian Union of Hungary and Poland.",
    "Constantine XI Palaiologos, as ruler of the Despotate of the Morea, invades the Duchy of Athens (at this time under Florentine control), and forces it to pay tribute and return Thebes to the Byzantine Empire.",
    "Forces of the Sultan of Egypt fail to take Rhodes from the Knights of Rhodes.",
    "Portuguese explorers reach the mouth of the rivers Senegal and Gambia.",
    "The first European slave market for the sale of African slaves, the Mercado de Escravos, opens in Lagos, Portugal.",
    "A serious fire occurs at Old St Paul's Cathedral in London.",
    "The Iguvine Tablets are discovered at Gubbio, Italy.",
    "Stephen II of Moldavia takes as co-ruler his step brother Petru, also brother-in-law to John Hunyadi."
  ],
  "births": [
    "January 24 – Galeazzo Maria Sforza, Duke of Milan (d. 1476)",
    "March 15 – Francesco Gonzaga, Catholic cardinal (d. 1483)",
    "April 22 – Elizabeth of York, Duchess of Suffolk (d. 1503)",
    "May 29 – Otto III, Duke of Pomerania-Stettin (1460–1464) (d. 1464)",
    "June 14 – Nilakantha Somayaji, Indian astronomer-mathematician (d. 1544)",
    "June 28 – Charlotte, Queen of Cyprus (d. 1487)",
    "October 18 – John de Mowbray, 4th Duke of Norfolk (d. 1476)",
    "date unknown – Donato Bramante, Italian architect (d. 1514)[2]"
  ],
  "deaths": [
    "January 8 – Wilhelm II, Count of Henneberg-Schleusingen (b. 1415)",
    "February 14 – Henriette, Countess of Montbéliard, regent of Württemberg (b. 1387)",
    "March 9 – Leonardo Bruni, Italian humanist (b. 1374)",
    "April 26 – Robert Campin, Flemish painter (b. 1378)",
    "May 20 – Saint Bernardino of Siena, Italian Franciscan missionary (b. 1380)",
    "May 27 – John Beaufort, 1st Duke of Somerset, English military leader (b. 1404)[3]",
    "October 15 – Niccolò Piccinino, Italian mercenary (b. 1386)[4]",
    "November 10 – King Władysław III of Poland (in battle) (b. 1424)[5]",
    "November 25 – Martin Gouge, French chancellor",
    "date unknown – Pier Paolo Vergerio the Elder, Italian humanist, statesman, and canon lawyer"
  ]
}