{
  "events": [
    "September 27 – Battle of Otonetë: Skanderbeg defeats the Ottomans.[1]",
    "Before October – Sultan Mehmed II of the Ottoman Empire is forced to abdicate, in favor of his father Murad II, by the Janissaries.",
    "October 9 – The hangul alphabet is created in Korea, by King Sejong the Great of Joseon. The Hunmin Jeongeum, published during the year, is considered the start of this brand new scientific writing system. [2]",
    "October – Murad II invades Attica, forcing Constantine XI to return Thebes to the duchy of Athens, and remove the tribute imposed in 1444. Murad II imposes his own tribute.",
    "December 10 – After hesitating for several weeks, Sultan Murad II of the Ottoman Empire, destroys the Hexamilion wall, in an assault that includes cannons. Murad and the Ottoman governor of Thessaly, Turakhan Beg, ravage the Peloponnese Peninsula at will, with the Sultan devastating the northern shore, while Glarentza and Turakhan raid in the interior. The Despotate of the Morea is turned into an Ottoman vassal state.[3]",
    "Nuno Tristão is killed by natives in the coast of Senegal.",
    "Portuguese navigator Álvaro Fernandes reaches the mouth of the Casamance River in Senegal.",
    "The Precious Belt Bridge in China is fully reconstructed.",
    "In Italy, the siege of Cremona, by the condottieri troops of Francesco Piccinino and Luigi dal Verme, is raised after the arrival of Scaramuccia da Forlì.",
    "The Blarney Stone is set into a tower of Blarney Castle in Blarney, County Cork in Ireland."
  ],
  "births": [
    "April 18 – Ippolita Maria Sforza, Italian noble (d. 1484)",
    "May 3\nFrederick I of Liegnitz, Duke of Chojnów and Strzelin from 1453 (d. 1488)\nMargaret of York, duchess consort of Burgundy by marriage to Charles the Bold (d. 1503)[4]",
    "Frederick I of Liegnitz, Duke of Chojnów and Strzelin from 1453 (d. 1488)",
    "Margaret of York, duchess consort of Burgundy by marriage to Charles the Bold (d. 1503)[4]",
    "August 14 – Andrey Bolshoy, Russian royal (d. 1493)",
    "December 26 – Charles de Valois, Duke de Berry, French noble (d. 1472)",
    "date unknown – Edmund de Ros, 10th Baron de Ros, English politician (d. 1508)",
    "probable\nAlexander Agricola, Flemish composer (d. 1506)\nWilliam Grocyn, English scholar (d. 1519)\nPietro Perugino, Italian painter (d. 1524)",
    "Alexander Agricola, Flemish composer (d. 1506)",
    "William Grocyn, English scholar (d. 1519)",
    "Pietro Perugino, Italian painter (d. 1524)"
  ],
  "deaths": [
    "April 15 – Filippo Brunelleschi, Italian architect (b. 1377)[5]",
    "May 9 – Mary of Enghien, Queen of Naples (b. 1367)",
    "May 24 – Ambroise de Loré, Baron of Ivry (b. 1396)",
    "June 11 – Henry Beauchamp, 1st Duke of Warwick, English nobleman (b. 1425)",
    "December 28 – Antipope Clement VIII",
    "February 2 – Vittorino da Feltre, Italian humanist (b. 1378)",
    "date unknown – Nuno Tristão, Portuguese explorer"
  ]
}