{
  "events": [
    "May 18 – Second Battle of Oronichea (1456): Ottoman Forces of 15,000 are sent to capture Albania, but are met and swiftly defeated by Skanderbeg's smaller forces.",
    "June 9  – Halley's Comet makes an appearance, as noted by the humanist scholar Platina.",
    "July 7 – A retrial of Joan of Arc acquits her of heresy, 25 years after her execution.",
    "July 22 – Battle of Nándorfehérvár (Belgrade): The Hungarians under John Hunyadi rout the Turkish army of Sultan Mehmed II. The noon bell ordered by Pope Callixtus III commemorates the victory throughout the Christian world (and hence is still rung).",
    "August 20 – Vladislav II, reigning Prince of Wallachia, is killed in hand-to-hand combat by Vlad the Impaler, who succeeds him.",
    "October 17 – The University of Greifswald is established, making it the second oldest university in Northern Europe, also (for a period) the oldest in Sweden and Prussia.",
    "December 5 – Two earthquakes in central Italy kills 12,000–70,000 people.[1]",
    "Lazar Branković becomes despot of Serbia.",
    "Alvise Cadamosto discovers some of the Cape Verde Islands.",
    "Diogo Gomes reaches the Geba River in Guinea Bissau, and explores the Gambia River.",
    "Emperor Zara Yaqob of Ethiopia founds the city of Debre Berhan.",
    "Muscovy and the Novgorod Republic conclude the Treaty of Yazhelbitsy.",
    "Petru Aron becomes the first ruler of Moldavia to pay tribute to the Ottomans."
  ],
  "births": [
    "March – Jan Łaski, Polish nobleman (d. 1531)",
    "March 1 – Vladislaus II, king of Bohemia, Hungary and Croatia (d. 1516)",
    "June 11 – Anne Neville, queen consort of Richard III of England (d. 1485)[2]",
    "June 23 – Margaret of Denmark, Queen of Scotland, consort of James III of Scotland (d. 1486)[3]",
    "June 25 – Henry V of Rosenberg, Bohemian nobleman (d. 1489)",
    "October 16 – Ludmila of Poděbrady, Regent of the duchies of Brzeg and Oława from 1488 (d. 1503)",
    "November 7 – Margaret of Bavaria, Electress Palatine and hereditary princess of Bavaria-Landshut (d. 1501)",
    "November 8 – Queen Gonghye, Korean royal consort (d. 1474)",
    "date unknown\nJeanne Hachette (Laisné), French peasant heroine\nAntonia di Paolo di Dono, Italian artist and daughter of Paolo di Dono (d. 1491)\nJan Lubrański, Polish bishop (d. 1520)",
    "Jeanne Hachette (Laisné), French peasant heroine",
    "Antonia di Paolo di Dono, Italian artist and daughter of Paolo di Dono (d. 1491)",
    "Jan Lubrański, Polish bishop (d. 1520)"
  ],
  "deaths": [
    "January 17 – Elisabeth of Lorraine-Vaudémont, French translator (b. 1395)",
    "August 11 – John Hunyadi, Hungarian statesman and military leader (b. c. 1406)[4]",
    "August 20 – Vladislav II of Wallachia",
    "October 17 – Nicolas Grenon, French composer (b. 1375)",
    "October 23 – Giovanni da Capistrano, Italian saint (b. 1386)",
    "November 3 – Edmund Tudor, 1st Earl of Richmond, father of King Henry VII of England (b. 1431)[5]",
    "November 9 – Ulrich II, Count of Celje (b. 1406)",
    "November 25 – Jacques Cœur, French merchant (b. 1395)",
    "December 4 – Charles I, Duke of Bourbon (b. 1401)",
    "December 24 – Đurađ Branković, Despot of Serbia (b. 1377)",
    "date unknown – Juan de Mena, Spanish poet (b. 1411)"
  ]
}