{
  "events": [
    "January 5 – French poet François Villon receives a reprieve from death by hanging, and is banished from Paris (his further life is undocumented).",
    "May – The Kingdom of Bosnia falls to the Ottoman Empire.",
    "September 15 – Battle of Vistula Lagoon: The navy of the Prussian Confederation defeats that of the Teutonic Order.",
    "October 8 – The Truce of Hesdin ends French support for the House of Lancaster in England.[1]",
    "Muhammad Rumfa starts to rule in Kano.",
    "Corpus Hermeticum is translated into Latin, by Marsilio Ficino.",
    "The fabled London Massacre occurs."
  ],
  "births": [
    "January 17\nAntoine Duprat, French cardinal (d. 1535)\nFrederick III, Elector of Saxony (d. 1525)",
    "Antoine Duprat, French cardinal (d. 1535)",
    "Frederick III, Elector of Saxony (d. 1525)",
    "February 24 – Giovanni Pico della Mirandola, Italian philosopher (d. 1494)[2]",
    "June 14 – Henry IV, Duke of Brunswick-Lüneburg, German noble (d. 1514)",
    "August 4 – Lorenzo di Pierfrancesco de' Medici, Florentine patron of the arts (d. 1503)",
    "September 29 – Louis I, Count of Löwenstein and founder of the House of Löwenstein-Wertheim (d. 1523)",
    "October 20 or October 29 – Alessandro Achillini, Bolognese philosopher (d. 1512)[3]",
    "November 29 – Andrea della Valle, Italian Catholic cardinal (d. 1534)",
    "December 25 – Johann of Schwarzenberg, German judge and poet (d. 1528)",
    "date unknown – Caterina Sforza, countess and regent of Forli (d. 1509)[4]"
  ],
  "deaths": [
    "March 9 – Catherine of Bologna, Italian Roman Catholic nun and saint (b. 1413)[5]",
    "May 25 – King Stephen Tomašević of Bosnia (beheaded)",
    "June 4 – Flavio Biondo, Italian humanist (b. 1392)",
    "June 17 – Infanta Catherine of Portugal, religious sister (b. 1436)",
    "September 23 – Giovanni di Cosimo de' Medici, Italian noble (b. 1421)",
    "November 1 – Emperor David of Trebizond (b. c. 1408)",
    "November 15 – Giovanni Antonio Del Balzo Orsini, Prince of Taranto and Constable of Naples (b. 1393)",
    "November 18 – John IV, Duke of Bavaria (b. 1437)",
    "November 29 – Marie of Anjou, queen of France, spouse of Charles VII of France (b. 1404)[6]",
    "December 2 – Albert VI, Archduke of Austria (b. 1418)",
    "December 16 – Sir Philip Courtenay, British noble (b. 1404)",
    "date unknown\nJacob Gaón, Jewish Basque tax collector (beheaded by the mob)\nPonhea Yat, last king of the Khmer Empire and first king of Cambodia (b. 1394)",
    "Jacob Gaón, Jewish Basque tax collector (beheaded by the mob)",
    "Ponhea Yat, last king of the Khmer Empire and first king of Cambodia (b. 1394)"
  ]
}