{
  "events": [
    "January – Portuguese navigators João de Santarém and Pedro Escobar reach the gold-trading centre of Elmina on the Gold Coast of west Africa.[1] and explore Cape St. Catherine, two degrees south of the equator, so that they begin to be guided by the Southern Cross constellation. They also visit Sassandra on the Ivory Coast.",
    "March 1 – Emperor Lê Thánh Tông captures the Champa capital, establishing new regions in middle Vietnam.",
    "March – The Yorkist King Edward IV returns to England, to reclaim his throne.",
    "April 14 – Battle of Barnet: Edward defeats the Lancastrian army under Warwick, who is killed.[2]",
    "May 4 – Battle of Tewkesbury: King Edward defeats a Lancastrian army under Queen Margaret and her son, Edward of Westminster the Prince of Wales, who is killed.[3]",
    "May 21 – King Edward IV celebrates his victories with a triumphal parade on his return to London. The captured Queen Margaret is paraded through the streets. The same day Henry VI of England is murdered in the Tower of London, eliminating all Lancastrian opposition to the House of York.",
    "July 14 – Battle of Shelon: The forces of Muscovy defeat the Republic of Novgorod.",
    "August 9 – Pope Sixtus IV succeeds Pope Paul II, to become the 212th pope.",
    "August 24 – King Afonso V of Portugal conquers the Moroccan town of Arzila.",
    "August 29 – The Portuguese occupy Tangiers, after its population flees the city.",
    "October 10 – Battle of Brunkeberg in Stockholm, Sweden: The forces of Regent of Sweden Sten Sture the Elder, with the help of farmers and miners, repel an attack by Christian I, King of Denmark.",
    "December 21 – The islands of São Tomé and Príncipe are discovered by Portuguese navigators João de Santarém and Pedro Escobar.[4]",
    "Pachacuti Inca Yupanqui of the Inca Empire dies, and is succeeded by his son Topa Inca Yupanqui.",
    "Moorish exiles from Spain, led by Moulay Ali Ben Moussa Ben Rached El Alami, found the city of Chefchaouen in the north of Morocco.",
    "Marsilio Ficino's translations of the Hermetica into Latin, De potestate et sapientia Dei, are published."
  ],
  "births": [
    "April 6 – Margaret of Hanau-Münzenberg, German noblewoman (d. 1503)",
    "May 21 – Albrecht Dürer, German artist, writer and mathematician (d. 1528)[5]",
    "July 15 – Eskender, Emperor of Ethiopia (d. 1494)",
    "July 22 – Anthony Kitchin, British bishop (d. 1563)",
    "July 31 – Jan Feliks \"Szram\" Tarnowski, Polish nobleman (d. 1507)",
    "August 27 – George, Duke of Saxony (d. 1539)",
    "September 8 – William III, Landgrave of Hesse (d. 1500)",
    "October 7 – King Frederick I of Denmark and Norway (d. 1533)",
    "date unknown\nJohn Forrest, English martyr and friar (d. 1538)\nEdmund de la Pole, 3rd Duke of Suffolk (d. 1513)",
    "John Forrest, English martyr and friar (d. 1538)",
    "Edmund de la Pole, 3rd Duke of Suffolk (d. 1513)"
  ],
  "deaths": [
    "January 18 – Emperor Go-Hanazono of Japan (b. 1418)",
    "February 10 – Frederick II, Margrave of Brandenburg (b. 1413)",
    "February 21 – John of Rokycan, Archbishop of Prague (b. c. 1396)",
    "March 14 – Thomas Malory, English author (b. c. 1405)",
    "March 22 – George of Poděbrady, first elected King of Bohemia (b. 1420)",
    "April 14\nJohn Neville, 1st Marquess of Montagu (b. 1431)\nRichard Neville, 16th Earl of Warwick, English kingmaker (b. 1428)[6]",
    "John Neville, 1st Marquess of Montagu (b. 1431)",
    "Richard Neville, 16th Earl of Warwick, English kingmaker (b. 1428)[6]",
    "May 4 – Edward of Westminster, Prince of Wales (in battle) (b. 1453)[7]",
    "May 6\nEdmund Beaufort, 4th Duke of Somerset (executed) (b. 1438)[8]\nThomas Tresham, Speaker of the House of Commons",
    "Edmund Beaufort, 4th Duke of Somerset (executed) (b. 1438)[8]",
    "Thomas Tresham, Speaker of the House of Commons",
    "May 21 – King Henry VI of England (murdered in prison) (b. 1421)[9]",
    "July 25 – Thomas à Kempis, German monk and writer (b. 1380)",
    "July 26 – Pope Paul II (b. 1417)[10]",
    "August 20 – Borso d'Este, Duke of Ferrara (b. 1413)",
    "November 8 – Louis II, Landgrave of Lower Hesse (1458–1471) (b. 1438)",
    "December 17 – Infanta Isabel, Duchess of Burgundy (b. 1397)",
    "date unknown\nPachacuti, Inca emperor (b. 1438)\nP'an-Lo T'ou-Ts'iuan, last independent King of Champa\nShin Sawbu, queen regnant of Hanthawaddy in southern Burma (b. 1394)",
    "Pachacuti, Inca emperor (b. 1438)",
    "P'an-Lo T'ou-Ts'iuan, last independent King of Champa",
    "Shin Sawbu, queen regnant of Hanthawaddy in southern Burma (b. 1394)"
  ]
}