{
  "events": [
    "February 20 – Orkney and Shetland are returned by Norway to Scotland, as a result of a defaulted dowry payment.[1]",
    "December 31 – The city council of Amsterdam prohibits snowball fights: \"Neymant en moet met sneecluyten werpen nocht maecht noch wijf noch manspersoon.\" (\"No one shall throw with snowballs, neither men nor (unmarried) women.\")",
    "The first printed edition of Dante Alighieri's Divine Comedy is published in Foligno.",
    "The Kingdom of Fez is founded.",
    "Possible discovery of Bacalao (possibly Newfoundland, North America) by João Vaz Corte-Real.",
    "An extensive slave trade begins in modern Cameroon, as the Portuguese sail up the Wouri River.",
    "Fernão do Po claims the central-African islands Bioko and Annobón, for Portugal.",
    "Banca Monte Dei Paschi Di Siena, the world's oldest surviving bank, is founded.",
    "Leonardo da Vinci is listed as a master, in Florence's Company of Artists.",
    "Johannes de Sacrobosco's De sphaera mundi (written c. 1230) is first published in Ferrara, the first printed astronomical book.",
    "Pietro d'Abano's Conciliator differentiarum quae inter philosophos et medicos versantur and De venenis eorumque remediis are published.   Conciliator differentiarum philosophorum et precipue medicorum",
    "Volterra, a town in Italy, is sacked by Florentine soldiers.",
    "The Cathedral and Metropolitical Church of Saint Peter in York, commonly known as York Minster, is declared complete and consecrated."
  ],
  "births": [
    "January 17 – Guidobaldo da Montefeltro, Italian condottiero and Duke of Urbino (d. 1508)",
    "February 15 – Piero di Lorenzo de' Medici, ruler of Florence (d. 1503)",
    "March 28 – Fra Bartolomeo, Italian artist (d. 1517)[2]",
    "April 5 – Bianca Maria Sforza, Holy Roman Empress, married to Maximilian I, Holy Roman Emperor (d. 1510)",
    "April 10 – Margaret of York, English princess (d. 1472)[3]",
    "May 31 – Érard de La Marck, prince-bishop of Liège (d. 1538)",
    "August 11 – Nikolaus von Schönberg, German Catholic cardinal (d. 1537)",
    "October 19 – John Louis, Count of Nassau-Saarbrücken (d. 1545)",
    "October 31 – Wang Yangming, Chinese Neo-Confucian scholar (d. 1529)",
    "November 24 – Pietro Torrigiano, Italian sculptor of the Florentine school (d. 1528)",
    "December 10 – Anne de Mowbray, 8th Countess of Norfolk (d. 1481)",
    "date unknown\nLucas Cranach the Elder, German painter (d. 1553)[4]\nAlfonsina Orsini, Regent of Florence (d. 1520)\nBarbro Stigsdotter, Swedish noblewoman and heroine (d. 1528)",
    "Lucas Cranach the Elder, German painter (d. 1553)[4]",
    "Alfonsina Orsini, Regent of Florence (d. 1520)",
    "Barbro Stigsdotter, Swedish noblewoman and heroine (d. 1528)"
  ],
  "deaths": [
    "March 30 – Amadeus IX, Duke of Savoy (b. 1435)",
    "April 25 – Leon Battista Alberti, Italian painter, poet and philosopher (b. 1404)[5]",
    "May 24 – Charles de Valois, Duke de Berry, French noble (b. 1446)",
    "May 30 – Jacquetta of Luxembourg, English duchess, daughter of Pierre de Luxembourg (b. 1416)[6]",
    "June 4 – Nezahualcoyotl, Aztec poet (b. 1402)",
    "July 15 – Johann II of Nassau-Saarbrücken, Count of Nassau-Saarbrücken (1429–1472) (b. 1423)",
    "July 25 – Charles of Artois, Count of Eu, French military leader (b. 1394)",
    "November 18 – Basilios Bessarion, Latin Patriarch of Constantinople (b. 1403)",
    "December 11 – Margaret of York, English princess (b. 1472)[3]",
    "date unknown – Afanasy Nikitin, Russian traveller",
    "probable\nThomas Boyd, Earl of Arran\nHayne van Ghizeghem, Flemish composer (b. c. 1445)\nMichelozzo, Italian architect and sculptor (b. c. 1396)",
    "Thomas Boyd, Earl of Arran",
    "Hayne van Ghizeghem, Flemish composer (b. c. 1445)",
    "Michelozzo, Italian architect and sculptor (b. c. 1396)"
  ]
}