{
  "events": [
    "February 12 – The first complete printed edition of Avicenna's The Canon of Medicine (Latin translation) is published in Milan.",
    "August 11 – Battle of Otlukbeli: Ottoman Sultan Mehmed II defeats the White Sheep Turkmens, led by Uzun Hasan.[1]",
    "Axayacatl, Aztec ruler of Tenochtitlan, invades the territory of the neighboring Aztec city of Tlatelolco. The ruler of Tlatelolco is killed, and replaced by a military governor; Tlatelolco loses its independence.",
    "Possible discovery of Bacalao (possibly Newfoundland, North America) by Didrik Pining and João Vaz Corte-Real.",
    "The Almanach cracoviense ad annum 1474 is published in Poland.",
    "The city walls and defensive moat are built in Celje, Slovenia.",
    "Marsilio Ficino becomes a Catholic priest.",
    "Recuyell of the Historyes of Troye is the first book to be printed in English, by William Caxton.",
    "Stephen the Great of Moldavia refuses to pay tribute to the Ottomans. This will attract an Ottoman invasion resulting in 1475 in the greatest defeat of the Ottomans so far."
  ],
  "births": [
    "February 19 – Nicolaus Copernicus, Polish astronomer and mathematician (d. 1543)[2]",
    "February 25 – Al-Mutawakkil Yahya Sharaf ad-Din, Imam of the Zaidi state in Yemen (d. 1555)",
    "March 3 – Asakura Sadakage, 9th head of the Asakura clan (d. 1512)",
    "March 14 – Reinhard IV, Count of Hanau-Münzenberg (1500–1512) (d. 1512)",
    "March 16 – Henry IV, Duke of Saxony (1539–1541) (d. 1541)",
    "March 17 – King James IV of Scotland, King of Scots from 11 June 1488 to his death (d. 1513)[3]",
    "April 2 – John Corvinus, Hungarian noble (d. 1504)",
    "July 4 – Matilda of Hesse, German noblewoman (d. 1505)[4]",
    "July 6 – James III of Cyprus, son of James II of Cyprus and Catherine Cornaro, king of Cyprus (d. 1474)",
    "July – Maddalena de' Medici, Italian noble (d. 1528)[5]",
    "August 14 – Margaret Pole, 8th Countess of Salisbury (d. 1541)",
    "August 17 – Richard, Duke of York, one of the Princes in the Tower (d. 1483)[6]",
    "August 25 – Margaret of Münsterberg, Duchess consort and regent of Anhalt (d. 1530)",
    "September 2 – Ercole Strozzi, Italian poet (d. 1508)[7]",
    "September 23 – Thomas Lovett III, High Sheriff of Northamptonshire (d. 1542)",
    "September 24 – Georg von Frundsberg, German knight and landowner (d. 1528)",
    "October 26 – Friedrich of Saxony, Grand Master of the Teutonic Knights (d. 1510)",
    "date unknown – Thomas Howard, 3rd Duke of Norfolk, English Tudor politician (d. 1555)",
    "probable\nJean Lemaire de Belges, Walloon poet and historian (d. 1525)\nEdward of Middleham, Prince of Wales, only son of Richard III of England (d. 1484)\nCecilia Gallerani, principal mistress of Ludovico Sforza, Duke of Milan (d. 1536)",
    "Jean Lemaire de Belges, Walloon poet and historian (d. 1525)",
    "Edward of Middleham, Prince of Wales, only son of Richard III of England (d. 1484)",
    "Cecilia Gallerani, principal mistress of Ludovico Sforza, Duke of Milan (d. 1536)"
  ],
  "deaths": [
    "January 24 – Conrad Paumann, German composer (b. c. 1410)",
    "February 23 – Arnold, Duke of Guelders (b. 1410)",
    "April 3 – Alessandro Sforza, Italian condottiero (b. 1409)",
    "April 15 – Yamana Sōzen, Japanese daimyō and monk (b. 1404)",
    "May 8 – John Stafford, 1st Earl of Wiltshire, English politician (b. 1420)",
    "June 6 – Hosokawa Katsumoto, Japanese nobleman (b. 1430)",
    "June 28 – John Talbot, 3rd Earl of Shrewsbury, English nobleman (b. 1448)[8]",
    "July 10 – James II of Cyprus (b. c. 1440)",
    "November 26 – Diego Fernández de la Cueva, 1st Viscount of Huelma",
    "October – Contessina de' Bardi, politically active Florentine woman (b. 1390)",
    "December 24 – John Cantius, Polish scholar and theologian (b. 1390)",
    "date unknown\nJean Jouffroy, French prelate and diplomat (b. c. 1412)\nNicholas I, Duke of Lorraine (b. 1448)\nSigismondo Polcastro, Paduan physician and natural philosopher (b. 1384)",
    "Jean Jouffroy, French prelate and diplomat (b. c. 1412)",
    "Nicholas I, Duke of Lorraine (b. 1448)",
    "Sigismondo Polcastro, Paduan physician and natural philosopher (b. 1384)",
    "probable – Marina Nani, Venetian dogaressa (b. c. 1400)",
    "probable – Patriarch Gennadios II of Constantinople (b. c. 1400)"
  ]
}