{
  "events": [
    "January 2 – Alain I of Albret signs the Treaty of Moulins with Charles VIII of France.",
    "March – The French–Breton War resumes.",
    "March 19−20 – Alain I of Albret captures the Château des ducs de Bretagne for the French.",
    "April 23 – Granada is besieged by the Catholic Monarchs of Spain, and Santa Fe, Granada is founded.",
    "May – The war between the Ottoman Empire and the Egyptian Mamluks ends.",
    "May 3 – The ruler of the Kingdom of Kongo, Nkuwu Nzinga, is baptised by Portuguese missionaries, adopting the baptismal name of João I.",
    "May 8 – A solar eclipse takes place over Metz.[1]",
    "June 27 – Louis of Orléans is released by Charles VIII of France after three years of imprisonment.",
    "September – Battle of Vrpile Gulch in southern Croatia: Forces of the Ottoman Empire are defeated by those of the Kingdom of Croatia.",
    "November – The pretender Perkin Warbeck begins a campaign to take the English throne, with a landing in Ireland.[2]",
    "November 7 – Maximilian I, Holy Roman Emperor and King Vladislaus II of Bohemia and Hungary sign the Peace of Pressburg, formally ending the Austrian–Hungarian War.",
    "November 16 – An auto-da-fé held in Brasero de la Dehesa (outside Ávila) concludes the case of the Holy Child of La Guardia, with the execution of several Jewish and converso suspects.",
    "November 25 – Reconquista: The Granada War is effectively brought to an end (and the Siege of Granada extended for two months) with the signing of the Treaty of Granada between the Catholic Monarchs of Spain and the Moorish Emirate of Granada.",
    "December 6 – King Charles VIII of France marries Anne of Brittany, forcing her to break her marriage with Maximilian I, Holy Roman Emperor, thus incorporating Brittany into the kingdom of France.[3]",
    "December 21 – The Truce of Coldstream secures a five-year peace, between Scotland and England.[2]",
    "In the Ayutthaya Kingdom the reign of Ramathibodi II begins.",
    "The population of China reaches 56.238 million.[4]",
    "The Bread and Cheese Revolt breaks out in West Frisia, North Holland, caused by a famine among the peasants due to bad weather conditions.",
    "A major fire breaks out in Dresden.",
    "In the Russian territory of Komi (now the Komi Republic), annexed by Russia in 1478, copper and silver ores are discovered, and the territory gains importance as a mining and metallurgical center.",
    "Nicolaus Copernicus enters the University of Kraków."
  ],
  "births": [
    "January 30 – Francesco Sforza, Italian noble (d. 1512)",
    "March 25 – Marie d'Albret, Countess of Rethel, French nobility (d. 1549)",
    "May 10 – Suzanne, Duchess of Bourbon (d. 1521)",
    "June 28 – Henry VIII of England (d. 1547)[5]",
    "August 3 – Maria of Jülich-Berg, spouse of John III, Duke of Cleves (d. 1543)",
    "August 10 – Queen Janggyeong, Korean royal consort (d. 1515)",
    "August 25 – Innocenzo Cybo, Catholic cardinal (d. 1550)",
    "October 6 – Francis de Bourbon, Count of St. Pol, French noble (d. 1545)",
    "c. October 23 – Ignatius of Loyola, Spanish founder of the Society of Jesus, a Roman Catholic religious order (d. 1556)",
    "October 26 – Zhengde Emperor of China (d. 1521)",
    "November 8 – Teofilo Folengo, Italian poet (d. 1544)",
    "November 11 – Martin Bucer, German Protestant reformer (d. 1551)",
    "December 13 – Martín de Azpilcueta, Spanish theologian and economist (d. 1586)",
    "December 31 – Jacques Cartier, French explorer (d. 1557)[6]",
    "date unknown\nLapulapu, Filipino king (d. 1542)\nAzai Sukemasa, Japanese samurai and warlord (d. 1546)\nIsabella Losa, Spanish scholar  (d. 1564)",
    "Lapulapu, Filipino king (d. 1542)",
    "Azai Sukemasa, Japanese samurai and warlord (d. 1546)",
    "Isabella Losa, Spanish scholar  (d. 1564)",
    "probable\nGeorge Blaurock, Swiss founder of Anabaptism (d. 1529)\nAntonio Pigafetta, Italian explorer (d. 1534)",
    "George Blaurock, Swiss founder of Anabaptism (d. 1529)",
    "Antonio Pigafetta, Italian explorer (d. 1534)"
  ],
  "deaths": [
    "January 19 – Dorothea of Brandenburg, Duchess of Mecklenburg (b. 1420)",
    "February 15 – Ashikaga Yoshimi, brother of Shōgun Ashikaga Yoshimasa (b. 1439)",
    "February 19 – Enno I, Count of East Frisia (1466–1491) (b. 1460)",
    "March 6 – Richard Woodville, 3rd Earl Rivers",
    "March 31 – Bonaventura Tornielli, Italian Roman Catholic priest (b. 1411)",
    "May 14 – Filippo Strozzi the Elder, Italian banker (b. 1428)",
    "July 13 – Afonso, Prince of Portugal (b. 1475)",
    "July 16 – William Herbert, 2nd Earl of Pembroke, English earl (b. 1451)",
    "October 5 – Jean Balue, French cardinal and statesman (b. c. 1421)",
    "October 12 – Fritz Herlen, German artist (b. 1449)",
    "November 16 – Holy Child of La Guardia, Spanish folk saint (b. n/a)",
    "December 28 – Bertoldo di Giovanni, Italian sculptor (b. c. 1435)",
    "date unknown – Anne of Orléans, Abbess of Fontevraud  (b. 1464)",
    "probable\nFebruary 9 (according to the Libro dei Morti) – Antonia di Paolo di Dono, Italian artist and daughter of Paolo di Dono",
    "February 9 (according to the Libro dei Morti) – Antonia di Paolo di Dono, Italian artist and daughter of Paolo di Dono"
  ]
}