{
  "events": [
    "February – Portuguese explorer Vasco Da Gama reaches Malindi, in modern-day Kenya.",
    "March 2 –  Vasco da Gama visits Quelimane and Mozambique, in southeastern Africa.",
    "May\nJohn Cabot leaves Bristol on an expedition, never to be seen again.\nThe English Merchant Adventurers are granted a trade monopoly with the Netherlands.[1]",
    "John Cabot leaves Bristol on an expedition, never to be seen again.",
    "The English Merchant Adventurers are granted a trade monopoly with the Netherlands.[1]",
    "May 20 – Portuguese navigator Vasco da Gama arrives at Calicut (modern-day Kozhikode), India, becoming the first European to get there by sailing around Africa, thus discovering the maritime route to India. He finds a local Arab merchant who is able to interpret for him.",
    "May 23 – Girolamo Savonarola, ruler of Florence, is executed for criticizing the Pope.",
    "June – Niccolò Machiavelli is elected by the Great Council as the second chancellor of the Republic of Florence.",
    "Summer – The final Welsh revolt of the medieval era breaks out in Meirionnydd, North Wales; Harlech Castle is captured by the rebels before the revolt is suppressed.",
    "July 31 – On his third voyage to the Western Hemisphere, Christopher Columbus becomes the first European to visit the island of Trinidad.",
    "August 1 – Columbus discovers the mouth of the Orinoco.",
    "August 4–12 – Columbus explores the Gulf of Paria.",
    "September 20 – 1498 Nankai earthquake off the coast of Japan.",
    "João Fernandes Lavrador and Pedro Barcelos journey to Greenland; during their voyage, they discover the land which they name Labrador.",
    "The Wiener Hofmusikkapelle, a forerunner of the Vienna Boys' Choir, is founded by Maximilian I, Holy Roman Emperor.",
    "Probable date at which Leonardo da Vinci completes the painting The Last Supper, on the refectory wall of Santa Maria delle Grazie (Milan)."
  ],
  "births": [
    "January 31 – Tiberio Crispo, Italian clergyman (d. 1566)",
    "February 4 – George I of Württemberg-Mömpelgard (d. 1558)",
    "February 21 – Ralph Neville, 4th Earl of Westmorland, English earl (d. 1549)",
    "February 25 – Francesco of Saluzzo, Marquess of Saluzzo (d. 1537)",
    "April 5 – Giovanni dalle Bande Nere, Italian condottiero (d. 1526)",
    "April 9 – Jean, Cardinal of Lorraine, French churchman (d. 1550)",
    "June 1 – Maarten van Heemskerck, Dutch painter (d. 1574)",
    "June 30 – Wilhelm von Brandenburg, Archbishop of Riga (d. 1563)",
    "July 25 – Hernando de Aragón, Spanish Catholic archbishop (d. 1575)",
    "August 23 – Miguel da Paz, Prince of Portugal (d. 1500)",
    "August 24 – John, Hereditary Prince of Saxony, German prince (d. 1537)",
    "November 1 – Giovanni Ricci, Italian cardinal (d. 1574)",
    "November 15 – Eleanor of Austria, Queen of Portugal and France (d. 1558)[2]",
    "December 1 – Giovanni Michele Saraceni, Italian Catholic cardinal (d. 1568)",
    "December 19  – Andreas Osiander, German Protestant theologian (d. 1552)",
    "date unknown\nGiulio Clovio, (Juraj Julije Klovic) Dalmatian miniaturist and illustrator (d. 1578)\nAnna of Masovia, Polish princess (d. 1557)\nMeera, Rajput princess (d. 1547)\nSagara Taketō, Japanese retainer (d. 1551)\nPier Paolo Vergerio, Italian religious reformer (d. 1565)\nFelix Manz, leader of the Swiss Anabaptists (d. 1527)",
    "Giulio Clovio, (Juraj Julije Klovic) Dalmatian miniaturist and illustrator (d. 1578)",
    "Anna of Masovia, Polish princess (d. 1557)",
    "Meera, Rajput princess (d. 1547)",
    "Sagara Taketō, Japanese retainer (d. 1551)",
    "Pier Paolo Vergerio, Italian religious reformer (d. 1565)",
    "Felix Manz, leader of the Swiss Anabaptists (d. 1527)"
  ],
  "deaths": [
    "February 4 – Antonio del Pollaiuolo, Italian painter (b. c. 1432)",
    "April 7 – King Charles VIII of France (b. 1470)[3]",
    "May 23 – Girolamo Savonarola, Italian religious reformer and ruler of Florence (b. 1452; executed)[4]",
    "June 7 – Anđeo Zvizdović, Bosnian Franciscan friar and evangelist (b. c. 1420)",
    "August 17 – John Scrope, 5th Baron Scrope of Bolton, English baron (b. 1437)",
    "August 23 – Isabella of Aragon, Queen of Portugal, eldest daughter of Isabella I of Castile and Ferdinand II of Aragon (b. 1470)[5]",
    "September 14 – Giovanni il Popolano, Italian diplomat (b. 1467)",
    "September 16 – Tomás de Torquemada, Spanish Dominican friar and first Grand Inquisitor (b. 1420)[6]",
    "December 7 – Alexander Hegius von Heek, German humanist (b. c. 1443)[7]",
    "December 19 – Jeanne de Laval, French noble (b. 1433)",
    "date unknown\nTun Perak, Malay general and statesman\nDomenico Rosselli, Italian sculptor (b. c. 1439)",
    "Tun Perak, Malay general and statesman",
    "Domenico Rosselli, Italian sculptor (b. c. 1439)",
    "probable – Johannes Martini, Flemish composer (b. c. 1440)"
  ]
}