{
  "events": [
    "January 5 – Duke Ludovico Sforza recaptures Milan, but is soon driven out again by the French.",
    "January 26 – Spanish navigator Vicente Yáñez Pinzón reaches the northern coast of Brazil.[3]",
    "February 17 – Battle of Hemmingstedt: The Danish army fails to conquer the peasants' republic of Dithmarschen.",
    "April 22 – Portuguese navigator Pedro Álvares Cabral officially discovers Brazil, and claims the land for the Kingdom of Portugal. He had 13 vessels with him.",
    "July 14 – The Muscovites defeat the Lithuanians and the Poles in the Battle of Vedrosha.",
    "August – : The Turkish fleet of Kemal Reis defeats the Venetians in the Second Battle of Lepanto. The Turks proceed to capture Modon  and Coron, the \"two eyes of the Republic\".",
    "August 10 – Diogo Dias discovers an island which he names St Lawrence (after the saint's day on which it was first sighted), later to be known as Madagascar.",
    "November 11 – Treaty of Granada: Louis XII of France and Ferdinand II of Aragon agree to divide the Kingdom of Naples between them.",
    "November 16 – Emperor Go-Kashiwabara accedes to the throne of Meiō era Japan.",
    "December 24 – The Siege of the Castle of St. George ends, and the island of Cephalonia is captured by a joint Venetian–Spanish fleet.",
    "December 31  – The last incunable is printed in Venice.[4]",
    "Europe's population is estimated at 56.7 million people (Spielvogel).",
    "Saxony's mint at Annaberg begins producing guldengroschens.",
    "Although other reports exist, it is thought that the last wolf in England was killed this year, making the species extinct in that country. The wolf is thought to have been killed in Allithwaite, in Cumbria. However, reports of wolf sightings and laws concerning wolf bounties existed in rural areas of the north until the 18th century.",
    "A group of Māori migrated east from the New Zealand mainland to the Chatham Islands, developing a distinct pacificist culture known as the Moriori (approx date)"
  ],
  "births": [
    "January 1 – Solomon Molcho, Portuguese mystic (d. 1532)",
    "January 6 – John of Ávila, Spanish mystic and saint (d. 1569)[5]",
    "January 20 – Jean Quintin, French priest, knight and writer (d. 1561)[6]",
    "February 7 – João de Castro, Portuguese nobleman and fourth viceroy of Portuguese India (d. 1548)[7]",
    "February 22 – Cardinal Rodolfo Pio da Carpi, Italian humanist (d. 1564)",
    "February 24 – Charles V, Holy Roman Emperor (d. 1558)[8]",
    "March 12 – Reginald Pole, Archbishop of Canterbury (d. 1558)",
    "April 12 – Joachim Camerarius, German classical scholar (d. 1574)[9]",
    "April 23\nAlexander Ales, Scottish theologian (d. 1565)[10]\nJohann Stumpf, Swiss writer (d. 1576)[11]",
    "Alexander Ales, Scottish theologian (d. 1565)[10]",
    "Johann Stumpf, Swiss writer (d. 1576)[11]",
    "April 27 – Louis, Count of Vaudémont, Italian bishop (d. 1528)",
    "May 17 – Federico II Gonzaga, Duke of Mantua (d. 1540)",
    "June 13 – Ernest of Bavaria, pledge lord of the County of Glatz (d. 1560)",
    "July 2 – Federico Cesi (cardinal), Italian cardinal (d. 1565)",
    "July 20 – Lorenzo Cybo, Italian condottiero (d. 1549)",
    "August 16 – Louis Gonzaga (Rodomonte), Italian-French dignitary and diplomat (d. 1532)",
    "September 5 – Maria of Jever, last ruler of the Lordship of Jever (d. 1575)",
    "September 7 – Sebastian Newdigate, Carthusian monk and martyr (d. 1535)",
    "September 17 – Sebastiano Antonio Pighini, Italian cardinal (d. 1553)",
    "September 26 – Ludovica Torelli, Count of Guastalla (d. 1569)",
    "October 17 – Alonso de Orozco Mena, Spanish Roman Catholic priest (d. 1591)",
    "November 3 – Benvenuto Cellini, Italian goldsmith and sculptor (d. 1571)[12]",
    "December 6 – Nicolaus Mameranus, Luxembourgian soldier and historian (d. 1567)",
    "probable\nJohannes Aal, Swiss theologian and composer (d. 1553)\nCharles Dumoulin, French jurist (d. 1566)\nWu Cheng'en, Chinese novelist (d. 1582)\nHeinrich Faber, German music theorist (d. 1552)\nFrancisco de Moraes, Portuguese writer (d. 1572)\nMem de Sá, Governor-General of Brazil (d. 1572)\nJeanne de la Font, French poet and culture patron (d. 1532)\nMing the clam, longest living ocean quahog was born (d. 2006)",
    "Johannes Aal, Swiss theologian and composer (d. 1553)",
    "Charles Dumoulin, French jurist (d. 1566)",
    "Wu Cheng'en, Chinese novelist (d. 1582)",
    "Heinrich Faber, German music theorist (d. 1552)",
    "Francisco de Moraes, Portuguese writer (d. 1572)",
    "Mem de Sá, Governor-General of Brazil (d. 1572)",
    "Jeanne de la Font, French poet and culture patron (d. 1532)",
    "Ming the clam, longest living ocean quahog was born (d. 2006)"
  ],
  "deaths": [
    "February 17 – William III, Landgrave of Hesse (b. 1471)",
    "April 10 – Michael Tarchaniota Marullus, Greek scholar, poet and soldier (b. c. 1453)[13]",
    "April 12 – Leonhard of Gorizia, Count of Gorz (b. 1440)",
    "May 29\nBartolomeu Dias, Portuguese explorer (b. c. 1450)[14]\nThomas Rotherham, English cleric and minister (b. 1423)",
    "Bartolomeu Dias, Portuguese explorer (b. c. 1450)[14]",
    "Thomas Rotherham, English cleric and minister (b. 1423)",
    "June 19 – Edmund Tudor, Duke of Somerset, English nobleman (b. 1499)",
    "June 23 – Lodovico Lazzarelli, Italian poet (b. 1447)[15]",
    "July 14 – Íñigo López de Mendoza y Luna, 2nd Duke of the Infantado, Spanish noble (b. 1438)",
    "July 19 – Miguel da Paz, Prince of Portugal (b. 1498)",
    "August 18 – Alfonso of Aragon, prince (b. 1481)",
    "August 26 – Philipp I, Count of Hanau-Münzenberg, German noble (b. 1449)",
    "August 30 – Victor, Duke of Münsterberg and Opava, Count of Glatz (b. 1443)",
    "September 12 – Albert III, Duke of Saxony (b. 1443)",
    "September 15 – John Morton, English Archbishop of Canterbury (b. c. 1420)[16]",
    "October 1 – John Alcock, English Bishop of Ely (b. c. 1430)",
    "October 21 – Emperor Go-Tsuchimikado of Japan (b. 1442)",
    "November 13 – Philip, Prince of Anhalt-Köthen, German prince (b. 1468)",
    "date unknown – Antonia of Savoy, Lady Consort of Monaco",
    "Juan Pérez de Gijón, Spanish composer (b. 1460)",
    "Stefano Infessura, Italian humanist writer (b. c. 1435)",
    "Fyodor Kuritsyn, Russian statesman, philosopher and poet",
    "Nyai Gede Pinateh, Javanese merchant (b. c. 1450)"
  ]
}