{
  "events": [
    "January 17 – Cesare Borgia returns triumphantly to Rome, from Romagna.",
    "March 25 – Portuguese navigator João da Nova probably discovers Ascension Island.[1] It is definitely sighted and named on May 20, 1503 (Feast of the Ascension) by Afonso de Albuquerque.[2]",
    "April – The Rebellion of the Alpujarras ends with the surrender of the last Muslim insurgents in the Alpujarra Mountains, who are given the choice of expulsion or conversion to Christianity.[3]",
    "May 15 – Harmonice Musices Odhecaton, the first printed collection of polyphonic music, is published by Ottaviano Petrucci in Venice.",
    "July – Ismail I is enthroned as Shah of Azerbaijan, choosing Tabriz as his capital, founding the Safavid Dynasty in northern Iran. He declares Shi'ism the official and compulsory religion, under penalty of death.",
    "July 21 – Portuguese explorer Pedro Cabral returns to Lisbon from his expedition to Calicut (Nicolau Coelho having arrived on June 23).",
    "July 27 – Copernicus is formally installed as canon of Frauenberg Cathedral.",
    "August\nJohn, King of Denmark, Norway and Sweden is deposed from the Swedish throne, starting the Dano-Swedish War (1501–1512).\nFlorentine political theorist, statesman, and writer Niccolò Machiavelli marries Marietta Corsini, who will bear him six children.",
    "John, King of Denmark, Norway and Sweden is deposed from the Swedish throne, starting the Dano-Swedish War (1501–1512).",
    "Florentine political theorist, statesman, and writer Niccolò Machiavelli marries Marietta Corsini, who will bear him six children.",
    "August 27 – Battle of the Siritsa River: The Livonian Order, supporting the Grand Duchy of Lithuania in the Second Muscovite–Lithuanian War, and commanded by Wolter von Plettenberg, defeats an army of the Grand Duchy of Moscow and Pskov Republic.",
    "October 2 – Spanish princess Catherine of Aragon arrives to Plymouth, England.",
    "October 13\nTreaty of Trente: Maximilian of Austria and Louis XII of France sign the treaty, with Austria recognizing all French conquests in the northern territories of Italy.\nLeonardo Loredan is elected 75th doge of the Venetian Republic.",
    "Treaty of Trente: Maximilian of Austria and Louis XII of France sign the treaty, with Austria recognizing all French conquests in the northern territories of Italy.",
    "Leonardo Loredan is elected 75th doge of the Venetian Republic.",
    "October 30 – The Banquet of Chestnuts is purportedly held by Cesare Borgia, in the Papal Palace of Rome (this account is not historical fact, and could be attributed to enemies of Alexander VI).",
    "November 1 (All Saints) – Amerigo Vespucci discovers and names Baía de Todos os Santos, in Brazil.",
    "November 4\nBattle of Mstislavl (Second Muscovite–Lithuanian War): Grand Prince Ivan's Southern Muscovite army defeats the forces of the Grand Duchy of Lithuania.[4]\nPhilip and Joanna of Castile leave for Spain.",
    "Battle of Mstislavl (Second Muscovite–Lithuanian War): Grand Prince Ivan's Southern Muscovite army defeats the forces of the Grand Duchy of Lithuania.[4]",
    "Philip and Joanna of Castile leave for Spain.",
    "November 12 – Sten Sture the Elder is elected Regent of Sweden for the second time.",
    "November 14 – Arthur, Prince of Wales, marries the Spanish princess Catherine of Aragon.",
    "November 24 – A large army of the Grand Duchy of Moscow overruns Livonia during the Second Muscovite–Lithuanian War.[4]",
    "December 12 – Alexander Jagiellon becomes King of Poland.",
    "December 31 – First Battle of Cannanore: João da Nova fleet engaged the fleet of the Zamorin in a battle outside of the Cannanore harbor, the first Portuguese naval battle in the Indian Ocean.",
    "The Swiss cantons of Basel and Schaffhausen join the Old Swiss Confederacy.",
    "Gaspar Corte-Real, Portuguese navigator, makes the first documented European landing in North America since c. 1000 A.D.",
    "Rodrigo de Bastidas, sailing westward from Venezuela in search of gold, becomes the first European to explore the Isthmus of Panama.",
    "Amerigo Vespucci maps the two stars Alpha Centauri and Beta Centauri, as well as the stars of the constellation Crux, which are below the horizon in Europe.",
    "Dhaulpur is taken by Sikandar Lodi.",
    "Michelangelo returns to his native Florence, to begin work on the statue David.",
    "Italic type (cut by Francesco Griffo) is first used by Aldus Manutius at the Aldine Press in Venice, in an edition of Virgil.",
    "Martin Luther enters the University of Erfurt."
  ],
  "births": [
    "January 16 – Anthony Denny, confidant of Henry VIII of England (d. 1559)",
    "January 17 – Leonhart Fuchs, German physician and botanist (d. 1566)",
    "January 24 – Jacob Milich, German astronomer and mathematician (d. 1559)",
    "February 24 – Sixt Birck, German humanist (d. 1554)",
    "March 21 – Anne Brooke, Baroness Cobham, English noble (d. 1558)",
    "March 12 – Pietro Andrea Mattioli, Italian scientist (d. 1577)",
    "May 6 – Pope Marcellus II (d. 1555)",
    "May 17 – Stanisław of Masovia, Polish duke (d. 1524)",
    "July 10 – Cho Shik, Korean Confucian scholar and politician (d. 1572)",
    "July 18 – Isabella of Burgundy, queen of Christian II of Denmark (d. 1526)",
    "August 17 – Philipp II, Count of Hanau-Münzenberg (d. 1529)",
    "September 18 – Henry Stafford, 1st Baron Stafford, English baron (d. 1563)",
    "September 24 – Gerolamo Cardano, Italian mathematician, physician, astrologer and gambler (d. 1576)",
    "September 26 – Gian Gabriele I of Saluzzo, Italian abbot, Marquess of Saluzzo (d. 1548)",
    "November 14 – Anna of Oldenburg, Regent of East Frisia from 1540 to 1561 (d. 1575)",
    "December 2 – Queen Munjeong, Korean queen (d. 1565)",
    "date unknown\nYi Hwang, Korean Confucian scholar (d. 1570)\nGirolamo da Carpi, Italian painter (d. 1556)\nDawit II of Ethiopia (d. 1540)\nBauck Poppema, Dutch noble and heroine\nAnne Boleyn, second queen of Henry VIII of England (b. this year or 1507; d. 1536)\nMurakami Yoshikiyo, Japanese nobleman (d. 1573)",
    "Yi Hwang, Korean Confucian scholar (d. 1570)",
    "Girolamo da Carpi, Italian painter (d. 1556)",
    "Dawit II of Ethiopia (d. 1540)",
    "Bauck Poppema, Dutch noble and heroine",
    "Anne Boleyn, second queen of Henry VIII of England (b. this year or 1507; d. 1536)",
    "Murakami Yoshikiyo, Japanese nobleman (d. 1573)",
    "probable\nNicholas Heath, archbishop of York and Lord Chancellor (d. 1578)\nGarcia de Orta, Portuguese physician (d. 1568)\nHilaire Penet, French composer",
    "Nicholas Heath, archbishop of York and Lord Chancellor (d. 1578)",
    "Garcia de Orta, Portuguese physician (d. 1568)",
    "Hilaire Penet, French composer"
  ],
  "deaths": [
    "January 3 – Ali-Shir Nava'i, Central Asian poet, politician and writer (b. 1441)",
    "January 5 – John Dynham, 1st Baron Dynham, English baron and Lord High Treasurer (b. 1433)",
    "January 25 – Margaret of Bavaria, Electress Palatine, Princess of Bavaria-Landshut (b. 1456)",
    "February 1 – Sigismund, Duke of Bavaria, German noble (b. 1439)",
    "March 4 – Thihathura II of Ava (b. 1474)",
    "April – John Doget, English diplomat",
    "April 7 – Minkhaung II, king of Ava (b. 1446)",
    "April 23 – Domenico della Rovere, Italian Catholic cardinal (b. 1442)",
    "May 3 – John Devereux, 9th Baron Ferrers of Chartley, English baron (b. 1463)",
    "May 7 – Giovanni Battista Zeno, Italian Catholic cardinal",
    "May 20 – Columba of Rieti, Italian Dominican tertiary Religious Sister and blessed (b. 1467)",
    "June 8 – George Gordon, 2nd Earl of Huntly, Earl of Huntly and Lord Chancellor of Scotland (b. 1440)",
    "June 17 – John I Albert of Poland (b. 1459)",
    "August 15 – Constantine Lascaris, Greek scholar and grammarian",
    "September 20\nAgostino Barbarigo, Doge of Venice\nThomas Grey, 1st Marquess of Dorset, stepson of Edward IV of England (b. 1457)",
    "Agostino Barbarigo, Doge of Venice",
    "Thomas Grey, 1st Marquess of Dorset, stepson of Edward IV of England (b. 1457)",
    "September 26 – Džore Držić, Croatian poet and playwright (b. 1461)",
    "September 29 – Andrew Stewart, Scottish bishop (b. 1442)",
    "November 19 – Amalia of Saxony, Duchess of Bavaria-Landshut (b. 1436)",
    "probable – Gaspar Corte-Real, Portuguese explorer (b. 1450)"
  ]
}