{
  "events": [
    "January 1 – Portuguese explorers, led by Gonçalo Coelho, sail into Guanabara Bay, Brazil, mistaking it for the mouth of a river, which they name Rio de Janeiro.[1]",
    "February 12 – Isabella I issues an edict outlawing Islam in the Crown of Castile, forcing virtually all her Muslim subjects to convert to Christianity.",
    "May 3 – Portuguese navigator João da Nova discovers the uninhabited island of Saint Helena.[2]",
    "May 11 – Christopher Columbus leaves Cadiz, Spain for his fourth and final trip to the New World. He explores Central America, and discovers St. Lucia (possibly),[3] the Isthmus of Panama, Honduras, and Costa Rica.",
    "July – Ismail I becomes Shah of Persia.[4]",
    "August 14 – Christopher Columbus lands at Trujillo, and names the country 'Honduras'.",
    "September – A Greek and Italian parallel text edition of Herodotus' Histories, done for Count Matteo Maria Boiardo, is published in Venice by Aldus Manutius.",
    "September 18 – Christopher Columbus lands at Costa Rica.",
    "September 29; The Wedding of Vladislaus II of Bohemia and Hungary and Anne of Foix-Candale",
    "October 1 – An annular solar eclipse occurs.",
    "November 7 – Columbus reaches the coast of Honduras, and passes south to Panama.",
    "December 26 – Cesare Borgia kills Ramiro d'Orco; this incident is referenced in Machiavelli's The Prince",
    "December 31 – Cesare Borgia (son of Pope Alexander VI) occupies Urbino, where he imprisons two potentially treacherous allies, Vitellozzo and Oliveretto; he executes them the next morning.",
    "The first African slaves brought to the New World arrive at the island of Hispaniola (modern-day Haiti and Dominican Republic).",
    "Bristol merchants return from Newfoundland (first so named this year from a letter) to England, carrying three native people and cod from the Grand Banks.[5][6]",
    "Moctezuma II is elected emperor of the Aztecs, following the death of Ahuitzotl.",
    "Meñli I Giray defeats the Golden Horde and sacks their capital, Sarai.",
    "Wittenberg University is founded.",
    "In Germany, Peter Henlein of Nuremberg uses iron parts and coiled springs to build a portable timepiece.",
    "In Italy, Asher Lämmlein declares that the Jewish Messiah will arrive in the next 6 months, resulting in the year of penance.",
    "The King's School, Macclesfield, England, is founded by Sir John Percyvale.",
    "Heinrich Cornelius Agrippa receives the degree of magister artium from the University of Cologne.[7]",
    "Wilhelm Bombast moves to Villach with his son, Paracelsus."
  ],
  "births": [
    "January 7 – Pope Gregory XIII, born Ugo Boncompagni, Bolognese-born pontiff (d. 1585)[8]",
    "January 20 – Sebastian de Aparicio, Spanish colonial industrialist and saint in Mexico (d. 1600)",
    "February 2 – Damião de Góis, Portuguese philosopher (d. 1574)",
    "March 4 – Elisabeth of Hesse, Hereditary Princess of Saxony (d. 1557)",
    "March 18 – Philibert of Chalon, French nobleman (d. 1530)",
    "March 20 – Pierino Belli, Italian soldier and jurist (d. 1575)",
    "April 2 – Susanna of Bavaria, German noble of the House of Wittelsbach (d. 1543)",
    "April 10 – Otto Henry, Count Palatine of Neuburg (1505–1559) and Elector Palatine (1556–1559) (d. 1559)",
    "April 25 – Georg Major, German Lutheran theologian (d. 1574)",
    "June 2 – Guillaume Bigot, French writer (d. 1550)",
    "June 6 – King John III of Portugal (d. 1557)[9]",
    "July 26 – Christian Egenolff, German printer (d. 1555)",
    "July 27 – Francesco Corteccia, Italian composer (d. 1571)",
    "August 14 – Pieter Coecke van Aelst, Flemish painter (d. 1550)",
    "September 14 – Louis II, Count Palatine of Zweibrücken, Duke of Zweibrücken from 1514 to 1532 (d. 1532)",
    "December 6 – Anna of Brunswick-Lüneburg, Duchess consort of Pomerania (d. 1568)",
    "December 13 – George III, Landgrave of Leuchtenberg (d. 1555)",
    "date unknown\nTakeno Jōō, Japanese Sengoku period master of the tea ceremony and merchant (d. 1555)\nMiguel López de Legazpi, Spanish conquistador (d. 1572)\nPedro Nunes, Portuguese mathematician (d. 1578)\nFrancesco Spiera, Italian Protestant jurist (d. 1543)\nAnthony Maria Zaccaria, Cremonese founder of the Barnabite Order and saint (d. 1539)",
    "Takeno Jōō, Japanese Sengoku period master of the tea ceremony and merchant (d. 1555)",
    "Miguel López de Legazpi, Spanish conquistador (d. 1572)",
    "Pedro Nunes, Portuguese mathematician (d. 1578)",
    "Francesco Spiera, Italian Protestant jurist (d. 1543)",
    "Anthony Maria Zaccaria, Cremonese founder of the Barnabite Order and saint (d. 1539)",
    "probable\nElizabeth Blount, English courtier, mistress of King Henry VIII of England (d. 1540)\nCuauhtémoc, last Aztec ruler (Tlatoani) of Tenochtitlán and the last \"Aztec Emperor\" (d. 1525)\nBlaise de Lasseran-Massencôme, seigneur de Montluc, marshal of France (approximate date; d. 1577)\nHurrem Sultan, Ruthenian-born Haseki sultan of the Ottoman Empire (d. 1558)\nHenry Percy, 6th Earl of Northumberland, English courtier (d. 1537)",
    "Elizabeth Blount, English courtier, mistress of King Henry VIII of England (d. 1540)",
    "Cuauhtémoc, last Aztec ruler (Tlatoani) of Tenochtitlán and the last \"Aztec Emperor\" (d. 1525)",
    "Blaise de Lasseran-Massencôme, seigneur de Montluc, marshal of France (approximate date; d. 1577)",
    "Hurrem Sultan, Ruthenian-born Haseki sultan of the Ottoman Empire (d. 1558)",
    "Henry Percy, 6th Earl of Northumberland, English courtier (d. 1537)"
  ],
  "deaths": [
    "February 18 – Hedwig Jagiellon, Duchess of Bavaria (b. 1457)",
    "March – Francesco Laurana, Dalmatian-born sculptor (b. c. 1430)",
    "March 2 – Jan I Carondelet, Burgundian jurist and politician (b. 1428)",
    "April 2 – Arthur, Prince of Wales, English prince, eldest son of Henry VII of England (b. 1486)[10]",
    "April 15 – John IV of Chalon-Arlay, Prince of Orange (1475–1502) (b. 1443)",
    "April 20 – Maria of Loon-Heinsberg, Dutch noble (b. 1426)",
    "May 4 – Berthold II of Landsberg, Bishop of Verden (1470–1502) and Hildesheim (1481–1502) (b. 1464)",
    "May 6 – James Tyrrell, English knight, alleged murderer of the princes in the Tower (executed) (b. c. 1450)",
    "June 9 – Astorre III Manfredi, Italian noble (b. 1485)",
    "July 15 – Luka Radovanović, Catholic priest (b. 1425)",
    "August 18 – Knut Alvsson, Norwegian nobleman and politician (b. 1455)",
    "August 31 – Thomas Wode, Lord Chief Justice of the Common Pleas",
    "September 1 – Sōgi, Japanese Buddhist priest and poet (b. 1421)",
    "October 14 – Diego Hurtado de Mendoza y Quiñones, Spanish noble (b. 1444)",
    "November 10 – George I of Münsterberg, Imperial Prince, Duke of Münsterberg and Oels, Graf von Glatz (b. 1470)",
    "November 13 – Annio da Viterbo, Italian Dominican friar and scholar (b. 1432)",
    "December 31\nOliverotto Euffreducci, Italian politician (b. 1475)\nVitellozzo Vitelli, Italian condottiero (b. c. 1458)",
    "Oliverotto Euffreducci, Italian politician (b. 1475)",
    "Vitellozzo Vitelli, Italian condottiero (b. c. 1458)",
    "date unknown\nAhuitzotl, Aztec ruler of Tenochtitlan\nOctavien de Saint-Gelais, French churchman, poet and translator (b. 1468)\nGwerful Mechain, Welsh erotic poet (b. c. 1460?)[11]",
    "Ahuitzotl, Aztec ruler of Tenochtitlan",
    "Octavien de Saint-Gelais, French churchman, poet and translator (b. 1468)",
    "Gwerful Mechain, Welsh erotic poet (b. c. 1460?)[11]"
  ]
}