{
  "events": [
    "January 20 – Seville in Castile is awarded exclusive rights to trade with the New World.",
    "January 24 – Construction of the Henry VII Chapel at Westminster Abbey begins in the perpendicular style, the final stage of English Gothic art.[1]",
    "February 13 – Challenge of Barletta: Thirteen Italian knights defeat thirteen French knights, near Barletta.",
    "February 23 – French–Spanish Wars in Italy – Battle of Ruvo: The Spanish defeat the French.",
    "April 21 – Battle of Seminara: Spanish forces under Fernando de Andrade de las Mariñas defeat the French under Bernard Stewart, 4th Lord of Aubigny.",
    "April 21 – Battle of Cerignola: Spanish forces under Gonzalo Fernández de Córdoba defeat the French under Louis d'Armagnac, Duke of Nemours, who is killed (considered to be the first battle in history won by gunpowder small arms).[2]",
    "May 10 – Christopher Columbus discovers the Cayman Islands, which he names Las Tortugas, after the numerous sea turtles there.",
    "May 13 – Naples is captured by the Spanish.",
    "May 20 (Feast of the Ascension) – Ascension Island is first definitively sighted, by Portuguese admiral Afonso de Albuquerque.[3]",
    "May 28 – James IV of Scotland and Margaret Tudor are married as per the Treaty of Perpetual Peace by Pope Alexander VI, according to Papal bull.",
    "July 23 – Orbital calculations suggest that on this day, Pluto moved outside Neptune's orbit, remaining there for 233 years.",
    "July 30 – Saint Helena is first definitively sighted, by ships of Portuguese navigator Estêvão da Gama returning from the East.[4][5][6]",
    "August 8 – King James IV of Scotland marries Margaret Tudor, daughter of King Henry VII of England, at Holyrood Abbey, Edinburgh, Scotland.",
    "August 20 – Stephen III of Moldavia concludes a treaty with Sultan Bayezid II, preserving Moldavia's self-rule at the cost of an annual tribute to the Ottoman Empire.",
    "September 22 – Pope Pius III (Francesco Todeschini Piccolomini) succeeds Alexander VI as the 215th pope, but dies on October 18.[7]",
    "October 30 – Queen Isabella I of Spain prohibits violence against indigenous peoples in the New World.",
    "October 31 – Pope Julius II succeeds Pius III, as the 216th pope (some sources list November 1 as the date of election).",
    "December 29 – Battle of Garigliano, near Gaeta, Italy: Spanish forces under Gonzalo Fernández de Córdoba defeat a French–Italian mercenary army under Ludovico II, Marquess of Saluzzo; the French forces withdraw to Gaeta.",
    "Vasco da Gama establishes India's first Portuguese fortress, at Cochin.",
    "Mariotto Albertinelli paints The Visitation.[8]",
    "Hieronymus Bosch works on the triptych The Garden of Earthly Delights.",
    "Leonardo da Vinci probably starts work on painting the Mona Lisa in Florence.",
    "The book The Imitation of Christ by Thomas à Kempis is re-published in an English translation.",
    "The pocket handkerchief comes into general use in polite European society.",
    "From this year until 1650, sixteen million kilograms of silver and 185,000 kilograms of gold will enter the port of Seville."
  ],
  "births": [
    "January 3 – Al-Mutahhar, Imam of the Zaidi state of Yemen (d. 1572)",
    "January 11 – Parmigianino (Girolamo Francesco Maria Mazzola), Italian artist (d. 1540)",
    "January 18 – Joachim of Münsterberg-Oels, Duke of Münsterberg, Duke of Oels, Count of Kladsko, Bishop of Brandenburg (d. 1562)",
    "February 24 – Johann Gropper, German Catholic cardinal (d. 1559)",
    "March 4 – Elisabeth of Hesse, Countess Palatine of Zweibrücken, later Countess Palatine of Simmern (d. 1563)",
    "March 10 – Ferdinand I, Holy Roman Emperor (d. 1564)[9]",
    "March 11 – George Harper, English politician (d. 1558)",
    "March 22 – Antonio Francesco Grazzini, Italian writer (d. 1584)",
    "April 6 – Jacob Micyllus, German humanist (d. 1558)",
    "April 18 – Henry II of Navarre, King of Navarre (1517–1555) (d. 1555)",
    "May 1 – Celio Secondo Curione, Italian humanist (d. 1569)",
    "June 1 – Wilhelm von Grumbach, German adventurer (d. 1567)",
    "June 28 – Giovanni della Casa, Italian poet (d. 1556)",
    "June 30 – John Frederick I, Elector of Saxony (d. 1554)",
    "July 23 – Anne of Bohemia and Hungary, Queen consort of the Romans, Bohemia and Hungary (d. 1547)",
    "August 12 – Christian III of Denmark and Norway (d. 1559)",
    "October 4 – Isabella of Portugal, Queen of Spain (d. 1539)[10]",
    "November 12 – Philip, Duke of Palatinate-Neuburg, German duke (d. 1548)",
    "November 13 – Ippolita Gonzaga, Italian nun (d. 1570)",
    "November 17 – Agnolo di Cosimo, Italian artist and poet (d. 1572)",
    "November 19 – Pier Luigi Farnese, Duke of Parma (d. 1547)",
    "December 14 – Michel de Nostredame, called Nostradamus, French physician and writer of Les Propheties (1555) (d. 1566)[11]",
    "December 20 – Cosimo Bartoli, Italian diplomat and writer (d. 1572)",
    "date unknown\nLucas David, Prussian historian (d. 1583)\nRobert Estienne, French printer (d. 1559)\nJohn Frith, English Protestant priest and martyr (d. 1533)\nGeorge Boleyn, Viscount Rochford, English diplomat (d. 1536)\nSusannah Hornebolt, English artist (d. c. 1554)\nLakandula, Lakan of Tondo (d. 1589)\nShimazu Katsuhisa, Japanese nobleman (d. 1573)\nTomé de Sousa, Portuguese nobleman, first general-governor of Brazil (d.1573 or 1579)",
    "Lucas David, Prussian historian (d. 1583)",
    "Robert Estienne, French printer (d. 1559)",
    "John Frith, English Protestant priest and martyr (d. 1533)",
    "George Boleyn, Viscount Rochford, English diplomat (d. 1536)",
    "Susannah Hornebolt, English artist (d. c. 1554)",
    "Lakandula, Lakan of Tondo (d. 1589)",
    "Shimazu Katsuhisa, Japanese nobleman (d. 1573)",
    "Tomé de Sousa, Portuguese nobleman, first general-governor of Brazil (d.1573 or 1579)",
    "probable – Nicholas Bourbon, French poet"
  ],
  "deaths": [
    "January 20 – Ludmila of Poděbrady, Regent of the duchies of Brzeg and Oława (1488–1503) (b. 1456)",
    "February 11 – Elizabeth of York, queen of Henry VII of England (b. 1466)[12]",
    "March 16 – Edward Story, Bishop of Carlisle and Chichester",
    "March 14 – Frederick Jagiellon, Primate of Poland (b. 1468)",
    "April 4 – Annamacharya, Indian mystic saint composer (b. 1408)",
    "April 7 – Sophia Palaiologina, Byzantine princess and Grand Princess of Moscow (b. 1449)",
    "May 20 – Lorenzo di Pierfrancesco de' Medici, Italian patron of the arts (b. 1463)",
    "June 2 – Clara Gonzaga, Italian noble (b. 1464)",
    "June 24 – Reginald Bray, British courtier (b. 1440)",
    "July 3 – Pierre d'Aubusson, Grand Master of the Knights of Rhodes (b. 1423)",
    "July 12 – Sophie of Mecklenburg, Duchess of Mecklenburg, Duchess of Saxony (b. 1481)",
    "July 24 – Louise of Savoy, Nun (b. 1461)",
    "August 12 – Anna Jagiellon, Duchess of Pomerania, Polish princess (b. 1476)",
    "August 18 – Pope Alexander VI (b. 1431)[13]",
    "September 5 – Margaret of Hanau-Münzenberg, German noblewoman (b. 1471)",
    "October 10 – Peter II, Duke of Bourbon (b. 1438)",
    "October 18 – Pope Pius III (b. c. 1439)[14]",
    "November 23\nBona of Savoy, Duchess of Savoy (b. 1449)\nMargaret of York, Duchess consort of Burgundy, spouse of Charles I, Duke of Burgundy (b. 1446)",
    "Bona of Savoy, Duchess of Savoy (b. 1449)",
    "Margaret of York, Duchess consort of Burgundy, spouse of Charles I, Duke of Burgundy (b. 1446)",
    "December 1 – George, Duke of Bavaria (b. 1455)",
    "December 14 – Sten Sture the Elder, regent of Sweden (1470–1497 and 1501–1503) (b. 1440)",
    "December 28 – Piero di Lorenzo de' Medici, exiled ruler of Florence (drowned) (b. 1472)",
    "date unknown\nRichard Amerike, English merchant and patron of John Cabot (b. 1445)\nAnacaona, Taino queen and poet (b. 1474)",
    "Richard Amerike, English merchant and patron of John Cabot (b. 1445)",
    "Anacaona, Taino queen and poet (b. 1474)"
  ]
}