{
  "events": [
    "June 6 – The M8.2–8.8 Lo Mustang earthquake strikes Nepal, causing severe damage in Kathmandu, western Nepal, and some parts of the Indo-Gangetic plain.[1]",
    "June 19 – Zhengde Emperor ascends the throne of Ming Dynasty China.",
    "June 27 – The future King Henry VIII of England repudiates his engagement to Catherine of Aragon, at his father's command.[2]",
    "July 2 – Martin Luther, aged 22, vows to become a monk in a moment of terror, as a result of a close lightning strike during a thunderstorm, near the village of Stotternheim.[3]",
    "July – The Kalmar Bloodbath takes place in Kalmar, Sweden.",
    "July 17 – Luther enters the monastic life, at an Augustinian cloister in Erfurt.",
    "July 24 – Travelling to India, a group of Portuguese explorers sack the city-state of Kilwa in East Africa, killing the king for failing to pay tribute.",
    "November 6 – Vasili III succeeds Ivan III, as Grand Prince of Muscovy.",
    "December 30 – Érard de La Marck is elected prince-bishop of Liège.[4]",
    "A Portuguese fleet attacks Kilwa, and then Mombasa. The Portuguese then attempt to monopolize the trade in the east African ports, but are unable to maintain control (by the late 16th century, Swahili groups regain control of several ports from the Portuguese).",
    "Portuguese merchants establish factories on the east coast of Africa.",
    "Portuguese explorers under Dom Lourenço d'Almeida reach Colombo on Sri Lanka and send envoys to the King of Kotte; they also reach the Comoros.",
    "Bermuda is discovered by Spanish explorer Juan de Bermúdez.",
    "King Alexander of Poland signs the Nihil novi Act, making Poland a Nobles' Democracy.",
    "Poland prohibits peasants from leaving their lands, establishing serfdom.",
    "Christ's College, Cambridge, England, is re-founded, receiving its charter from Lady Margaret Beaufort.",
    "Judah Abravanel becomes personal physician to the viceroy of Naples.",
    "Battle of Achnashellach in Scotland: The Clan Cameron emerges victorious over several other clans.",
    "Watch 1505, the earliest known pocket watch, is made at Nuremberg, Germany by Peter Henlein.[5]",
    "1505 (or 1506) – Portuguese explorer Gonçalo Álvares is the first to sight what will later be known as Gough Island in the South Atlantic."
  ],
  "births": [
    "January 12 – Louis, Count of Stolberg, German nobleman (d. 1574)",
    "January 13 – Joachim II Hector, Elector of Brandenburg, Imperial Elector (d. 1571)",
    "February 4 – Mikołaj Rej, Polish poet and prose writer, politician and musician of the Renaissance (d. 1569)[6]",
    "February 5 – Aegidius Tschudi, Swiss historian (d. 1572)",
    "March 16 – Francisco Balbi di Correggio (d. 1589)[7]",
    "March 25 – Elizabeth Grey, Viscountess Lisle, English heiress (d. 1519)",
    "May 20 – Levinus Lemnius, Dutch writer (d. 1568)",
    "September 15 – Mary of Hungary, Dutch ruler (d. 1558)",
    "September 23 – Anne de Laval, Viscountess of Thouars, French noblewoman and nominal pretender to the Kingdom of Naples (d. 1554)",
    "November 3 – Achilles Gasser, German physician and astrologer (d. 1577)",
    "November 23 – Ercole Gonzaga, Spanish Catholic cardinal (d. 1563)",
    "December 18 – Philipp von Hutten, German explorer (d. 1546)",
    "December 21 – Thomas Wriothesley, 1st Earl of Southampton, English politician (d. 1550)[8]",
    "December 25 – Christine of Saxony, German noble (d. 1549)",
    "date unknown\nWilliam Cavendish, English courtier (d. 1557)\nPhilip Hoby, English politician (d. 1558)\nGuillaume Morel, French classical scholar (d. 1564)\nMargaret Roper, English writer (d. 1544)\nShahghali, Khan of Qasim",
    "William Cavendish, English courtier (d. 1557)",
    "Philip Hoby, English politician (d. 1558)",
    "Guillaume Morel, French classical scholar (d. 1564)",
    "Margaret Roper, English writer (d. 1544)",
    "Shahghali, Khan of Qasim",
    "probable\nChristopher Tye, English composer and organist (d. 1572)[9]\nJane Boleyn, Viscountess Rochford, English noblewoman (executed 1542)",
    "Christopher Tye, English composer and organist (d. 1572)[9]",
    "Jane Boleyn, Viscountess Rochford, English noblewoman (executed 1542)"
  ],
  "deaths": [
    "February 4 – Jeanne de Valois, French princess, Roman Catholic nun and saint (b. 1464)[10]",
    "February 19 – Matilda of Hesse, German noblewoman (b. 1473)",
    "February 20 – Arvid Trolle, Swedish politician (b. 1440)",
    "March 5 – Philip of Cleves, Bishop of Nevers, Amiens, Autun (b. 1467)",
    "March 29 – Sidonie of Bavaria, eldest daughter of Duke Albrecht IV of Bavaria-Munich (b. 1488)",
    "April 23 – Muhammad Jaunpuri, Indian-born religious leader (b. 1443)",
    "May 28 – Ascanio Sforza, Italian Roman Catholic cardinal (b. 1455)[11]",
    "June 8 – Hongzhi Emperor of China (b. 1470)",
    "June 18 – Osanna of Mantua, Italian Dominican tertiary and blessed (b. 1449)",
    "June 15 – Ercole I d'Este, Duke of Ferrara, Italian politician (b. 1431)",
    "July – Jacob Obrecht, Flemish composer (plague) (b. 1457)[12]",
    "October 27 – Emperor Ivan III of Russia (b. 1440)",
    "date unknown\nAdam of Fulda, German music writer (b. c. 1445)[13]\nHeinrich Kramer, German churchman and inquisitor (b. 1430)",
    "Adam of Fulda, German music writer (b. c. 1445)[13]",
    "Heinrich Kramer, German churchman and inquisitor (b. 1430)"
  ]
}