{
  "events": [
    "February 3 – Battle of Diu: The Portuguese defeat a coalition of Indians, Muslims and Italians.[1]",
    "March 18 – Maximilian I, Holy Roman Emperor, names Margaretha land guardians of the Habsburg Netherlands.[2]",
    "April 7 – The Kingdom of France declares war on the Republic of Venice.[3]",
    "April 15 – The French army under the command of Louis XII leave Milan to invade Venetian territory. Part of the War of the League of Cambrai and the Italian Wars.[4]",
    "April 21 – Henry VIII becomes King of England (for 38 years) on the death of his father, Henry VII.[5]",
    "April 27 – Pope Julius II places Venice under interdict and excommunication for refusing to cede part of Romagna to papal control.[6]",
    "May 9:\nThe French army under the command of Louis XII cross the Adda River at Cassano d'Adda.[4]\nThe Venetians, encamped around the town of Treviglio, move south towards the Po River in search of better positions.[4]",
    "The French army under the command of Louis XII cross the Adda River at Cassano d'Adda.[4]",
    "The Venetians, encamped around the town of Treviglio, move south towards the Po River in search of better positions.[4]",
    "May 14 – Battle of Agnadello: French forces defeat the Venetians. The League of Cambrai occupies Venice's mainland territories.[4]",
    "June 11:\nHenry VIII of England marries Catherine of Aragon.[7]\nLuca Pacioli's De divina proportione, concerning the golden ratio, is published in Venice, with illustrations by Leonardo da Vinci.[8]",
    "Henry VIII of England marries Catherine of Aragon.[7]",
    "Luca Pacioli's De divina proportione, concerning the golden ratio, is published in Venice, with illustrations by Leonardo da Vinci.[8]",
    "June 19 – Brasenose College, Oxford, is founded by a lawyer, Sir Richard Sutton, of Prestbury, Cheshire, and the Bishop of Lincoln, William Smyth.[9]",
    "June 24 – King Henry VIII of England and Queen Consort Catherine of Aragon are crowned.[10]",
    "July 17 – Venetian forces retake the city of Padua from French forces.[11]",
    "July 26 – Krishnadevaraya ascends the throne of the Vijayanagara Empire.[12]",
    "August 8 – Maximillian I of the Holy Roman Empire along with French allies begin a siege of Padua that would last for months to retake the city.[3]",
    "August 19 – Maximillian I orders all Jews within the Holy Roman Empire to destroy all books opposing Christianity.[13]",
    "September 10 – The Constantinople earthquake destroys 109 mosques and kills an estimated 10,000 people.[14]",
    "September 11 – Portuguese fidalgo Diogo Lopes de Sequeira becomes the first European to reach Malacca, having crossed the Gulf of Bengal.[15]",
    "September 27 – A violent storm ravages the Dutch coast, killing potentially thousands of people.[2]",
    "October 2 – The siege of Padua ends with Venetian victory, causing the retreat of HRE and French forces back to Tyrol and Milan.[3]",
    "Aft. October 2 – Venetians forces reoccupy the city of Vicenza.[3]",
    "November 4 – Afonso de Albuquerque becomes the governor of the Portuguese settlements in India.[16]",
    "November 10 – Uriel von Gemmingen is assigned to secure others opinions before continuing the Jewish book purge started on August 19th.[13]",
    "December – Francisco de Almeida begins his journey home to the Kingdom of Portugal from Diu, India.[17]",
    "Erasmus writes his most famous work, In Praise of Folly.[18]",
    "St Paul's School, London is founded by John Colet, Dean of St Paul's Cathedral.[19]",
    "Royal Grammar School, Guildford, England, is founded under the will of Robert Beckingham.[20]",
    "Queen Elizabeth's Grammar School, Blackburn, England, is founded as a grammar school for boys.[21]",
    "Georg Tannstetter is appointed by Maximilian I as the Professor of Astronomy at the University of Vienna.[22]",
    "Johannes Pfefferkorn writes his fourth and fifth pamphlets condemning the Jewish faith and people, Das Osterbuch and Der Judenfeind.[13]",
    "Basil Solomon becomes Syriac Orthodox Maphrian of the East.[23]"
  ],
  "births": [
    "January 2 – Henry of Stolberg, German nobleman (d. 1572)[24]",
    "January 3 – Gian Girolamo Albani, Italian Catholic cardinal (d. 1591)[25]",
    "January 25 – Giovanni Morone, Italian Catholic cardinal (d. 1580)[26]",
    "February 2 – John of Leiden, Dutch Anabaptist leader (d. 1536)[27]",
    "February 10 – Vidus Vidius, Italian surgeon and anatomist (d. 1569)[28]",
    "March 27 – Wolrad II, Count of Waldeck, German nobleman (d. 1575) [29]",
    "April 23 – Afonso of Portugal, Portuguese Roman Catholic cardinal (d. 1540)[30]",
    "July 4 – Magnus III of Mecklenburg-Schwerin, German Lutheran bishop of the Prince-Bishopric of Schwerin (d. 1550)[31]",
    "July 10 – John Calvin, French religious reformer (d. 1564)[32]",
    "July 25 – Philip II, Count of Nassau-Saarbrücken, German nobleman (d. 1554)[33]",
    "August 3 – Étienne Dolet, French scholar and printer (d. 1546)[34]",
    "August 7 – Joachim I, Prince of Anhalt-Dessau, German prince (d. 1561)[35]",
    "August 25 – Ippolito II d'Este, Italian cardinal and statesman (d. 1572)[36]",
    "October 20 – Arthur Stewart, Duke of Rothesay, Scottish prince (d. 1510)[37]",
    "November 4 – John, Duke of Münsterberg-Oels, Polish-German nobleman (d. 1565)[38]",
    "Guillaume Le Testu, French privateer (d. 1573)[39]",
    "John Erskine of Dun, Scottish religious reformer (d. 1591)[40]",
    "Stanisław Odrowąż, Polish nobleman (d. 1545)[41]",
    "Anneke Esaiasdochter, Dutch Anabaptist  (d. 1539)[42]",
    "François de Scépeaux, French governor (d. 1571)[43]",
    "Antonio Gardano, French composer (d. 1569)[44]",
    "Gonzalo Jiménez de Quesada, Spanish conquistador (d. 1579)[45]",
    "Élie Vinet, French humanist (d. 1587)[46]",
    "Bernardino Telesio, Italian philosopher and natural scientist (d. 1588)[47]",
    "François Douaren, French jurist (d. 1559)[48]"
  ],
  "deaths": [
    "January – Adam Kraft, German sculptor and architect (b. circa 1460)[49]",
    "January 27 – John I, Count Palatine of Simmern, German nobleman (b. 1459)[50]",
    "March 14 – Giovanni Antonio Sangiorgio, Italian cardinal (b. unknown)[51]",
    "April 21 – Henry VII of England, King of England and Lord of Ireland (b. 1457)[52]",
    "April 27 – Margaret of Brandenburg, German abbess of the Poor Clares monastery at Hof (b. 1453)[53]",
    "May 28 – Caterina Sforza, Italian countess of Forlì (b. 1463)[54]",
    "June 29 – Margaret Beaufort, Countess of Richmond and Derby, mother of Henry VII of England (b. 1443)[55]",
    "July 11 – William II, Landgrave of Hesse, German nobleman (b. 1469)[56]",
    "July 16:\nJoao da Nova, Portuguese explorer (b. 1460)[57]\nMikalojus Radvila the Old, Lithuanian nobleman (b. circa 1450)[58]",
    "Joao da Nova, Portuguese explorer (b. 1460)[57]",
    "Mikalojus Radvila the Old, Lithuanian nobleman (b. circa 1450)[58]",
    "July 28 – Ignatius Noah of Lebanon, Syriac Orthodox patriarch of Antioch (b. 1451).[59]",
    "December 1 – Lê Uy Mục, 8th king of the later Lê Dynasty of Vietnam (b. 1488)[60]",
    "Hans Seyffer, German sculptor and woodcarver (b. circa 1460)[61]",
    "Shen Zhou, Chinese painter (b. 1427)[62]",
    "Eleanor de Poitiers, Burgundian courter and writer (b. circa 1444)[63]",
    "Viranarasimha Raya, Indian ruler of the Vijayanagar Empire (b. unknown)[64]"
  ]
}