{
  "events": [
    "March 26 - The 1511 Idrija earthquake occurs, with a maximum Mercalli intensity of X (Extreme). The epicenter is around the town of Idrija in present-day Slovenia, although some place it some 15-20 kilometers to the west, between Gemona and Pulfero in Friulian Slovenia. The earthquake affects a large territory between Carinthia, Friuli, present-day Slovenia and Croatia.",
    "April 9\nSt John's College, Cambridge, England, founded by Lady Margaret Beaufort, receives its charter.[1]\nThe Şahkulu Rebellion breaks out in Anatolia.",
    "St John's College, Cambridge, England, founded by Lady Margaret Beaufort, receives its charter.[1]",
    "The Şahkulu Rebellion breaks out in Anatolia.",
    "July – Henry VIII of England's flagship, the Mary Rose, is launched at Portsmouth.",
    "August 15[2] – Capture of Malacca: Afonso de Albuquerque of Portugal conquers Malacca, the capital of the Sultanate of Malacca, giving Portugal control over the Strait of Malacca, through which all sea-going trade between China and India is concentrated. The Sultanate then establishes rule from Johor, starting decades of skirmishes against the Portuguese to regain the fallen city. While taking the city, the Portuguese slaughter a large community of Chinese merchants living there.[3] Malacca is the first city in Southeast Asia to be taken by a Western nation, gaining home rule only in 1957, when it becomes part of Malaysia.",
    "October 12 – James IV of Scotland's great ship, the Michael, is launched at Newhaven, Edinburgh; she is the largest ship afloat at this date.[4]",
    "November – The Treaty of Westminster creates an alliance between Henry VIII of England and Ferdinand II of Aragon against France.",
    "November 20 – The vessel Frol de la Mar, transporting Afonso de Albuquerque and the valuable treasure of the conquest of Malacca, sinks en route to Goa.",
    "Diego Velázquez and Hernán Cortés conquer Cuba; Velázquez is appointed Governor.",
    "Duarte Barbosa arrives in India for the second time. He works as clerk in the factory of Cananor, and as the liaison with the Indian rajah.",
    "After the fall of Malacca, Afonso de Albuquerque sends Duarte Fernandes on a diplomatic mission to Burma and Siam, becoming the first European to visit these countries diplomatically.",
    "Ferdinand II of Aragon observes that \"one black can do the work of four Indians\".",
    "Juan de Agramonte, a sailor from Spain, is thought possibly to have travelled to Newfoundland.",
    "Taíno, an indigenous uprising, occurs in southwestern Puerto Rico near Guánica.",
    "The first black slaves arrive in Colombia.",
    "The Spanish conquest of Yucatán begins.",
    "Erasmus publishes his most famous work, The Praise of Folly (Laus stultitiae).[5]"
  ],
  "births": [
    "January 1 – Henry, Duke of Cornwall, eldest son of Henry VIII of England[6]",
    "April 2 – Ashikaga Yoshiharu, Japanese shōgun (d. 1550)",
    "April 5 – John III, Count of Nassau-Saarbrücken, German noble (d. 1574)",
    "June 4 – Honorat II of Savoy, French Navy admiral (d. 1580)",
    "June 6 – Jakob Schegk, German physician (d. 1587)",
    "June 18 – Bartolomeo Ammannati, Florentine architect and sculptor (d. 1592)",
    "July 9 – Dorothea of Saxe-Lauenburg, consort of Christian III from 1525, and Queen of Denmark and Norway (d. 1571)",
    "July 30 – Giorgio Vasari, Italian painter and architect (d. 1574)[7]",
    "August 24 – Jean Bauhin, French physician (d. 1582)",
    "September 28 – Matsudaira Kiyoyasu, Japanese daimyo (d. 1535)",
    "September 29 – Michael Servetus, Spanish theologian (d. 1553)",
    "October 22 – Erasmus Reinhold, German astronomer and mathematician (d. 1553)",
    "November 8 – Paul Eber, German Lutheran theologian (d. 1569)",
    "November 15 – Johannes Secundus, Dutch poet (d. 1536)",
    "December 5 – Maldev Rathore, ruler of Marwar (d. 1562)",
    "date unknown\nAmato Lusitano, Portuguese Jewish physician (d. 1568)\nBirgitte Gøye, Danish county administrator, lady in waiting, landholder and educator  (d. 1574)\nKimotsuki Kanetsugu, Japanese samurai and warlord (d. 1566)\nLuís de Velasco, Spanish viceroy of New Spain (d. 1564)\nNicola Vicentino, Italian music theorist and composer (d. 1576)\nNicholas Bobadilla, one of the first Spanish Jesuits (d. 1590)\nPierre Viret, Swiss reformed theologian (d. 1571)\nGaspar Cervantes de Gaeta, Spanish cardinal (d. 1575)",
    "Amato Lusitano, Portuguese Jewish physician (d. 1568)",
    "Birgitte Gøye, Danish county administrator, lady in waiting, landholder and educator  (d. 1574)",
    "Kimotsuki Kanetsugu, Japanese samurai and warlord (d. 1566)",
    "Luís de Velasco, Spanish viceroy of New Spain (d. 1564)",
    "Nicola Vicentino, Italian music theorist and composer (d. 1576)",
    "Nicholas Bobadilla, one of the first Spanish Jesuits (d. 1590)",
    "Pierre Viret, Swiss reformed theologian (d. 1571)",
    "Gaspar Cervantes de Gaeta, Spanish cardinal (d. 1575)"
  ],
  "deaths": [
    "January 9 – Demetrios Chalkokondyles, Greek classical scholar (b. 1424)",
    "January 20 – Oliviero Carafa, Italian Catholic cardinal (b. 1430)",
    "February 22 – Henry, Duke of Cornwall, eldest son of Henry VIII of England[8]",
    "April 1 – Francis of Denmark, Danish prince (b. 1497)",
    "April 2 – Bernard VII, Lord of Lippe, German nobleman (b. 1428)",
    "June 3 – Ahmad ibn Abi Jum'ah, North African Islamic scholar, author of the Oran fatwa",
    "June 13 – Hedwig, Abbess of Quedlinburg, Princess-Abbess of Quedlinburg (b. 1445)",
    "July 2 – Şahkulu, leader of the Şahkulu Rebellion",
    "July 6 – Adolf III of Nassau-Wiesbaden-Idstein, Germany noble (b. 1443)",
    "July 12 – Albert I, Duke of Münsterberg-Oels, Count of Kladsko (b. 1468)",
    "August 2 – Andrew Barton, Scottish naval leader (b. c. 1466)",
    "September 6\nAshikaga Yoshizumi, Japanese shogun (b. 1481)\nWilliam IV, Duke of Jülich-Berg, Count of Ravensberg (b. 1455)",
    "Ashikaga Yoshizumi, Japanese shogun (b. 1481)",
    "William IV, Duke of Jülich-Berg, Count of Ravensberg (b. 1455)",
    "October 18 – Philippe de Commines, French-speaking Fleming in the courts of Burgundy and France (b. 1447)",
    "November 23\nMahmud Begada, Sultan of Gujarat (b. 1458)\nAnne of York, daughter of King Edward IV of England (b. 1475)",
    "Mahmud Begada, Sultan of Gujarat (b. 1458)",
    "Anne of York, daughter of King Edward IV of England (b. 1475)",
    "date unknown\nDiego de Nicuesa, Spanish conquistador and explorer\nJohannes Tinctoris, Flemish composer and music theorist (b. c. 1435)\nEstefania Carròs i de Mur, Spanish educator (b. 1455)\nMatthias Ringmann, German cartographer and humanist poet (b. 1482)\nYusuf Adil Shah, founding leader of the Adil Shahi Dynasty",
    "Diego de Nicuesa, Spanish conquistador and explorer",
    "Johannes Tinctoris, Flemish composer and music theorist (b. c. 1435)",
    "Estefania Carròs i de Mur, Spanish educator (b. 1455)",
    "Matthias Ringmann, German cartographer and humanist poet (b. 1482)",
    "Yusuf Adil Shah, founding leader of the Adil Shahi Dynasty",
    "probable – Antoine de Févin, French composer (b. c. 1470)"
  ]
}