{
  "events": [
    "January – Juan Díaz de Solís discovers the Río de la Plata (in future Argentina).",
    "January 23 – With the death of Ferdinand II of Aragon, his grandson, Charles of Ghent, becomes King of Spain;[1] his mother Queen Joanna of Castile also succeeds as Queen of Aragon and co-monarch with Carlos, but remains confined at Tordesillas.",
    "March 1 – Desiderius Erasmus publishes a new Greek edition of the New Testament, Novum Instrumentum omne, in Basel.",
    "March 29 – The Venetian Ghetto is instituted in the Republic of Venice.",
    "April 23 – The Reinheitsgebot is instituted in Ingolstadt, Bavaria, regulating the purity of beer permissible for sale.",
    "July – Selim I of the Ottoman Empire declares war on the Mamluk Sultanate of Cairo and invades Syria.",
    "August 13 – The Treaty of Noyon is signed. Francis I of France recognizes  Charles I of Spain's claim to Naples, and Charles recognizes Francis's claim to Milan.",
    "August 18 – King Francis I of France and Pope Leo X sign the Concordat of Bologna, agreeing on the relationship between church and state in France.",
    "August 24– Battle of Marj Dabiq (Ottoman–Mamluk War (1516–17)): The Ottoman Sultan Selim I defeats the mamluk forces commanded by the sultan Al-Ashraf Qansuh al-Ghuri.",
    "October 28 – Battle of Yaunis Khan (Ottoman–Mamluk War (1516–17)): Ottoman forces under the Grand Vizier Sinan Pasha defeat the Mamluks near Gaza.",
    "December 4 – Treaty of Brussels: Peace is declared between the Kingdom of France and the Holy Roman Empire.",
    "c. December – Thomas More's most famous work, Utopia, completed this year, is published in Leuven (in Latin).",
    "Italian explorer Rafael Perestrello, a cousin of Christopher Columbus, commands an expedition from Portuguese Malacca to land on the shores of mainland southern China, and trade with Chinese merchants at Guangzhou, during the Ming Dynasty.",
    "Portuguese soldier Fernão Lopes becomes the first known permanent inhabitant of Saint Helena.",
    "Leonardo da Vinci accepts Francis I's invitation to France.",
    "The predecessor of the Royal Mail, known as the Master of the Posts, is established by Henry VIII of England.",
    "Gillingham School is founded, the oldest in Dorset, England.",
    "Fuggerei is established in Augsburg (Bavaria), as the world's oldest social housing complex still in use.",
    "The fall of the Nantan meteorite is possibly observed near the city of Nantan, Nandan County, Guangxi (China)."
  ],
  "births": [
    "January 1 – Margaret Leijonhufvud, queen of Gustav I of Sweden (d. 1551)",
    "January 14 – Herluf Trolle, Danish admiral (d. 1565)",
    "January 16 – Bayinnaung, King of Burma (d. 1581)",
    "February 2 – Girolamo Zanchi, Italian theologian (d. 1590)",
    "February 16 – Prospero Spani, Italian sculptor (d. 1584)",
    "February 18 – Queen Mary I of England, daughter of King Henry VIII of England and Queen Catherine of Aragon (d. 1558)[2]",
    "March 15 – Alqas Mirza, Safavid prince (d. 1550)[3]",
    "March 26 – Conrad Gessner, Swiss naturalist (d. 1565)",
    "April 16 – Tabinshwehti, King of Burma (d. 1550)",
    "April 23 – Georg Fabricius, Protestant German poet (d. 1571)",
    "June 28 – Charles Blount, 5th Baron Mountjoy, English courtier and patron of learning (d. 1544)",
    "July 27 – Emilie of Saxony, German nobleman (d. 1591)",
    "July 28 – William, Duke of Jülich-Cleves-Berg, German nobleman (d. 1592)",
    "August 13 – Hieronymus Wolf, German historian (d. 1580)",
    "September 2 – Francis I, Duke of Nevers (d. 1561)",
    "September 21 – Matthew Stewart, 4th Earl of Lennox (d. 1571)",
    "October 4 – Archangelo de' Bianchi, Italian cardinal (d. 1580)",
    "October 23 – Charlotte of Valois, French princess (d. 1524)",
    "October 27 – Ruy Gómez de Silva, Portuguese noble (d. 1573)",
    "November 5 – Martin Helwig, German cartographer of Silesia (d. 1574)",
    "December 21 – Giuseppe Leggiadri Gallani, Italian poet and dramatist (d. 1590)",
    "date unknown\nAntonio Bernieri, Italian painter during the Renaissance period (d. 1565)\nJohn Foxe, biographer (d. 1587)\nManco Inca Yupanqui, ruler of the Inca (d. 1544)\nCanghali of Kazan, khan of Qasim and Kazan (d. 1535)\nMargaretha Coppier, Dutch heroine  (d. 1597)\nShri Gusainji, son of Shri Vallabhacharyaji.",
    "Antonio Bernieri, Italian painter during the Renaissance period (d. 1565)",
    "John Foxe, biographer (d. 1587)",
    "Manco Inca Yupanqui, ruler of the Inca (d. 1544)",
    "Canghali of Kazan, khan of Qasim and Kazan (d. 1535)",
    "Margaretha Coppier, Dutch heroine  (d. 1597)",
    "Shri Gusainji, son of Shri Vallabhacharyaji.",
    "probable\nJames Hamilton, Duke of Châtellerault (d. 1572)",
    "James Hamilton, Duke of Châtellerault (d. 1572)"
  ],
  "deaths": [
    "January 20 – Juan Díaz de Solís, Spanish navigator and explorer (b. 1470)",
    "January 23 – King Ferdinand II of Aragon (b. 1452)[4]",
    "February 4 – Anthony of Supraśl, Polish Orthodox priest and saint",
    "March 13 – Vladislaus II, king of Bohemia, Hungary and Croatia (b. 1456)",
    "March 17 – Giuliano de' Medici, Duke of Nemours, ruler of Florence (b. 1449)",
    "April 25 – John Yonge, English diplomat (b. 1467)",
    "June 14 – King John III of Navarre (b. 1469)",
    "July 10 – Alice FitzHugh, English heir (b. 1448)",
    "July 30 – Johann V of Nassau-Vianden-Dietz, Dutch count (b. 1455)",
    "August 9 (bur.) – Hieronymus Bosch, Dutch painter (b. 1450)",
    "August 21 – John III of Egmont, Dutch count (b. 1438)",
    "August 24 – Al-Ashraf Qansuh al-Ghuri, Mamluk sultan (b. c. 1441)",
    "November 26 – Giovanni Bellini, Venetian painter (b. 1430)",
    "December 13 – Johannes Trithemius, German scholar and cryptographer (b. 1462)",
    "date unknown – Giuliano da Sangallo, Florentine sculptor and architect (b. 1443)"
  ]
}