{
  "events": [
    "January 19 – King Christian II of Denmark and Norway defeats the Swedes, at Lake Åsunden in Sweden. The Swedish regent Sten Sture the Younger is mortally wounded in the battle. He is rushed towards Stockholm, in order to lead the fight against the Danes from there, but dies from his wounds on February 3.[1]",
    "April 16 – Revolt of the Comuneros: Citizens of Toledo, Castile opposed to the rule of the Flemish-born Charles V, Holy Roman Emperor, rise up when the royal government attempts to unseat radical city councilors.",
    "June – Moctezuma II, Aztec ruler of Tenochtitlan, is declared deposed due to his captivity by conquistador Hernán Cortés. His brother Cuitláhuac rises to the throne.",
    "June 7 – King Henry VIII of England and King Francis I of France meet at the famous Field of the Cloth of Gold.[2]",
    "June 10 – Revolt of the Comuneros: Segovia is blockaded.",
    "June 15 – Pope Leo X issues the bull Exsurge Domine (Arise O Lord), threatening Martin Luther with excommunication, if he does not recant his position on indulgences and other Catholic doctrines.",
    "July 1 – La Noche Triste (Night of Sorrow): The forces of Cuitláhuac, Aztec ruler of Tenochtitlan, gain a major victory against the forces of conquistador Hernán Cortés. This results in the death of about 400 conquistadors, and some 2,000 of their Native American allies. However, Cortés and the most skilled of his men manage to escape and later regroup.",
    "July 7 – Otumba near Lake Texcaco: The Spaniards defeat the Aztecs. [3]",
    "August – Martin Luther writes To the Christian Nobility of the German Nation.",
    "September 7 – Christian II makes his triumphant entry into Stockholm, which had surrendered to him a few days earlier. Sten Sture's widow Christina Gyllenstierna, who has led the fight after Sten's death, and all other persons in the resistance against the Danes, are granted amnesty and are pardoned for their involvement in the resistance.",
    "September 22 – Suleiman I succeeds his father Selim I as Sultan of the Ottoman Empire.",
    "October – Cuitláhuac, Aztec ruler of Tenochtitlan, dies from smallpox. He is succeeded by his nephew Cuauhtémoc.",
    "October 21 (Feast of St. Ursula) – The islands of Saint Pierre and Miquelon are discovered by Portuguese explorer João Álvares Fagundes, off Newfoundland. He names them Islands of the 11,000 Virgins, in honour of Saint Ursula.",
    "October 26 – Charles V is crowned King of Germany.",
    "November 1–4 – Christian II is crowned king of Sweden. The coronation is followed by a three-day feast in Stockholm.",
    "November 7 – At the end of the third day of Christian's coronation feast, several leading figures of the Swedish resistance against the Danish invasion are imprisoned, and tried for high treason.",
    "November 8–10 – Stockholm Bloodbath: 82 noblemen and clergymen, having been sentenced to death for their involvement in the Swedish resistance against the Danish invasion, are executed by beheading.",
    "November 28 – After navigating through the South American strait, three ships under the command of Portuguese explorer Ferdinand Magellan reach the Pacific Ocean, becoming the first Europeans to sail from the Atlantic Ocean to the Pacific (the strait is later named the Strait of Magellan).",
    "December 10 – Martin Luther burns a copy of The Book of Canon Law (see Canon Law), and his copy of the Papal bull Exsurge Domine.",
    "The Franciscan friar Matteo Bassi is inspired to return to the primitive life of solitude and penance, as practiced by St. Francis, giving rise to the Order of Friars Minor Capuchin.",
    "Duarte Barbosa returns to Cananor.",
    "Aleksandra Lisowska (Roxelana) is given as a gift to Suleiman I on the occasion of his accession to the throne.",
    "King Manuel I creates the public mail service of Portugal, the Correio Público."
  ],
  "births": [
    "January 7 – Peder Oxe, Danish finance minister (d. 1575)",
    "January 30 – William More, English courtier (d. 1600)",
    "February 22 – Frederick III of Legnica, Duke of Legnica (d. 1570)",
    "March 3 – Matthias Flacius, Croatian Protestant reformer (d. 1575)",
    "June 29 – Nicolás Factor, Spanish artist (d. 1583)",
    "July 27 – Gonzalo II Fernández de Córdoba, Governor of the Duchy of Milan (d. 1578)",
    "August 1 – King Sigismund II Augustus of Poland (d. 1572)",
    "August 10 – Madeleine of Valois, queen of James V of Scotland (d. 1537)",
    "August 21 – Bartholomäus Sastrow, German official (d. 1603)",
    "August 31 – Heinrich Sudermann, German politician (d. 1591)",
    "September 13 – William Cecil, 1st Baron Burghley, English statesman, chief advisor to Queen Elizabeth I (d. 1598)[4]",
    "October 5 – Alessandro Farnese, Italian cardinal (d. 1589)",
    "November 10 – Dorothea of Denmark, Electress Palatine, Princess of Denmark, Sweden and Norway (d. 1580)",
    "December 6 – Barbara Radziwiłł, queen of Poland (d. 1551)",
    "December 24 – Martha Leijonhufvud, politically active Swedish noble (d. 1584)",
    "date unknown\nPatriarch Metrophanes III of Constantinople (d. 1580)\nSeosan, Korean monk\nJean Ribault, French navigator (d. 1565)\nVincenzo Galilei, Italian music theorist, lutenist, and composer (d. 1591)\nAben Humeya, last independent king of Granada (d. 1568)\nIjuin Tadaaki, Japanese nobleman (d. 1561)\nAgatha Streicher, German physician (d. 1581)\nKatarina Bengtsdotter Gylta, Swedish abbess  (d. 1593)\nJacques Cujas, French legal expert (d. 1590)\nJohannes Acronius Frisius, German doctor and mathematician (d. 1564)",
    "Patriarch Metrophanes III of Constantinople (d. 1580)",
    "Seosan, Korean monk",
    "Jean Ribault, French navigator (d. 1565)",
    "Vincenzo Galilei, Italian music theorist, lutenist, and composer (d. 1591)",
    "Aben Humeya, last independent king of Granada (d. 1568)",
    "Ijuin Tadaaki, Japanese nobleman (d. 1561)",
    "Agatha Streicher, German physician (d. 1581)",
    "Katarina Bengtsdotter Gylta, Swedish abbess  (d. 1593)",
    "Jacques Cujas, French legal expert (d. 1590)",
    "Johannes Acronius Frisius, German doctor and mathematician (d. 1564)",
    "probable\nHans Eworth, Flemish portrait painter (d. 1574)\nKatharina Gerlachin, German printer  (d. 1592)\nJorge de Montemor, Spanish novelist and poet (d. 1561)\nGiovanni Battista Moroni, Italian mannerist painter (d. 1578)",
    "Hans Eworth, Flemish portrait painter (d. 1574)",
    "Katharina Gerlachin, German printer  (d. 1592)",
    "Jorge de Montemor, Spanish novelist and poet (d. 1561)",
    "Giovanni Battista Moroni, Italian mannerist painter (d. 1578)",
    "possible\nCatherine Howard, Fifth Queen of Henry VIII of England, (born in between 1518 and 1524; d. 1542)",
    "Catherine Howard, Fifth Queen of Henry VIII of England, (born in between 1518 and 1524; d. 1542)"
  ],
  "deaths": [
    "January 10 – Jo Gwang-jo, Korean philosopher (b. 1482)",
    "February 3 – Sten Sture the Younger, Viceroy of Sweden (b. 1493)[5]",
    "February 7 – Alfonsina de' Medici, née Orsini, Regent of Florence (b. 1472)",
    "April 6 – Raphael, Italian painter and architect (b. 1483)[6]",
    "May 22 – Jan Lubrański, Polish bishop (b. 1456)",
    "June 24 – Hosokawa Sumimoto, Japanese samurai commander (b. 1489)",
    "June 29 – Moctezuma II, 9th Tlatoani (emperor) of the Aztecs, assassinated or possibly killed in a riot, 1502-1520 (b. 1466)[7]",
    "August 6 – Kunigunde of Austria, Archduchess of Austria (b. 1465)",
    "September 3 – Ippolito d'Este, Italian Catholic cardinal (b. 1479)",
    "September 22 – Selim I, Ottoman Sultan (b. 1465)[8]",
    "October – Cuitláhuac, 10th Tlatoani (emperor) of the Aztecs, 1520, brother of Moctezuma II, smallpox (b. c. 1476)[9]",
    "November 9 – Bernardo Dovizi, Italian Catholic cardinal (b. 1470)",
    "date unknown\nCacamatzin, king of Texcoco (altepetl) (modern Mexico) (b. 1483)[10]\nRatna Malla, first Raja of Kantipur\nVisoun, king of Lan Xang (b. 1465)\nSheikh Hamdullah, Ottoman calligrapher (b. 1436)\nClara Tott, German court singer (b. 1440)",
    "Cacamatzin, king of Texcoco (altepetl) (modern Mexico) (b. 1483)[10]",
    "Ratna Malla, first Raja of Kantipur",
    "Visoun, king of Lan Xang (b. 1465)",
    "Sheikh Hamdullah, Ottoman calligrapher (b. 1436)",
    "Clara Tott, German court singer (b. 1440)",
    "probable – Filippo de Lurano, Italian composer (b. 1475)"
  ]
}