{
  "events": [
    "January 3 – Pope Leo X excommunicates Martin Luther, in the papal bull Decet Romanum Pontificem.[1]",
    "January 22 – Charles V, Holy Roman Emperor, opens the Diet of Worms in Worms, Germany.[2]",
    "January 27 – Suleiman the Magnificent suppresses a revolt by the ruler of Damascus.",
    "February 2 – The Nydala Abbey Bloodbath takes place at Nydala Abbey, Sweden; the abbot and many monks are murdered by Danes.[3]",
    "March 6\nFerdinand Magellan makes first European contact with Guam.\nMartin Luther is summoned to appear before the Diet of Worms.",
    "Ferdinand Magellan makes first European contact with Guam.",
    "Martin Luther is summoned to appear before the Diet of Worms.",
    "March 16 – Ferdinand Magellan reaches the Philippines.",
    "March 31 – The First Mass in the Philippines is held.[4]",
    "April – The Battle of Tunmen occurs, in Tuen Mun (present-day Hong Kong), where the Ming Dynasty navy defeats the Portuguese navy. Arguably the first Sino-European battle in world history.",
    "April 7\nFerdinand Magellan arrives at Cebu.\nMartin Luther preaches an inflammatory sermon to students at Erfurt, while on his way to Worms.",
    "Ferdinand Magellan arrives at Cebu.",
    "Martin Luther preaches an inflammatory sermon to students at Erfurt, while on his way to Worms.",
    "April 16–18 – Martin Luther is examined before Emperor Charles V and the Diet of Worms, where he proclaims, \"Here I stand\", regarding his belief in the Bible alone, as the standard of Christian doctrine.",
    "April 24 – Revolt of the Comuneros – Battle of Villalar: Castilian royalists defeat the rebels and execute their three leaders.",
    "April 26 – Martin Luther leaves Worms and disappears for a year – he is rumored to be murdered, but is actually in hiding at the Wartburg castle.",
    "April 27 – Battle of Mactan: Ferdinand Magellan is killed in the Philippines.",
    "May – The Italian War of 1521–26 breaks out between Charles V, Holy Roman Emperor, and Francis I of France.",
    "May 17 – Edward Stafford, 3rd Duke of Buckingham, is executed for treason in London.",
    "May 20 – Battle of Pampeluna: Allied French-Navarrese forces defeat the Spanish.[5]",
    "May 25 – The Diet of Worms ends when Charles V, Holy Roman Emperor issues the Edict of Worms, declaring Martin Luther an outlaw.",
    "May 27 – Jiajing Emperor ascends the throne of the Ming Dynasty.",
    "June 25 – Suleiman the Magnificent begins the siege of Belgrade.",
    "June 29 or 30 – The oldest surviving dateable document written primarily in the Romanian language: Neacșu's letter, written by a trader from Câmpulung, to Johannes Benkner, the mayor of Brașov, warning that the Ottoman Empire is preparing its troops to cross into Wallachia and Transylvania; the script used is Romanian Cyrillic.",
    "June 30 – Battle of Esquiroz: French forces under Henri d'Albret, exiled King of Navarre, are defeated by the Spanish, and forced to abandon their attempt to recover Henri's kingdom.",
    "July – Pfaffensturm: Students rebel against priests in Erfurt.",
    "July 15 — San Juan Bautista is founded as the new capital of the archipelago of Puerto Rico.",
    "August 13 – Fall of Tenochtitlan: Cuauhtémoc surrenders to Cortés, thus incorporating the Aztec Empire into the Spanish Empire and ending the Late Postclassic period in Mesoamerica.",
    "August 29 – Belgrade is captured by the Ottoman army of Suleiman the Magnificent.",
    "October 25 – Revolt of the Comuneros is crushed.",
    "November 23 – Spanish–German–Papal forces under Prospero Colonna force French Marshal Odet de Lautrec to abandon Milan.",
    "December 27 – The Zwickau prophets arrive in Wittenberg, disturbing the peace and preaching the Apocalypse.",
    "Jacopo Berengario da Carpi publishes Commentaria cum amplissimus additionibus super anatomiam Mundini in Bologna, including observation of the vermiform appendix.[6]",
    "The Grand Duchy of Ryazan is annexed by the Grand Duchy of Moscow."
  ],
  "births": [
    "March 21 – Maurice, Elector of Saxony (d. 1553)",
    "April 5 – Francesco Laparelli, Italian architect (d. 1570)",
    "April 14 – Johann Marbach, German theologian (d. 1581)",
    "April 18 – François de Coligny d'Andelot, French general (d. 1569)",
    "May 8 – Petrus Canisius, Dutch Jesuit (d. 1597)",
    "May 10 – John Ernest, Duke of Saxe-Coburg, (d. 1553)",
    "June 18 – Maria of Portugal, Duchess of Viseu, daughter of King Manuel I (d. 1577)",
    "June 21 – John II, Duke of Schleswig-Holstein-Haderslev (d. 1580)",
    "August 4 – Pope Urban VII (d. 1590)[7]",
    "August 19 – Lodovico Guicciardini, Italian historian (d. 1589)",
    "October 1 – Frederick Magnus I, Count of Solms-Laubach, (d. 1561)",
    "November 22 – Edmund Sheffield, 1st Baron Sheffield, English baron (d. 1549)",
    "November 29 – Marcantonio Maffei, Italian Catholic archbishop and cardinal (d. 1583)",
    "December 1 – Takeda Shingen, Japanese warlord (d. 1573)",
    "December 13 – Pope Sixtus V (d. 1590)[8]",
    "date unknown\nAnne Askew, English Protestant martyr (d. 1546)\nJohn Aylmer, English divine (d. 1594)\nSue Harukata, Japanese retainer and later daimyō under Ouchi Yoshitaka (d. 1555)\nThomas Chaloner, English statesman and poet (d. 1565)\nPhilippe de Monte, Flemish composer (d. 1603)\nRokkaku Yoshikata, Japanese daimyō (d. 1598)\nThomas Wyatt the Younger, English rebel (d. 1554)",
    "Anne Askew, English Protestant martyr (d. 1546)",
    "John Aylmer, English divine (d. 1594)",
    "Sue Harukata, Japanese retainer and later daimyō under Ouchi Yoshitaka (d. 1555)",
    "Thomas Chaloner, English statesman and poet (d. 1565)",
    "Philippe de Monte, Flemish composer (d. 1603)",
    "Rokkaku Yoshikata, Japanese daimyō (d. 1598)",
    "Thomas Wyatt the Younger, English rebel (d. 1554)",
    "possible\nCatherine Howard, Fifth Queen of Henry VIII of England, (b. between 1518 and 1524; d. 1542)",
    "Catherine Howard, Fifth Queen of Henry VIII of England, (b. between 1518 and 1524; d. 1542)"
  ],
  "deaths": [
    "January 6 – Cardinal William de Croÿ (b. 1497)",
    "March 15 – John II, Duke of Cleves (b. 1458)",
    "April 20 – Zhengde Emperor of China (b. 1491)",
    "April 24 – Spanish rebels (executed)\nJuan López de Padilla\nJuan Bravo\nFrancisco Maldonado",
    "Juan López de Padilla",
    "Juan Bravo",
    "Francisco Maldonado",
    "April 27 – Ferdinand Magellan, Portuguese explorer (b. 1480)[9]",
    "April 28 – Suzanne, Duchess of Bourbon (b. 1491)",
    "May 10 – Sebastian Brant, German humanist and satirist (b. 1457)[10]",
    "May 17 – Edward Stafford, 3rd Duke of Buckingham (executed) (b. 1478)",
    "June 15 – Tamás Bakócz, Hungarian Catholic cardinal and statesman (b. 1442)",
    "June 22 – Leonardo Loredan, Doge of Venice (b. 1436)",
    "July 9 – Raffaele Riario, Italian cardinal (b. 1461)",
    "July 15 – Juan Ponce de León, Spanish conquistador (b. 1460)",
    "August 27 – Josquin des Prez, Flemish composer (b. c. 1450)",
    "October 7 – Margaret of Anhalt-Köthen, Princess of Anhalt by birth, Duchess consort of Saxony (b. 1494)",
    "October 22 – Edward Poynings, Lord Deputy to King Henry VII of England (b. 1459)",
    "October 24 – Robert Fayrfax, English Renaissance composer (b. 1464)",
    "November 2 – Margaret of Lorraine, French Duchess of Alençon, Roman Catholic nun and blessed (b. 1463)",
    "December 1 – Pope Leo X (b. 1475)[11]",
    "December 13 – King Manuel I of Portugal (b. 1469)",
    "December 21 – Domenico Spadafora, Italian Roman Catholic priest and blessed (b. 1450)",
    "1521 in art",
    "\n\t\t\t\n\t\t\t\nMarch–April: Ferdinand Magellan's voyage around the world.\n\n\t\t\t\n\t\t",
    "\n\t\t\t\n\t\t\t\nMay 25: Martin Luther outlawed.\n\n\t\t\t\n\t\t",
    "\n\t\t\t\n\t\t\t\nHans Maler zu Schwaz, Portrait of a beardless man with the inscription:„ALS MAN. 1521. ZALT. WAS. ICH. 33. IAR ALT“(mutatis mutandis to English: „as we had in 1521, I was 33 years old)\n\n\t\t\t\n\t\t",
    "\n\t\t\t\n\t\t\t\nLorenzo Lotto, Christ Taking Leave of His Mother\n\n\t\t\t\n\t\t"
  ]
}