{
  "events": [
    "January 20 – Christian II is forced to abdicate as King of Denmark and Norway.",
    "May – The Ningbo Incident: Two rival trade delegations from Japan feud in the Chinese city of Ningbo, resulting in the pillage and plunder of the city.",
    "June 3 – Santhome Church was established by Portuguese explorers over the tomb of Saint Thomas the Apostle in Chennai,India.",
    "June 6 – Gustav Vasa is elected king of Sweden, finally establishing the full independence of Sweden from Denmark, which marks the end of the Kalmar Union. This event is also traditionally considered to be the establishment of the modern Swedish nation.[1]",
    "c. July – Martin Luther's translation of the Pentateuch into German (Das allte Testament Deutsch) is published.",
    "July 1 – Jan van Essen and Hendrik Vos become the first Flemish Lutheran martyrs, burned at the stake by Roman Catholic authorities in Brussels.",
    "July 7 – Wijerd Jelckama, a Frisian warlord and military commander, is executed in Leeuwarden, ending the Frisian rebellion fought by the Arumer Black Heap.",
    "September 22 – Spanish conquest of Nicaragua: Agreement for an expedition by conquistadores into Nicaragua.",
    "November 19 – Following the death of Pope Adrian VI, the Medici cardinal is elected 219th pope as Clement VII.[2]",
    "The Ming dynasty Chinese navy captures two Western ships with Portuguese breech–loading culverins aboard, which the Chinese call a fo–lang–ji (Frankish culverin). According to the Ming Shi, these cannons are soon presented to the Jiajing Emperor by Wang Hong, and their design is copied in 1529.[3]",
    "Franconian War: The Swabian League destroys 23 robber baron castles.",
    "In northern Italy, a French army tries to recover Milan but fails due to an offensive by Spanish, Imperial and English troops."
  ],
  "births": [
    "January 29 – Enea Vico, Italian engraver (d. 1567)",
    "February 1 – Francesco Abbondio Castiglioni, Italian Catholic cardinal (d. 1568)",
    "February 13 – Valentin Naboth, German astronomer and mathematician (d. 1593)",
    "February 20 – Jan Blahoslav, Czech writer (d. 1571)",
    "March 17 – Giovanni Francesco Commendone, Italian Catholic cardinal (d. 1584)",
    "March 21 – Kaspar Eberhard, German theologian (d. 1575)",
    "April 5 – Blaise de Vigenère, French diplomat and cryptographer (d. 1596)",
    "April 21 – Marco Antonio Bragadin, Venetian lawyer and military officer (d. 1571)",
    "June 5 – Margaret of France, Duchess of Berry (d. 1574)",
    "July 4 – Pier Francesco Orsini, Italian condottiero and art patron (d. 1583)",
    "July 18 – Duke George II of Brieg (1547–1586) (d. 1586)",
    "September 21 – Sancho d'Avila, Spanish general (d. 1583)",
    "September 22 – Charles, Cardinal de Bourbon, French church leader and pretender to the throne (d. 1590)",
    "October 10 – Ludwig Rabus, German martyrologist (d. 1592)",
    "October 11 – Eleonore of Fürstenberg, wife of Philip IV, Count of Hanau-Lichtenberg (d. 1544)",
    "October 18 – Anna Jagiellon, daughter of Sigismund I of Poland (d. 1596)",
    "date unknown\nGabriele Falloppio, Italian anatomist and physician (d. 1562)\nMartín Cortés, Spanish conquistador (d. 1589)\nFrancisco Foreiro, Portuguese Dominican theologian and biblist (d. 1581)\nGaspara Stampa, Italian poet (d. 1554)",
    "Gabriele Falloppio, Italian anatomist and physician (d. 1562)",
    "Martín Cortés, Spanish conquistador (d. 1589)",
    "Francisco Foreiro, Portuguese Dominican theologian and biblist (d. 1581)",
    "Gaspara Stampa, Italian poet (d. 1554)",
    "probable – Crispin van den Broeck, Flemish painter (d. 1591)",
    "possible – Catherine Howard, fifth queen of Henry VIII of England, (b. between 1518 and 1524; executed 1542)"
  ],
  "deaths": [
    "February 4 – Thomas Ruthall, English chancellor of the University of Cambridge",
    "March 28 – Louis I, Count of Löwenstein, founder of the House of Löwenstein-Wertheim (b. 1463)",
    "April 6 – Henry Stafford, 1st Earl of Wiltshire, English nobleman (b. 1479)",
    "May 7\nAntonio Grimani, Italian admiral (b. 1434)\nFranz von Sickingen, German knight (b. 1481)",
    "Antonio Grimani, Italian admiral (b. 1434)",
    "Franz von Sickingen, German knight (b. 1481)",
    "May 23 – Ashikaga Yoshitane, Japanese shōgun (b. 1466)",
    "May 24 – Henry Marney, 1st Baron Marney, English politician (b. 1447)",
    "July 1 – Johann Esch and Heinrich Voes, Flemish Lutheran martyrs",
    "July 7 – Wijerd Jelckama, Frisian rebel and warlord (b. 1490)",
    "August 13 – Gerard David, Flemish artist (b. c. 1455)",
    "August 27 – Domenico Grimani, Italian nobleman (b. 1461)",
    "August 29 – Ulrich von Hutten, Lutheran reformer (b. 1488)",
    "September 14 – Pope Adrian VI (b. 1459)[4]",
    "October 5 – Bogislaw X, Duke of Pomerania (1474–1523) (b. 1454)",
    "October 11 – Bartolomeo Montagna, Italian painter (b. 1450)",
    "November 10 – Lachlan Cattanach Maclean, 11th Chief, Scottish clan chief (b. 1465)",
    "October – William Cornysh, English composer (b. 1465)",
    "date unknown\nCecilia Månsdotter, Swedish noble  (b. c. 1476)\nAlessandro Alessandri, Italian jurist (b. 1461)\nPietro Perugino, Italian painter (b. 1446)",
    "Cecilia Månsdotter, Swedish noble  (b. c. 1476)",
    "Alessandro Alessandri, Italian jurist (b. 1461)",
    "Pietro Perugino, Italian painter (b. 1446)"
  ]
}