{
  "events": [
    "January 17 – Florentine explorer Giovanni da Verrazzano, on board La Dauphine in the service of Francis I of France, sets out from Madeira for the New World, to seek out a western sea route to the Pacific Ocean.",
    "March – Spanish conquistador Pedro de Alvarado destroys the Kʼicheʼ kingdom of Qʼumarkaj, taking the capital, Quiché.",
    "March 1 (approximate date) – da Verrazzano's expedition makes landfall at Cape Fear.",
    "April 17 – Verrazzano's expedition makes the first European entry into New York Bay, and sights the island of Manhattan.[1][2]",
    "April 30 – Battle of the Sesia: Spanish forces under Charles de Lannoy defeat the French army in Italy, under William de Bonnivet. The French, now commanded by François de St. Pol, withdraw from the Italian Peninsula.",
    "May 26 – Atiquipaque, the most important city of the Xinca people is conquered by the Spanish resulting in a significant reduction in the Xinca population.",
    "June 8 – Battle of Acajutla: Spanish conquistador Pedro de Alvarado defeats a battalion of Pipiles, in the neighborhoods of present day Acajutla, El Salvador.[3]",
    "Summer – Paracelsus visits Salzburg; he also visits Villach during the year.",
    "July 8 – Verrazzano's expedition returns to Dieppe.",
    "August–September – Marseille is besieged by Imperial forces, under the Duke of Bourbon.",
    "August – Protestant theologians Martin Luther and Andreas Karlstadt dispute at Jena.",
    "October 28 – A French army invading Italy, under King Francis, besieges Pavia.",
    "December 8 – Francisco Hernandez de Cordoba founds the city of Granada, Nicaragua, the oldest Hispanic city in the mainland of the Western Hemisphere.",
    "The first Dalecarlian rebellions break out in Sweden."
  ],
  "births": [
    "February 10 – Albrecht Giese, German politician and diplomat (d. 1580)",
    "February 17 – Charles, Cardinal of Lorraine, French cardinal (d. 1574)",
    "May 28 – Selim II, Ottoman Sultan (d. 1574)",
    "June 12 – Achilles Statius, Portuguese humanist (d. 1581)",
    "June 24 – Johann Stössel, German theologian (d. 1576)",
    "August 23 – François Hotman, French Protestant lawyer and writer (d. 1590)[4]",
    "September 7 – Thomas Erastus, Swiss theologian (d. 1583)",
    "September 11 – Pierre de Ronsard, French poet (d. 1585)",
    "October 4 – Francisco Vallés, Spanish physician (d. 1592)",
    "October 5 – Rani Durgavati, Queen of Gond (d. 1564)",
    "October 9 – Ottavio Farnese, Duke of Parma (d. 1586)",
    "October 14 – Elizabeth of Denmark, Duchess of Mecklenburg, Danish princess (d. 1586)",
    "October 16 – Nicolas, Duke of Mercœur, French Catholic bishop (d. 1577)",
    "November 12 – Diego de Landa, Bishop of the Yucatán (d. 1579)",
    "date unknown\nJan Borukowski, royal secretary of Poland (d. 1584)\nArmand de Gontaut, baron de Biron, French soldier (d. 1592)\nJean Pithou, French lawyer and author (d. 1602); and his twin brother, Nicolas Pithou, French lawyer and author (d. 1598)\nJoseph Nasi, Portuguese Sephardi diplomat and administrator (d. 1579)\nThomas Tusser, English poet and farmer (d. 1580)\nLuís de Camões, Portuguese poet (d. 1580)[5]\nPlautilla Nelli, Italian painter (d. 1588)\nWenceslaus III Adam, Duke of Cieszyn (d. 1579)\nCatherine Carey, cousin of Elizabeth I of England (d. 1569)\nGuyonne de Laval, French Huguenot magnate (d. 1567)",
    "Jan Borukowski, royal secretary of Poland (d. 1584)",
    "Armand de Gontaut, baron de Biron, French soldier (d. 1592)",
    "Jean Pithou, French lawyer and author (d. 1602); and his twin brother, Nicolas Pithou, French lawyer and author (d. 1598)",
    "Joseph Nasi, Portuguese Sephardi diplomat and administrator (d. 1579)",
    "Thomas Tusser, English poet and farmer (d. 1580)",
    "Luís de Camões, Portuguese poet (d. 1580)[5]",
    "Plautilla Nelli, Italian painter (d. 1588)",
    "Wenceslaus III Adam, Duke of Cieszyn (d. 1579)",
    "Catherine Carey, cousin of Elizabeth I of England (d. 1569)",
    "Guyonne de Laval, French Huguenot magnate (d. 1567)",
    "possible\nCatherine Howard, fifth queen of Henry VIII of England, (b. between 1518 and 1524; d. 1542)",
    "Catherine Howard, fifth queen of Henry VIII of England, (b. between 1518 and 1524; d. 1542)"
  ],
  "deaths": [
    "January 5 – Marko Marulić, Croatian poet (b. 1450)",
    "January 6 – Amalie of the Palatinate, duchess consort of Pomerania (b. 1490)",
    "February 10 – Catherine of Saxony, Archduchess of Austria (b. 1468)",
    "February 11 – Isabella of Aragon, Duchess of Milan, daughter of King Alfonso II of Naples (b. 1470)",
    "February 20 – Tecun Uman, Kʼicheʼ Mayan ruler (b. c. 1500)",
    "March 28\nElisabeth of Brandenburg, Duchess of Württemberg (b. 1451)\nIngrid Persdotter, Swedish nun and letter writer",
    "Elisabeth of Brandenburg, Duchess of Württemberg (b. 1451)",
    "Ingrid Persdotter, Swedish nun and letter writer",
    "April 14 – William Conyers, 1st Baron Conyers, English baron (b. 1468)",
    "April 30 – Pierre Terrail, seigneur de Bayard, French soldier (b. 1473)",
    "May 17 – Francesco Soderini, Italian Catholic cardinal (b. 1453)",
    "May 21 – Thomas Howard, 2nd Duke of Norfolk, English soldier and statesman (b. 1443)",
    "May 23 – Ismail I, Safavid dynasty Shah of Persia (b. 1487)",
    "May 31 – Camilla Battista da Varano, Italian Roman Catholic nun and saint (b. 1458)",
    "June 12 – Diego Velázquez de Cuéllar, Spanish conquistador (b. 1465)",
    "July 9 – Sibylle of Brandenburg, Duchess of Jülich and Berg (b. 1467)",
    "July 20 – Claude of France, queen consort of Francis I of France (b. 1499)",
    "August 4 – Helen of the Palatinate, Duchess of Pomerania (b. 1493)",
    "August 24 – Sir William Scott, English Lord Warden of the Cinque Ports (b. 1459)",
    "September 18 – Charlotte of Valois, French princess (b. 1516)",
    "October 5 – Joachim Patinir, Flemish landscape painter (b. c. 1480)",
    "October 20 – Thomas Linacre, English humanist and physician (b. 1460)",
    "October 26 – Philip II, Count of Waldeck-Eisenberg (1486–1524) (b. 1453)",
    "November 12 – Juan Rodríguez de Fonseca, Spanish archbishop and courtier (b. 1451)",
    "December 24 – Vasco da Gama, Portuguese explorer (b. c. 1469)[6]",
    "date unknown\nHans Holbein the Elder, German painter (b. 1460)\nAndrea Solari, Italian painter (b. 1460)\nTang Yin, Chinese painter (b. 1470)",
    "Hans Holbein the Elder, German painter (b. 1460)",
    "Andrea Solari, Italian painter (b. 1460)",
    "Tang Yin, Chinese painter (b. 1470)"
  ]
}