{
  "events": [
    "January 21 – The Swiss Anabaptist Movement is born when Conrad Grebel, Felix Manz, George Blaurock, and about a dozen others baptize each other in the home of Manz's mother on Neustadt-Gasse, Zürich, breaking a thousand-year tradition of church-state union.",
    "February 24 – Battle of Pavia: German and Spanish forces under Charles de Lannoy and the Marquis of Pescara defeat the French army, and capture Francis I of France, after his horse is wounded by Cesare Hercolani. While Francis is imprisoned in Lombardy and then transferred to Madrid, the first attempts to form a Franco-Ottoman alliance with Suleiman the Magnificent against the Habsburg Empire are made.[1]",
    "February 28 – The last Aztec Emperor, Cuauhtémoc, is killed by Hernán Cortés.",
    "March 20 – In the German town of Memmingen, the pamphlet The Twelve Articles: The Just and Fundamental Articles of All the Peasantry and Tenants of Spiritual and Temporal Powers by Whom They Think Themselves Oppressed is published, the first human rights related document written in Europe.",
    "April 4 – German Peasants' War in the Holy Roman Empire: Battle of Leipheim – Peasants retreat.",
    "April 10 – Albert, Duke of Prussia commits Prussian Homage.",
    "May 14–15 –  German Peasants' War: Battle of Frankenhausen – Insurgent peasants led by radical pastor Thomas Müntzer are defeated.",
    "June 13 – Martin Luther marries ex-nun Katharina von Bora.[2] The painter Lucas Cranach the Elder is one of the witnesses.",
    "June 16 – Henry VIII of England appoints his six-year old illegitimate son Henry FitzRoy Duke of Richmond and Somerset.",
    "June 23–24 – German Peasants' War: Battle of Pfeddersheim – Peasants defeated in the last significant action of the war, in which over 75,000 peasants have been killed.",
    "July 29 – Santa Marta, the first city in Colombia, is founded by Spanish conquistador Rodrigo de Bastidas.",
    "December – The first French ambassador to reach the Sublime Porte, Jean Frangipani, sets out for Constantinople.",
    "Mixco Viejo, capital of the Pocomans Maya State, falls to the Spanish conquistadores of Pedro de Alvarado (in modern-day Guatemala) after a three-month siege.",
    "European-brought diseases sweep through the Andes, killing thousands, including the Inca.",
    "The Bubonic plague spreads in southern France.",
    "Printing of the first edition of William Tyndale's New Testament Bible translation into English in Cologne is interrupted by anti-Lutheran forces (finished copies reach England in 1526).",
    "The Navarre witch trials (1525-26) begin.",
    "The Chinese Ministry of War under the Ming dynasty orders ships having more than one mast sailing along the southeast coast to be seized, investigated, and destroyed; this in an effort to curb piracy and limit private commercial trade abroad.",
    "Kasur established as a city by the Kheshgi tribe of Pashtuns from Kabul who migrate to the region in 1525 from Afghanistan.",
    "The Age of Samael ends, and the Age of Gabriel begins, according to Johannes Trithemius."
  ],
  "births": [
    "January 29 – Lelio Sozzini, Italian Renaissance humanist and anti-Trinitarian reformer (d. 1562)",
    "February 5 – Juraj Drašković, Croatian Catholic cardinal (d. 1587)",
    "March 19 – Caspar Cruciger the Younger, German theologian (d. 1597)",
    "March 25 – Richard Edwardes, English choral musician, playwright and poet (d. 1566)",
    "March 26 – Katharina of Hanau, Countess of Wied, German noblewoman (d. 1581)",
    "June 1 – Caspar Peucer, German reformer (d. 1602)[3]",
    "June 29 – Peter Agricola, German Renaissance humanist, educator, classical scholar, theologian, diplomat and statesman (d. 1585)",
    "September 1 – Christoffer Valkendorff, Danish politician (d. 1601)",
    "September 11 – John George, Elector of Brandenburg (d. 1598)",
    "September 25 – Steven Borough, English explorer (d. 1584)",
    "November 7 – Georg Cracow, German lawyer and politician (d. 1575)",
    "December 1 – Tadeáš Hájek, Czech astronomer (d. 1600)",
    "December 23 – John Albert I, Duke of Mecklenburg (d. 1576)",
    "date unknown\nMaharal of Prague, Talmudic scholar, Jewish mystic and philosopher (d. 1609)\nMelchor Cano, Spanish theologian (d. 1560)\nEdward Sutton, 4th Baron Dudley (d. 1586)",
    "Maharal of Prague, Talmudic scholar, Jewish mystic and philosopher (d. 1609)",
    "Melchor Cano, Spanish theologian (d. 1560)",
    "Edward Sutton, 4th Baron Dudley (d. 1586)",
    "probable\nPieter Bruegel the Elder, Flemish painter (d. 1569)[4]\nBaldassare Donato, Italian composer and singer (d. 1603)\nGiovanni Pierluigi da Palestrina, Italian composer (d. 1594)\nHans Staden, German soldier and sailor (d. 1579)",
    "Pieter Bruegel the Elder, Flemish painter (d. 1569)[4]",
    "Baldassare Donato, Italian composer and singer (d. 1603)",
    "Giovanni Pierluigi da Palestrina, Italian composer (d. 1594)",
    "Hans Staden, German soldier and sailor (d. 1579)"
  ],
  "deaths": [
    "January 24 – Franciabigio, Florentine painter (b. 1482)",
    "February 24 (in action at the Battle of Pavia)\nGuillaume Gouffier, seigneur de Bonnivet, French soldier (b. c. 1488)\nJacques de La Palice, French nobleman and military officer (b. 1470)\nRichard de la Pole, last Yorkist claimant to the English throne (b. 1480)\nLouis II de la Trémoille, French military leader (b. 1460)[5]\nBartolomeo Fanfulla, Italian mercenary (b. 1477)\nRené de Brosse, French noble",
    "Guillaume Gouffier, seigneur de Bonnivet, French soldier (b. c. 1488)",
    "Jacques de La Palice, French nobleman and military officer (b. 1470)",
    "Richard de la Pole, last Yorkist claimant to the English throne (b. 1480)",
    "Louis II de la Trémoille, French military leader (b. 1460)[5]",
    "Bartolomeo Fanfulla, Italian mercenary (b. 1477)",
    "René de Brosse, French noble",
    "February 28 – Cuauhtémoc, last Tlatoani of the Aztec Empire (b. c. 1495)[6]",
    "April 3 – Giovanni di Bernardo Rucellai, Italian Renaissance man of letters (b. 1475)",
    "May 5 – Frederick III, Elector of Saxony (b. 1463)[7]",
    "May 12 – Anna of Mecklenburg-Schwerin, Mecklenburgian royal (b. 1485)",
    "May 18 – Pietro Pomponazzi, Italian philosopher (b. 1462)",
    "May 27 – Thomas Müntzer, German pastor and rebel leader (b. 1489) (executed)",
    "July 5 – Johann of Brandenburg-Ansbach, Viceroy of Valencia, German noble (b. 1493)",
    "July 22 – Richard Wingfield, English diplomat (b. c. 1456)",
    "August 4 – Andrea della Robbia, Italian artist (b. 1435)",
    "October 24 – Thomas Dacre, 2nd Baron Dacre, Knight of Henry VIII of England (b. 1467)",
    "November 17 – Eleanor of Viseu, queen of João II of Portugal (b. 1458)",
    "December 30 – Jakob Fugger, German banker (b. 1459)",
    "date unknown\nNicholas Storch, German weaver and reformer",
    "Nicholas Storch, German weaver and reformer",
    "probable\nJean Lemaire de Belges, Walloon poet and historian (b. 1473)\nAnna Bielke, Swedish noble and commander (b. 1490)",
    "Jean Lemaire de Belges, Walloon poet and historian (b. 1473)",
    "Anna Bielke, Swedish noble and commander (b. 1490)"
  ]
}