{
  "events": [
    "January 14 – Treaty of Madrid: Peace is declared between Francis I of France and Charles V, Holy Roman Emperor. Francis agrees to cede Burgundy and abandons all claims to Flanders, Artois, Naples, and Milan.[1]",
    "April 21 – Battle of Panipat: Babur becomes Mughal emperor, invades northern India and captures Delhi, beginning the richest dynasty in the world, the Mughal Empire, which lasts until 1857.",
    "May 22 – Francis repudiates the Treaty of Madrid and forms the League of Cognac against Charles, including Pope Clement VII, Milan, Venice, and Florence.",
    "May 24 – A transit of Venus occurs, the last before optical filters allow astronomers to observe them.",
    "June 9 – Emperor Go-Nara ascends to the throne of Japan.",
    "July – The Spanish ship Santiago, from García Jofre de Loaísa's expedition, reaches the Pacific Coast of Mexico, the first to navigate from Europe to the west coast of North America.",
    "July 24 – Milan is captured by the Spanish.",
    "August 21 – Spanish explorer Alonso de Salazar becomes the first European to sight the Marshall Islands, in the Pacific Ocean.[2]",
    "August 29 – Battle of Mohács: The Ottoman army of Sultan Suleiman I defeats the Hungarian army of King Louis II, who is killed in the retreat. Suleiman takes Buda, while Archduke Ferdinand of Austria and John Zápolya, Prince of Transylvania, dispute the succession. As a result of the battle, Dubrovnik achieves independence, although it acknowledges Turkish overlordship.",
    "December – Paracelsus arrives at Strasbourg.",
    "Spring – The first complete printed translation of the New Testament of the Bible into the English language by William Tyndale arrives in England from Germany, printing having been completed in Worms by Peter Schöffer the younger (with other copies being printed in Amsterdam). In October, Cuthbert Tunstall, Bishop of London, attempts to collect all the copies in his diocese and burn them.",
    "The first official translation is made of the New Testament into Swedish; the entire Bible is completed in 1541.",
    "Gunsmith Bartolomeo Beretta (in Italian) establishes the Beretta Gun Company, which will still be in business in the 21st century, making it one of the world's oldest corporations.",
    "Spanish conquistadors led by Francisco Pizarro and his brothers first reach Inca territory in South America."
  ],
  "births": [
    "January 1 – Louis Bertrand, Spanish missionary to Latin America, patron saint of Colombia (d. 1581)",
    "January 20 – Rafael Bombelli, Italian mathematician (d. 1572)",
    "January 25 – Adolf, Duke of Holstein-Gottorp (d. 1586)",
    "February 1 – Niiro Tadamoto, Japanese samurai (d. 1611)",
    "February 2 – Konstanty Wasyl Ostrogski, Polish noble (d. 1608)",
    "February 19 – Charles de L'Ecluse, Flemish botanist (d. 1609)",
    "February 23 – Gonçalo da Silveira, Portuguese Jesuit missionary (d. 1561)",
    "March 4 – Henry Carey, 1st Baron Hunsdon (d. 1596)",
    "March 11 – Heinrich Rantzau, German humanist writer, astrologer, and astrological writer (d. 1598)",
    "April 5 – Giuseppe Arcimboldo, Italian painter (d. 1566)",
    "April 8 – Elisabeth of Brunswick-Calenberg, Countess of Henneberg (d. 1566)",
    "April 12 – Muretus, French humanist (d. 1585)",
    "April 30 – Beate Clausdatter Bille, Danish noblewoman (d. 1593)",
    "June 9 – Matsudaira Hirotada, Japanese daimyō (d. 1549)",
    "June 25 – Elisabeth Parr, Marchioness of Northampton, English noble (d. 1565)",
    "July 9 – Elizabeth of Austria, Polish noble (d. 1545)",
    "July 10 – Philipe de Croÿ, Duke of Aerschot (d. 1595)",
    "July 31 – Augustus, Elector of Saxony (d. 1586)",
    "August 18 – Claude, Duke of Aumale, third son of Claude (d. 1573)",
    "August 22 – Adolph of Nassau-Saarbrücken, Count of Nassau (d. 1559)",
    "September 23 – Henry Manners, 2nd Earl of Rutland (d. 1563)",
    "September 26 – Wolfgang, Count Palatine of Zweibrücken (d. 1569)",
    "October 1 – Dorothy Stafford, English noble (d. 1604)",
    "October 30 – Hubert Goltzius, Dutch Renaissance painter-engraver (d. 1583)",
    "November 1 – Catherine Jagiellon, queen of John III of Sweden (d. 1583)",
    "November 12 – Andreas Gaill, German jurist and statesman (d. 1587)",
    "December 12 – Álvaro de Bazán, 1st Marquis of Santa Cruz, Spanish admiral (d. 1588)",
    "December 26 – Rose Lok, English businesswoman and Protestant exile during the Tudor period (d. 1613)",
    "December 28 – Anna Maria of Brandenburg-Ansbach, German princess (d. 1589)",
    "date unknown\nKenau Simonsdochter Hasselaer, Dutch war heroine (d. 1588)\nIkoma Chikamasa, Japanese daimyō in the Azuchi-Momoyama and Edo periods (d. 1603)\nAzai Hisamasa, Japanese warlord (d. 1573)",
    "Kenau Simonsdochter Hasselaer, Dutch war heroine (d. 1588)",
    "Ikoma Chikamasa, Japanese daimyō in the Azuchi-Momoyama and Edo periods (d. 1603)",
    "Azai Hisamasa, Japanese warlord (d. 1573)",
    "probable\nTaqi ad-Din Muhammad ibn Ma'ruf, Ottoman Muslim scientist (d. 1585)\nHenry Manners, 2nd Earl of Rutland, Lord Lieutenant of Nottinghamshire (d. 1563)",
    "Taqi ad-Din Muhammad ibn Ma'ruf, Ottoman Muslim scientist (d. 1585)",
    "Henry Manners, 2nd Earl of Rutland, Lord Lieutenant of Nottinghamshire (d. 1563)"
  ],
  "deaths": [
    "January 16 – Catherine of the Palatinate, Abbess of Neuburg am Neckar (b. 1499)",
    "January 19 – Isabella of Burgundy, queen of Christian II of Denmark (b. 1501)",
    "February 23 – Diego Colón, Spanish Viceroy of the Indies (b. c. 1479)",
    "March 15 – Charles Somerset, 1st Earl of Worcester (b. 1460)",
    "March 24 – Adolph II, Prince of Anhalt-Köthen, German prince (b. 1458)",
    "March 30 – Konrad Mutian, German humanist (b. 1471)",
    "April 21 – Ibrahim Lodi, last Sultan of Delhi (in battle)",
    "May 19 – Emperor Go-Kashiwabara of Japan (b. 1464)",
    "June 4 – Francisco Fernández de la Cueva, 2nd Duke of Alburquerque, Spanish duke (b. 1467)",
    "July 14 – John de Vere, 14th Earl of Oxford, English noble (b. 1499)",
    "July 20 – García Jofre de Loaísa, Spanish explorer (b. 1490)",
    "August 4 – Juan Sebastián Elcano, Spanish explorer (b. 1476)",
    "August 29 – King Louis II of Hungary and Bohemia (in battle) (b. 1506)",
    "September 5 – Alonso de Salazar, Spanish explorer",
    "October 18 – Lucas Vázquez de Ayllón, Spanish explorer (b. 1480)",
    "November 5 – Scipione del Ferro, Italian mathematician (b. 1465)",
    "November 30 – Giovanni dalle Bande Nere, Italian condottiero (b. 1498)",
    "December 12 – Le Chieu Tong, Emperor of Đại Việt, was killed by Mạc Đăng Dung (b. 1506)",
    "date unknown\nAbu Bakr ibn Muhammad, sultan of Adal (assassinated)\nFrancisco Hernández de Córdoba, founder of the Spanish colony of Nicaragua (b. c. 1475)\nThado Minsaw of Prome, Burmese king of Prome\nBinnya Ran II, Burmese king of Hanthawaddy (b. 1469)\nConrad Grebel, co-founder of the Anabaptist movement (b. 1498)",
    "Abu Bakr ibn Muhammad, sultan of Adal (assassinated)",
    "Francisco Hernández de Córdoba, founder of the Spanish colony of Nicaragua (b. c. 1475)",
    "Thado Minsaw of Prome, Burmese king of Prome",
    "Binnya Ran II, Burmese king of Hanthawaddy (b. 1469)",
    "Conrad Grebel, co-founder of the Anabaptist movement (b. 1498)"
  ]
}