{
  "events": [
    "January 26 – Lisbon, Portugal is hit by an earthquake, in which thousands die.[1]",
    "February 27 – Lutheran princes in the Holy Roman Empire form an alliance known as the Schmalkaldic League.",
    "February or March – Battle of Antukyah: Ahmad ibn Ibrahim al-Ghazi of the Adal Sultanate defeats the Ethiopian army.",
    "April – Battle of Puná: Francisco Pizarro defeats the island's native inhabitants.[2]",
    "April 12 – Askiya Musa is assassinated by his brothers in Songhai; Askia Mohammad Benkan is enthroned the same day.",
    "April 16 – The city of Puebla, Mexico, is founded.",
    "May – The third Dalecarlian rebellion in Sweden appears to be over, when the king accepts an offer made by the rebels, but violence flares up again the following year.",
    "June 24 – The city of San Juan del Río, Mexico, is founded.",
    "July 25 – The city of Santiago de Querétaro, Mexico is founded.",
    "August 22 – Battle of Obertyn: The Moldavians are defeated by Polish forces under Jan Tarnowski, allowing the Poles to recapture Pokucie.[3]",
    "August 26 – Comet Halley achieves its perihelion.[4]",
    "October 11 – Battle of Kappel: The forces of Zürich are defeated by the Catholic cantons. Huldrych Zwingli, the Swiss religious reformer, is killed.[5]",
    "October 28 – Battle of Amba Sel: Imam Ahmad ibn Ibrahim al-Ghazi again defeats the army of Dawit II, Emperor of Ethiopia. The southern part of Ethiopia thus falls under Imam Ahmad's control.",
    "November – Christian II`s invasion force arrives in Oslo.",
    "December 9 – The Virgin of Guadalupe first appears to Juan Diego at Tepeyac, Mexico City.",
    "December 12 – Mary, mother of Jesus, in the guise of Our Lady of Guadalupe, appears imprinted on the tilmàtli of Juan Diego Cuauhtlatoatzin, an Aztec convert to Catholicism, in Tepeyac near Mexico City.",
    "Andrea Alciato publishes the first part of his Emblemata.",
    "Conquistador Francisco de Montejo claims Chichen Itza as capital of Spanish-ruled Yucatán.",
    "The University of Sarajevo is founded by Gazi Husrev-beg.",
    "Kõpu Lighthouse is completed.",
    "An enormous drought in Henan province, China, coupled with a gigantic swarm of locusts in the summer, forces many in destitute agricultural communities to turn to cannibalism instead of dying by starvation.",
    "Charles V, Holy Roman Emperor abolishes the worst abuses of the encomienda system, by pressure of Bartolomé de las Casas.",
    "A witch-hunt is conducted in the town of Schiltach, Germany."
  ],
  "births": [
    "January 26 – Jens Bille, Danish son of Claus Bille and Lisbeth Ulfstand (d. 1575)",
    "April 6 – Wolfgang, Duke of Brunswick-Grubenhagen (d. 1595)",
    "May 15 – Maria of Austria, Duchess of Jülich-Cleves-Berg, daughter of Emperor Ferdinand I (d. 1581)",
    "May 20 – Viceroy Thado Minsaw of Ava (d. 1584)",
    "June 1 – János Zsámboky, Hungarian scholar (d. 1584)",
    "July 17 – Antoine de Créqui Canaples, French Catholic cardinal (d. 1574)",
    "July 22 – Leonhard Thurneysser, German scholar and quack at the court of John George, Elector of Brandenburg (d. 1595)",
    "September 2 – Francesco Cattani da Diacceto, Bishop of Fiesole (d. 1595)",
    "September 4 – Hans Fugger, German businessman (d. 1598)",
    "September 14 – Philipp Apian, German mathematician and medic (d. 1589)",
    "Late September – Henry Stanley, 4th Earl of Derby, English noble and diplomat (d. 1594)",
    "October 7 – Scipione Ammirato, Italian historian (d. 1601)",
    "October 12 – Jacques de Savoie, 2nd Duc de Nemours (d. 1585)",
    "October 25 – Matthew Wesenbeck, Belgian jurist (d. 1586)",
    "October 27 – Herbert Duifhuis, Dutch minister (d. 1581)",
    "November 14 – Richard Topcliffe, English torturer (d. 1604)[6]",
    "November 16 – Anna d'Este, duchess consort of Nemours (d. 1607)",
    "November 18 – Roberto di Ridolfi, Italian conspirator against Elizabeth I of England (d. 1612)",
    "November 29 – Johannes Letzner, German Protestant priest and historian (d. 1613)",
    "December – Hendrick van Brederode, Dutch noble (d. 1568)",
    "December 6 – Vespasiano I Gonzaga, Italian noble and diplomat (d. 1591)",
    "December 9 – Şehzade Cihangir, Ottoman prince (d. 1553)",
    "December 10 – Henry IX, Count of Waldeck (d. 1577)",
    "date unknown\nAkiyama Nobutomo, Japanese nobleman (d. 1575)\nAntónio, Prior of Crato, claimant to the throne of Portugal (d. 1595)\nJohn Popham, Lord Chief Justice of England (d. 1607)",
    "Akiyama Nobutomo, Japanese nobleman (d. 1575)",
    "António, Prior of Crato, claimant to the throne of Portugal (d. 1595)",
    "John Popham, Lord Chief Justice of England (d. 1607)"
  ],
  "deaths": [
    "January 14 – Walraven II van Brederode, Dutch noble (b. 1462)",
    "January 31 – Edward Sutton, 2nd Baron Dudley (b. 1460)",
    "February 16 – Johannes Stöffler, German mathematician (b. 1452)",
    "March 6 – Pedrarias Dávila, Spanish colonial administrator (b. c. 1440)",
    "May 19 – Jan Łaski, Polish statesman and diplomat (b. 1456)",
    "May 20 – Guy XVI, Count of Laval (b. 1476)",
    "May 10 – George I, Duke of Pomerania from the House of Griffins (b. 1493)",
    "July 7 – Tilman Riemenschneider, German sculptor (b. 1460)",
    "July 17 – Hosokawa Takakuni, Japanese military commander (b. 1484)",
    "July 23 – Louis de Brézé, seigneur d'Anet, Marshal of Normandy and husband of Diane de Poitiers",
    "August 30 – Diego Hurtado de Mendoza, 3rd Duke of the Infantado, Spanish noble (b. 1461)",
    "September 16 – Lorenzo Pucci, Italian Catholic cardinal (b. 1458)",
    "September 22 – Louise of Savoy, French regent (b. 1476)[7]",
    "October 11 – Huldrych Zwingli, Swiss reformer (in battle) (b. 1484)[5]",
    "November 24 – Johannes Oecolampadius, German religious reformer (b. 1482)",
    "November 28 – Hedwig of Münsterberg-Oels, German noble (b. 1508)",
    "December 1 – Maud Green, English noble (b. 1492)",
    "date unknown\nMaría Pacheco, Spanish heroine and defender of Toledo (b. 1496)\nEva von Isenburg, sovereign Princess Abbess of Thorn Abbey\nBars Bolud Jinong, Mongol khan (b. 1490)\nVallabha Acharya, Indian founder of the Hindu Vallabha sect (b. 1479)\nGerónimo de Aguilar, Spanish Franciscan friar who participated in the Spanish conquest of Mexico (b. 1489)",
    "María Pacheco, Spanish heroine and defender of Toledo (b. 1496)",
    "Eva von Isenburg, sovereign Princess Abbess of Thorn Abbey",
    "Bars Bolud Jinong, Mongol khan (b. 1490)",
    "Vallabha Acharya, Indian founder of the Hindu Vallabha sect (b. 1479)",
    "Gerónimo de Aguilar, Spanish Franciscan friar who participated in the Spanish conquest of Mexico (b. 1489)",
    "probable\nFernan Perez de Oliva, Spanish man of letters (b. 1492)\nAntonio Pigafetta, Italian navigator (b. 1491)",
    "Fernan Perez de Oliva, Spanish man of letters (b. 1492)",
    "Antonio Pigafetta, Italian navigator (b. 1491)"
  ]
}