{
  "events": [
    "January 25 – King Henry VIII of England formally but secretly marries Anne Boleyn, who becomes his second queen consort.[1]",
    "January 26 – Thomas Audley, 1st Baron Audley of Walden, is appointed Lord Chancellor of England.",
    "March 30 – Thomas Cranmer becomes Archbishop of Canterbury.[2]",
    "April – The Statute in Restraint of Appeals in England declares the king to be the supreme sovereign and forbids judicial appeals to the papacy.",
    "May 23 – King Henry VIII of England's marriage with Catherine of Aragon is declared annulled by Archbishop Cranmer. Since Pope Clement VII had rejected Henry's petition for annulment in 1530, Catherine continues to believe herself Henry's wife until her death.",
    "June 1 – Cranmer crowns Anne Boleyn as queen consort of England, in Westminster Abbey.[3]",
    "July 11 – Henry VIII is excommunicated by Pope Clement VII, as is Archbishop Cranmer.[4]",
    "July 22 – Treaty of Constantinople between the Ottoman Empire and the Archduchy of Austria: Ferdinand I, King of the Romans, withdraws his claims to most of Hungary and János Szapolyai, voivode of Transylvania, becomes King of Hungary under the suzerainty of Suleiman the Magnificent, Sultan of the Ottoman Empire.",
    "July 26 – Sapa Inca Atahualpa is executed by garotte, at the orders of Francisco Pizarro in Cajamarca. The Spanish arrange for his younger brother Túpac Huallpa to be crowned as a successor, but he dies of smallpox soon afterwards.",
    "October 28 – The 14-year olds Henry, Duke of Orléans – the future King Henry II of France – and Catherine de' Medici are married at the Église Saint-Ferréol les Augustins in Marseille.",
    "November 15 – Francisco Pizarro arrives in Cusco, Peru.",
    "December 3 – Ivan IV succeeds his father Vasili III as Grand Prince of Muscovy at the age of three years.",
    "December – Hernando de Grijalva and his crew discover the uninhabited Revillagigedo Islands, off the Pacific coast of Mexico.\nDecember 21 (Feast of St Thomas the Apostle) – They discover Isla Santo Tomé, probably Socorro Island.\nDecember 28 – They discover Isla de los Inocentes, probably San Benedicto Island.[5]",
    "December 21 (Feast of St Thomas the Apostle) – They discover Isla Santo Tomé, probably Socorro Island.",
    "December 28 – They discover Isla de los Inocentes, probably San Benedicto Island.[5]",
    "Paracelsus interprets the Bible in Appenzell.",
    "Pechenga Monastery is founded, in the far north of the Grand Duchy of Moscow.",
    "1533–1534 – Sultan Suleiman the Magnificent makes the Ruthenian harem girl Roxelana his legal wife."
  ],
  "births": [
    "January 2 – Johann Major, German poet and theologian (d. 1600)",
    "January 3 – Jerónimo Bautista Lanuza, Spanish friar, bishop and writer (d. 1624)",
    "January 6 – Timotheus Kirchner, German theologian (d. 1587)",
    "January 28 – Paul Luther, German scientist (d. 1593)",
    "February 5 – Andreas Dudith, Croatian-Hungarian nobleman and diplomat (d. 1589)",
    "February 9 – Shimazu Yoshihisa, Japanese samurai (d. 1611)",
    "February 16 – Gianfrancesco Gambara, Italian Catholic cardinal (d. 1587)",
    "February 28 – Michel de Montaigne, French essayist (d. 1592)[6]",
    "March 10 – Francesco III Gonzaga, Duke of Mantua (d. 1550)",
    "April 5 – Giulio della Rovere, Italian Catholic cardinal (d. 1578)",
    "April 8 – Claudio Merulo, Italian composer and organist (d. 1604)[7]",
    "April 24 – William I of Orange (d. 1584)",
    "May 2 – Philip II, Duke of Brunswick-Grubenhagen (d. 1596)",
    "June 30 – Martín de Rada, Spanish missionary (d. 1578)",
    "July 10 – Antonio Possevino, Italian diplomat (d. 1611)",
    "August 2 – Theodor Zwinger, Swiss scholar (d. 1588)",
    "August 7\nAlonso de Ercilla y Zúñiga, Basque soldier and poet (d. 1595)\nValentin Weigel, German theologian (d. 1588).",
    "Alonso de Ercilla y Zúñiga, Basque soldier and poet (d. 1595)",
    "Valentin Weigel, German theologian (d. 1588).",
    "September 5 – Jacopo Zabarella, Italian philosopher (d. 1589)",
    "September 7 – Queen Elizabeth I of England, daughter of King Henry VIII of England (d. 1603)[8]",
    "September 15 – Catherine of Austria, Queen of Poland (d. 1572)",
    "September 27 – Stefan Batory, King of Poland (d. 1586)",
    "October 9 – Henry V, Burgrave of Plauen (d. 1568)",
    "October 12 – Asakura Yoshikage, Japanese ruler (d. 1573)",
    "October 14 – Anna of Mecklenburg, duchess consort of Courland (1566-1587) (d. 1602)",
    "November 22 – Alfonso II d'Este, Duke of Ferrara, Italian noble (d. 1597)",
    "December 13 – King Eric XIV of Sweden (d. 1577)[9]",
    "date unknown – Eknath, Indian Marathi saint (d. 1599)",
    "probable\nAmina, Queen of Zazzua (d. 1610)\nCornelis Cort, Dutch engraver (d. 1578)\nDavid Rizzio, Italian secretary of Mary, Queen of Scots (k. 1566)",
    "Amina, Queen of Zazzua (d. 1610)",
    "Cornelis Cort, Dutch engraver (d. 1578)",
    "David Rizzio, Italian secretary of Mary, Queen of Scots (k. 1566)"
  ],
  "deaths": [
    "March 19 – John Bourchier, 2nd Baron Berners, English soldier and statesman (b. 1467)",
    "April 10 – King Frederick I of Denmark (b. 1471)[10]",
    "April 28 – Nicholas West, English bishop and diplomat (b. 1461)",
    "April 30 – John George, Marquess of Montferrat, Italian noble (b. 1488)",
    "June – Bayin Htwe, king of Prome in Burma",
    "June 25 – Mary Tudor, queen of Louis XII of France (b. 1496)[11]",
    "July 4 – John Frith, English Protestant priest and martyr (b. 1503)",
    "July 6 – Ludovico Ariosto, Italian poet (b. 1474)[12]",
    "August 8 – Lucas van Leyden, Dutch artist (b. 1494)",
    "July 26 – Atahualpa, last Inca ruler of Peru (executed) (b. c.1502)",
    "September 6 – Jacopo Salviati, Italian politician and son-in-law of Lorenzo de' Medici (b. 1461)",
    "September 17 – Philip I, Margrave of Baden (b. 1479)",
    "September 20 – Veit Stoss, German sculptor (b. c. 1447)",
    "October 10 – Severinus of Saxony, Prince of Saxony; died young (b. 1522)",
    "October – Túpac Huallpa, puppet ruler of Peru",
    "December 3 – Grand Prince Vasili III of Muscovy (b. 1479)",
    "date unknown\nDuarte Pacheco Pereira, Portuguese explorer (b. c. 1460)\nAnne Rud, Danish noble and defender\nFortún Ximénez, Spanish sailor and mutineer",
    "Duarte Pacheco Pereira, Portuguese explorer (b. c. 1460)",
    "Anne Rud, Danish noble and defender",
    "Fortún Ximénez, Spanish sailor and mutineer",
    "probable – Girolamo del Pacchia, Italian painter (b. 1477)"
  ]
}