{
  "events": [
    "January\nBigod's Rebellion, an uprising by Roman Catholics against Henry VIII of England, is crushed.\nBattle of Ollantaytambo: Emperor Manco Inca Yupanqui is victorious against the Spanish and their Indian allies led by Hernando Pizarro.",
    "Bigod's Rebellion, an uprising by Roman Catholics against Henry VIII of England, is crushed.",
    "Battle of Ollantaytambo: Emperor Manco Inca Yupanqui is victorious against the Spanish and their Indian allies led by Hernando Pizarro.",
    "March – Diego de Almagro successfully charges Manco Inca's siege of Cuzco, thereby saving his antagonists, the Pizarro brothers.",
    "March 12 – Recife is founded by the Portuguese, in Brazil.",
    "April – Spanish conquest of the Muisca: Bacatá, the main settlement of the Muisca Confederation, is conquered by Gonzalo Jiménez de Quesada, effectively ending the Confederation in the Colombian Eastern Andes.[1]",
    "April 1 – The Archbishop of Norway Olav Engelbrektsson flees from  Trondheim to Lier, Belgium.",
    "June 2 – Pope Paul III publishes the encyclical Sublimis Deus, which declares the natives of the New World to be rational beings with souls, who must not be enslaved or robbed.",
    "June 23 – Siege of Hamar ends with the arrest of Bishop Mogens Lauritssøn, and the Catholic rebellion is definitively ended in Norway.",
    "July – Rodrigo Orgóñez occupies and sacks the Inca center of Vitcos but Manco Inca Yupanqui escapes and establishes the independent Neo-Inca State elsewhere in Vilcabamba, Peru.",
    "August 15 – Asunción is founded by Juan de Salazar de Espinosa.",
    "August 25 – The Honourable Artillery Company, the oldest surviving regiment in the British Army, and the second most senior, is formed.",
    "August-September – The Ottoman Empire fails to capture Corfu, but does this year conquer the islands of Paros and Ios.",
    "October 15 – Following the baptism of her son, the future Edward VI of England, Jane Seymour begins suffering from puerperal fever.[2]",
    "The Spaniards bring the potato to Europe.",
    "Kiritimati (Acea or \"Christmas Island\") is probably sighted by the Spanish mutineers from Hernando de Grijalva's expedition.",
    "Bangalore is first mentioned.",
    "Dissolution of the monasteries in Norway: Religious buildings dissolved by Christian III include: Bakke Abbey, Munkeby Abbey, Tautra Abbey, Nidarholm Abbey, Gimsøy Abbey and Utstein Abbey.",
    "Publication of complete Bible translations into English, both based on Tyndale's:\nMyles Coverdale's 1535 text, the first to be printed in England (by James Nicholson in Southwark, London)\nThe Matthew Bible edited by John Rogers under the pseudonym \"Thomas Matthew\" and printed in Antwerp.",
    "Myles Coverdale's 1535 text, the first to be printed in England (by James Nicholson in Southwark, London)",
    "The Matthew Bible edited by John Rogers under the pseudonym \"Thomas Matthew\" and printed in Antwerp.",
    "Dissolution of the monasteries in England: Religious buildings dissolved by Henry VIII of England include: Bisham Priory, Bridlington Priory, Castle Acre Priory, Chertsey Abbey, Furness Abbey, London Charterhouse and Valle Crucis Abbey."
  ],
  "births": [
    "January 1 – Jan Krzysztof Tarnowski, Polish noble (d. 1567)",
    "January 16 – Albrecht VII, Count of Schwarzburg-Rudolstadt (d. 1605)",
    "January 21 – Antonio Maria Salviati, Italian Catholic cardinal (d. 1602)",
    "February 26 – Christopher II, Margrave of Baden-Rodemachern (d. 1575)",
    "March 17 – Toyotomi Hideyoshi, Japanese warlord (d. 1598)",
    "March 4 – Longqing Emperor, Emperor of China (d. 1572)",
    "May 18 – Guido Luca Ferrero, Italian Catholic cardinal (d. 1585)",
    "May 20 – Hieronymus Fabricius, Italian anatomist (d. 1619)",
    "May 27 – Louis IV, Landgrave of Hesse-Marburg, son of Landgrave Philip I (d. 1604)",
    "May 28 or May 31 – Shah Ismail II of Persia (d. 1577)",
    "June 3 – João Manuel, Prince of Portugal, Portuguese prince (d. 1554)",
    "July 20 – Arnaud d'Ossat, French diplomat and writer (d. 1604)",
    "July 29 – Pedro Téllez-Girón, 1st Duke of Osuna, Spanish duke (d. 1590)",
    "July 30 – Christopher, Duke of Mecklenburg and administrator of Ratzeburg (d. 1592)",
    "August 9 – Francesco Barozzi, Italian mathematician (d. 1604)",
    "August 15 – Shimazu Toshihisa, Japanese samurai (d. 1592)",
    "October – Lady Jane Grey, claimant to the throne of England (d. 1554)[3][4]",
    "October 12 – King Edward VI of England (d. 1553)[2]",
    "November 21 – Fadrique Álvarez de Toledo, 4th Duke of Alba, Spanish military leader (d. 1583)",
    "December 5 – Ashikaga Yoshiaki, Japanese shōgun (d. 1597)",
    "December 20 – King John III of Sweden (d. 1592)[5]",
    "December 24 – Willem IV van den Bergh, Stadtholder of Guelders and Zutphen (d. 1586)",
    "December 26 – Albert, Count of Nassau-Weilburg (d. 1593)",
    "date unknown\nJane Lumley, English translator (d. 1578)\nShimizu Muneharu, Japanese military commander (d. 1582)\nJohn Almond, English Cistercian monk (d. 1585)",
    "Jane Lumley, English translator (d. 1578)",
    "Shimizu Muneharu, Japanese military commander (d. 1582)",
    "John Almond, English Cistercian monk (d. 1585)"
  ],
  "deaths": [
    "January 6\nAlessandro de' Medici, Duke of Florence (b. 1510)\nBaldassare Peruzzi, Italian architect and painter (b. 1481)",
    "Alessandro de' Medici, Duke of Florence (b. 1510)",
    "Baldassare Peruzzi, Italian architect and painter (b. 1481)",
    "January 12 – Lorenzo di Credi, Florentine painter and sculptor (b. 1459)",
    "February 2 – Johann Carion, German astrologer and chronicler (b. 1499)",
    "February 3 – Thomas FitzGerald, 10th Earl of Kildare, Anglo-Irish noble, rebel (executed) (b. 1513)",
    "February 8\nOtto von Pack, German conspirator (b. c. 1480)\nSaint Gerolamo Emiliani, Italian humanitarian (b. 1481)",
    "Otto von Pack, German conspirator (b. c. 1480)",
    "Saint Gerolamo Emiliani, Italian humanitarian (b. 1481)",
    "January 11 – John, Hereditary Prince of Saxony, German prince (b. 1498)",
    "March 25 – Charles, Duke of Vendôme, French noble (b. 1489)",
    "March 28 – Francesco of Saluzzo, Marquess of Saluzzo (b. 1498)",
    "May 10 – Andrzej Krzycki, Polish archbishop (b. 1482)",
    "May 24 – Sophie of Brandenburg-Ansbach-Kulmbach, German princess (b. 1485)",
    "June 2 – Francis Bigod, English noble, rebel (executed) (b. 1507)",
    "June 23 – Pedro de Mendoza, Spanish conquistador (b. 1487)",
    "June 29 – Henry Percy, 6th Earl of Northumberland, English noble (b. 1502)",
    "July 7 – Madeleine of Valois, queen of James V of Scotland (b. 1520)[6]",
    "July 12 – Robert Aske, English lawyer, rebel (executed) (b. 1500)",
    "September 4 – Johann Dietenberger, German theologian (b. c. 1475)",
    "September 7 – Nikolaus von Schönberg, German Catholic cardinal (b. 1472)",
    "September 20 – Pavle Bakić, last Serb Despot and medieval Serb monarch",
    "October 24 – Jane Seymour, 3rd queen consort of Henry VIII of England (complications of childbirth) (b. c. 1508)[2]",
    "October 29 – Elizabeth Lucar, English calligrapher (b. 1510)",
    "December 11 – Andrey of Staritsa, son of Ivan III of Russia the Great (b. 1490)",
    "date unknown – John Kite, Archbishop of Armagh and Bishop of Carlisle",
    "probable – Thomas Murner, German satirist (b. 1475)"
  ]
}