{
  "events": [
    "February 24 – Treaty of Nagyvárad: Peace is declared between Ferdinand I, future Holy Roman Emperor and the Ottoman Empire. John Zápolya is recognized as King of Hungary (Eastern Hungarian Kingdom), while Ferdinand retains the northern and western parts of the Kingdom, and is recognized as heir to the throne.[1]",
    "April 26 – Battle of Las Salinas: Almagro is defeated by Francisco Pizarro, who then seizes Cusco.[2]",
    "June 18 – Truce of Nice: Peace is declared between Emperor Charles V and Francis I of France.",
    "June 19 – Dissolution of the Monasteries in England: The newly founded Bisham Abbey is dissolved.",
    "August 6 – Bogotá, Colombia is founded by Gonzalo Jiménez de Quesada.",
    "September 28 – Battle of Preveza: The Ottoman fleet of Suleiman the Magnificent, under the command of Hayreddin Barbarossa, defeats the Holy League of Emperor Charles V, under the command of Andrea Doria.[3]",
    "September 29–October 6 – The last significant volcanic eruption in the Phlegraean Fields of Italy creates Monte Nuovo.",
    "October 28 – The first university of the New World, the Universidad Santo Tomás de Aquino, is founded on the island of Hispaniola.",
    "November 6 – The end of the Siege of Diu as the Gujarat and Ottoman forces withdraw from the Portuguese-held city.",
    "November 30\nSucre, Bolivia, is founded under the name Ciudad de la Plata de la Nueva Toledo.\nDissolution of the Monasteries in England: Byland Abbey is dissolved.",
    "Sucre, Bolivia, is founded under the name Ciudad de la Plata de la Nueva Toledo.",
    "Dissolution of the Monasteries in England: Byland Abbey is dissolved.",
    "December 17 – Pope Paul III confirms the excommunication of Henry VIII of England from the Roman Catholic church.[4]",
    "Michelangelo starts work on the Piazza del Campidoglio on the Capitoline Hill in Rome.",
    "The first in a decade-long series of severe famines and epidemics sweep central and southeastern China during the Ming dynasty, made worse by a decision of 1527 to cut back on the intake of grain quotas for granaries.",
    "In China, a tsunami floods over the seawall in Haiyan County of Zhejiang province, inundating fields with saltwater, ruining many acres of crops. This drives up the price of foodstuffs, and many are forced to live off of tree bark and weeds (as Wang Wenlu states in his writing of 1545).",
    "Paracelsus visits Villach."
  ],
  "births": [
    "January 6 – Jane Dormer, English lady-in-waiting to Mary I (d. 1612)",
    "January 10 – Louis of Nassau, Dutch general (d. 1574)",
    "January 13 – Udai Singh of Marwar, Ruler of Marwar (d. 1595)",
    "January 15 – Maeda Toshiie, Japanese samurai and warlord (d. 1599)",
    "January 16 – John Frederick III, Duke of Saxony and nominal Duke of Saxe-Gotha (d. 1565)",
    "February 23 – Dorothy Catherine of Brandenburg-Ansbach (d. 1604)",
    "March 25 – Christopher Clavius, German mathematician and astronomer (d. 1612)",
    "April 24 – Guglielmo Gonzaga, Duke of Mantua (d. 1587)",
    "April 26 – Gian Paolo Lomazzo, Italian painter (d. 1600)",
    "June 30 – Bonaventura Vulcanius, Flemish Renaissance humanist (d. 1614)",
    "July 8 – Alberto Bolognetti, Italian Catholic cardinal (d. 1585)",
    "July 12 – Infanta Maria of Guimarães, Portuguese infanta (d. 1577)",
    "September 21 – Lewis Mordaunt, 3rd Baron Mordaunt, English Member of Parliament (d. 1601)",
    "September 29\nCount Johan II of East Frisia (d. 1591)\nJoan Terès i Borrull, Viceroy of Catalonia (d. 1603)",
    "Count Johan II of East Frisia (d. 1591)",
    "Joan Terès i Borrull, Viceroy of Catalonia (d. 1603)",
    "October 2 – Saint Charles Borromeo, Spanish saint and cardinal of the Roman Catholic Church (d. 1584)",
    "October 17 – Irene di Spilimbergo, Italian Renaissance poet and painter (d. 1559)",
    "November 16 – Saint Turibius of Mongrovejo, Spanish Grand Inquisitor, missionary Archbishop of Lima (d. 1606)",
    "December 6 – Francesco Gonzaga, Spanish Catholic cardinal (d. 1566)",
    "December 8 – Miklós Istvánffy, Hungarian politician (d. 1615)",
    "December 10 – Giovanni Battista Guarini, Italian poet (d. 1612)",
    "December 11 – Sigismund of Brandenburg, Archbishop of Magdeburg, Administrator of Halberstadt (d. 1566)",
    "December 13 – Sigrid Sture, Swedish Governor (d. 1613)",
    "December 19 – Jan Zborowski, Polish noble (d. 1603)",
    "December 21 – Luigi d'Este, Italian Catholic cardinal (d. 1586)",
    "date unknown\nFrançois de Bar, French scholar (d. 1606)\nDiane de France, illegitimate daughter of Henry II of France (d. 1619)\nHenry Herbert, 2nd Earl of Pembroke, Welsh-born statesman (d. 1601)\nAshikaga Yoshihide, Japanese shōgun (d. 1568)\nCaesar Baronius, Italian cardinal and historian (d. 1607)",
    "François de Bar, French scholar (d. 1606)",
    "Diane de France, illegitimate daughter of Henry II of France (d. 1619)",
    "Henry Herbert, 2nd Earl of Pembroke, Welsh-born statesman (d. 1601)",
    "Ashikaga Yoshihide, Japanese shōgun (d. 1568)",
    "Caesar Baronius, Italian cardinal and historian (d. 1607)"
  ],
  "deaths": [
    "January 8 – Beatrice of Portugal, Duchess of Savoy (b. 1504)",
    "February 3 – John III of the Palatinate, Administrator of the Bishopric of Regensburg (b. 1488)",
    "February 7 – Olav Engelbrektsson, Archbishop of Norway (born c. 1480).[5]",
    "February 12 – Albrecht Altdorfer, German painter (b. c. 1480)[6]",
    "March 18 – Érard de La Marck, prince-bishop of Liège (b. 1472)",
    "April 3 – Elizabeth Boleyn, Countess of Wiltshire (b. 1480)",
    "April 4 – Elena Glinskaya, Regent of Russia (b. c. 1510)",
    "May 8 – Edward Foxe, English churchman (b. 1496)",
    "May 15 – Philipp III, Count of Hanau-Lichtenberg (b. 1482)",
    "May 22 – John Forest, English Franciscan friar (martyred) (b. 1471)",
    "June 22 – Bodo VIII, Count of Stolberg-Wernigerode (1511–1538) (b. 1467)",
    "June 30 – Charles II, Duke of Guelders (b. 1467)",
    "July 8 – Diego de Almagro, Spanish conquistador (b. 1475)",
    "September 14 – Henry III of Nassau-Breda, Baron of Breda (b. 1483)",
    "September 28 – Mary of Bourbon, daughter of Charles, Duke of Vendôme (b. 1515)",
    "October 20 – Francesco Maria I della Rovere, Duke of Urbino, condottiero (b. 1490)",
    "November 22 – John Lambert, English Protestant martyr (burned at stake)",
    "December 28 – Andrea Gritti, Doge of Venice (b. 1455)[7]",
    "date unknown\nPierre Gringoire, French poet and playwright (b. 1475)\nIsabella Hoppringle, Scottish abbess and spy (b. 1460)\nPaganino Paganini, Italian publisher (b. c. 1450)",
    "Pierre Gringoire, French poet and playwright (b. 1475)",
    "Isabella Hoppringle, Scottish abbess and spy (b. 1460)",
    "Paganino Paganini, Italian publisher (b. c. 1450)"
  ]
}