{
  "events": [
    "February 11 – King Henry VIII of England allies with Charles V, Holy Roman Emperor, against France.[1]",
    "February 21 – Battle of Wayna Daga: A joint Ethiopian-Portuguese force of 8,500, under Emperor Gelawdewos of Ethiopia, defeats Imam Ahmad ibn Ibrahim al-Ghazi's army of over 14,000, ending the Ethiopian–Adal war.",
    "March\nKing Gustav Vasa's troops crush the forces of Swedish peasant rebel Nils Dacke in battle, ending the uprising. Dacke escapes, but is captured and killed in the summer.\nConsolidating Act of Welsh Union: The Parliament of England establishes counties and regularises parliamentary representation in Wales.[1]",
    "King Gustav Vasa's troops crush the forces of Swedish peasant rebel Nils Dacke in battle, ending the uprising. Dacke escapes, but is captured and killed in the summer.",
    "Consolidating Act of Welsh Union: The Parliament of England establishes counties and regularises parliamentary representation in Wales.[1]",
    "April – Campaign of Suleiman: Suleiman the Magnificent, Ottoman Sultan, revives the Little War in Hungary.",
    "May – Nicolaus Copernicus publishes De revolutionibus orbium coelestium (On the Revolutions of the Heavenly Spheres) in Nuremberg, offering mathematical arguments for the existence of the heliocentric universe, denying the geocentric model. Copernicus dies on May 24 in Frombork, at the age of 70.",
    "June – Andreas Vesalius publishes De humani corporis fabrica (On the Fabric of the Human Body), revolutionising the science of human anatomy.",
    "July 1 – The Treaty of Greenwich is signed between England and Scotland (repudiated by Scotland December 11).[1]",
    "July 12 – King Henry VIII of England marries Catherine Parr. It is the sixth and last of Henry's marriages and the third of Catherine's.[2] Princess Elizabeth attends the wedding. This month, the Parliament of England passes the Third Succession Act, restoring the Princesses Mary and Elizabeth I of England, Henry's daughters, to the line of succession to the English throne.",
    "July 25 – August 10 – Siege of Esztergom: Suleiman the Magnificent, Ottoman Sultan, besieges and takes Esztergom in Hungary.[3]",
    "August 6–22 – Siege of Nice: Ottoman Empire and French forces (under the Franco-Ottoman alliance), led by Admiral Hayreddin Barbarossa, besiege and take Nice.",
    "August 25 – Led by the Chinese pirate Wang Zhi, the first Europeans and firearms arrive in Japan in Tanegashima island in southern Kyushu including Portuguese traders António Mota, António Peixoto, Francisco Zeimoto, and presumably  Fernão Mendes Pinto.[4]",
    "September – October – Landrecies in Picardy is besieged by forces under Charles V, Holy Roman Emperor, but the siege is withdrawn on the approach of the French army.",
    "September – Campaign of Suleiman: Suleiman the Magnificent captures the Hungarian coronation city of Székesfehérvár.[3] The city will be occupied by the Ottoman Empire for 145 years.",
    "September 9 – Mary Stuart is crowned the Queen of Scots in Stirling at nine months old.",
    "Martin Luther publishes On the Jews and Their Lies.",
    "Mikael Agricola publishes Abckiria.[5]",
    "The Lighthouse of Genoa is completed in present form.[6]",
    "Indians in the Spanish Empire are declared free, against the wishes of local settlers."
  ],
  "births": [
    "January 18 (baptized) – Alfonso Ferrabosco, Italian composer (d. 1588)",
    "January 31 – Tokugawa Ieyasu, Japanese shōgun (d. 1616)",
    "February 4 – Johannes Heurnius, Dutch physician (d. 1601)",
    "February 4 – Giovanni Francesco Fara, Italian writer (d. 1591)",
    "February 16 – Kanō Eitoku, Japanese painter (d. 1590)[7]",
    "February 18 – Charles III, Duke of Lorraine (d. 1608)",
    "February 25 – Sharaf Khan Bidlisi, Emir of Bitlis (d. 1603)",
    "March 7 – John Casimir of the Palatinate-Simmern, German prince and reigning count palatine of Simmern (d. 1592)",
    "April 1 – François de Bonne, Duke of Lesdiguières, Constable of France (d. 1626)",
    "April 11 – George John I, Count Palatine of Veldenz (d. 1592)",
    "May 2 – Jan Moretus, Belgian printer (d. 1610)",
    "June 8 – Petrus Albinus, German historian, local history researcher and poet (d. 1598)",
    "June 29 – Christine of Hesse, duchess consort of Holstein-Gottorp (1465-1486) (d. 1604)",
    "July 20 – Nils Svantesson Sture, Swedish diplomat (d. 1567)",
    "August 3 – Nicasius de Sille, Dutch diplomat (d. 1600)",
    "August 21 – Giovanni Bembo, Doge of Venice (d. 1618)",
    "September 14 – Claudio Acquaviva, Italian Jesuit (d. 1615)",
    "October 21 – Michael Hicks, English politician (d. 1612)",
    "November 2 – Kasper Franck, German theologian (d. 1584)",
    "November 8 – Lettice Knollys, Countess of Essex and later Countess of Leicester, lady-in-waiting to Elizabeth I of England  (d. 1634)",
    "December 3 – Alessandro Riario, Italian Catholic cardinal (d. 1585)",
    "December 29 – Catherine of Nassau-Dillenburg, daughter of William I (d. 1624)",
    "date unknown\nNicolas de Neufville, seigneur de Villeroy, 2nd Prime Minister of France (d. 1617)\nThomas Deloney, English novelist and balladeer (d. 1600)\nDomenico Fontana, Italian architect (d. 1607)\nSonam Gyatso, 3rd Dalai Lama, first Dalai Lama  (d. 1588)\nFrançois Pithou, French lawyer and author (d. 1621)\nHayyim ben Joseph Vital, Syrian Jewish rabbi and mystic (d. 1620)\nChen Lin, Ming Dynasty general (d. 1607)",
    "Nicolas de Neufville, seigneur de Villeroy, 2nd Prime Minister of France (d. 1617)",
    "Thomas Deloney, English novelist and balladeer (d. 1600)",
    "Domenico Fontana, Italian architect (d. 1607)",
    "Sonam Gyatso, 3rd Dalai Lama, first Dalai Lama  (d. 1588)",
    "François Pithou, French lawyer and author (d. 1621)",
    "Hayyim ben Joseph Vital, Syrian Jewish rabbi and mystic (d. 1620)",
    "Chen Lin, Ming Dynasty general (d. 1607)",
    "probable\nGiovanni Maria Nanino, Italian composer (d. 1607)\nFederico Zuccari, Italian painter (d. 1609)",
    "Giovanni Maria Nanino, Italian composer (d. 1607)",
    "Federico Zuccari, Italian painter (d. 1609)"
  ],
  "deaths": [
    "January 2 – Francesco Canova da Milano, Italian composer (b. 1497)",
    "January 3 – Juan Rodríguez Cabrillo, Portuguese explorer (b. 1499)",
    "January 9 – Guillaume du Bellay, French diplomat and general (b. 1491)",
    "February 13 – Johann Eck, German Scholastic theologian (b. 1486)",
    "February 21 – Ahmad ibn Ibrahim al-Ghazi, Imam of Adal (in battle) (b. c. 1506)",
    "March 2 – John Neville, 3rd Baron Latimer, English politician (b. 1493)",
    "March 6 – Baccio D'Agnolo, Florentine woodcarver (b. 1460)",
    "April 23 – Susanna of Bavaria, German noble, House of Wittelsbach (b. 1502)",
    "May 24 – Nicolaus Copernicus, Polish mathematician and astronomer (b. 1473)[8]",
    "June 27 – Agnolo Firenzuola, Italian poet (b. 1493)",
    "July 19 – Mary Boleyn, English courtier, mistress of Kings Francis I of France and Henry VIII of England (b. 1500)[9]",
    "August 1 – Magnus I, Duke of Saxe-Lauenburg, German noble (b. 1470)",
    "August 29 – Maria of Jülich-Berg, German duchess, Spouse of John III, Duke of Cleves (b. 1491)",
    "September 2 – Sultan Quli Qutb Mulk, founder of the Qutb Shahi dynasty of Golconda (b. 1470)",
    "September 20 – Thomas Manners, 1st Earl of Rutland (b. 1492)",
    "September 23 – Johanna of Hachberg-Sausenberg, countess regnant of Neuchatel (b. 1485)",
    "November 29 – Hans Holbein the Younger, German artist, active in England[10]",
    "December 27 – George, Margrave of Brandenburg-Ansbach (b. 1484)",
    "December 29 – Maria Salviati, Italian noble (b. 1499)",
    "December 30 – Gian Matteo Giberti, Italian Catholic bishop (b. 1495)",
    "date unknown\nPolidoro da Caravaggio, Italian painter (b. 1492; murdered)[11]\nMadeleine Lartessuti, French shipper and banker (b. 1478)\nAl-Mutawakkil III, last caliph of the Cairo-based Abbasid caliphate\nSehzade Mehmed, Ottoman prince (b. 1521)",
    "Polidoro da Caravaggio, Italian painter (b. 1492; murdered)[11]",
    "Madeleine Lartessuti, French shipper and banker (b. 1478)",
    "Al-Mutawakkil III, last caliph of the Cairo-based Abbasid caliphate",
    "Sehzade Mehmed, Ottoman prince (b. 1521)",
    "probable\nSebastian Franck, German freethinker (b. 1515)\nMargaret Lee, English courtier, sister of poet Thomas Wyatt (b. 1506)",
    "Sebastian Franck, German freethinker (b. 1515)",
    "Margaret Lee, English courtier, sister of poet Thomas Wyatt (b. 1506)"
  ]
}