{
  "events": [
    "January 13 – At Västerås, the estates of Sweden swear loyalty to King Gustav Vasa and to his heirs, ending the traditional electoral monarchy in Sweden. Gustav subsequently signs an alliance with the Kingdom of France.",
    "February 20 – The Fourth Diet of Speyer is convened.",
    "April 11 – Battle of Ceresole: French forces under the Comte d'Enghien defeat forces of the Holy Roman Empire, under the Marques Del Vasto, near Turin.[1]",
    "May – Charles V, Holy Roman Emperor, again invades eastern France.",
    "May 3 – Edward Seymour, Earl of Hertford, with an English army, captures Leith and Edinburgh from the Kingdom of Scotland.",
    "June 19–August 18 – Troops of the Holy Roman Empire besiege Saint-Dizier, in eastern France.",
    "July – Battle of the Shirts: The Clan Fraser of Lovat and Macdonalds of Clan Ranald fight over a disputed chiefship in Scotland; reportedly, five Frasers and eight Macdonalds survive.",
    "July 19–September 14 – Italian War of 1542–46 – First Siege of Boulogne: King Henry VIII of England besieges and captures Boulogne in northern France.",
    "August 17 – The University of Königsberg (\"Albertina\") is inaugurated (founding deed signed July 20 by Albert, Duke of Prussia).",
    "September 18",
    "Peace of Crépy: Peace is declared between Charles V, Holy Roman Emperor, and Francis I of France. The war between France and England continues.[2]",
    "The expedition of Juan Bautista Pastene made landfall in San Pedro Bay, southern Chile, claiming the territory for Spain.[3]",
    "September 22 – Captain Juan Bautista Pastene leads the first European expedition to the estuary of Valdivia, Chile and Corral Bay.",
    "October 9 – Second Siege of Boulogne: French forces under the Dauphin assault Boulogne, but are ultimately unsuccessful.",
    "Mongols burn the suburbs of Peking in China.[4] It was featured in the fiction book written in 1526 by Jiajing Emperor.",
    "The Orto botanico di Pisa botanical garden is established by Cosimo I de' Medici, Grand Duke of Tuscany, in Italy, under the direction of botanist Luca Ghini, who also creates the first herbarium.",
    "Rats make their first appearance in North America.",
    "Portuguese explorers encounter the island of Taiwan, and call it Ilha Formosa (\"Beautiful Island\").[verification needed]"
  ],
  "births": [
    "January 19 – King Francis II of France (d. 1560)[5]",
    "January 24 – Gillis van Coninxloo, Flemish painter (d. 1607)",
    "February 3 – César de Bus, French Catholic priest (d. 1607)",
    "March 11 – Torquato Tasso, Italian poet (d. 1595)[6]",
    "April – Thomas Fleming, English judge (d. 1613)",
    "April 20 – Renata of Lorraine, duchess consort of Bavaria (d. 1602)",
    "May 24 – William Gilbert, English scientist and astronomer (d. 1603)",
    "July 14 – Henry Compton, 1st Baron Compton, English politician (d. 1589)",
    "August 9 – Bogislaw XIII, Duke of Pomerania (d. 1606)",
    "September 1 – John Gordon, Scottish bishop (d. 1619)",
    "September 29 – Giovanni de' Medici, Italian Catholic cardinal (d. 1562)",
    "November 1 – Hasan Kafi Pruščak, Bosnian scholar and judge (d. 1615)",
    "November 15 – Dorothea Susanne of Simmern, Duchess of Saxe-Weimar (d. 1592)",
    "December 23 – Anna of Saxony, only child and heiress of Maurice, Elector of Saxony (d. 1577)",
    "date unknown\nRichard Bancroft, Archbishop of Canterbury (d. 1610)\nThomas Hobson, English carrier and origin of the phrase Hobson's choice (d. 1631)\nMaddalena Casulana, Italian composer, lutenist and singer (d. 1590)",
    "Richard Bancroft, Archbishop of Canterbury (d. 1610)",
    "Thomas Hobson, English carrier and origin of the phrase Hobson's choice (d. 1631)",
    "Maddalena Casulana, Italian composer, lutenist and singer (d. 1590)",
    "probable\nGeorge Whetstone, English writer (d. 1587)",
    "George Whetstone, English writer (d. 1587)"
  ],
  "deaths": [
    "March 16 – Louis V, Elector Palatine (1508–1544) (b. 1478)",
    "March 22 – Johannes Magnus, last Catholic Archbishop of Sweden (b. 1488)",
    "April 30 – Thomas Audley, Lord Chancellor of England (b. 1488)",
    "June 14 – Antoine, Duke of Lorraine (b. 1489)",
    "July 15 – René of Châlon, Prince of the House of Orange (b. 1519)",
    "June 23 – Eleonore of Fürstenberg, wife of Philip IV, Count of Hanau-Lichtenberg (b. 1523)",
    "August 19 – Hans Buser, Swiss noble (b. 1513)",
    "September 12 – Clément Marot, French poet (b. 1496)[7]",
    "September 25 – Valerius Cordus, German physician and scientist (b. 1515)",
    "October 10 – Charles Blount, 5th Baron Mountjoy, English courtier and patron of learning (b. 1516)",
    "October 12 – Antonio Pucci, Italian Catholic cardinal (b. 1485)",
    "November 13 – Ursula van Beckum, Dutch Anapabtist (b. 1520)",
    "November 15 – Lucy Brocadelli, Dominican tertiary and stigmatic (b. 1476)",
    "November 29 – Jungjong of Joseon (b. 1488)",
    "December 9 – Teofilo Folengo, Italian poet (b. 1491)",
    "date unknown\nUlick na gCeann Burke, 1st Earl of Clanricarde\nChen Chun, Chinese painter (b. 1483)\nMargaret Roper, English writer (b. 1505)\nNilakantha Somayaji, Indian mathematician and astronomer (b. 1444)\nManco Inca Yupanqui, Inca ruler (b. 1516)\nBonaventure des Périers, French author (b. 1500)",
    "Ulick na gCeann Burke, 1st Earl of Clanricarde",
    "Chen Chun, Chinese painter (b. 1483)",
    "Margaret Roper, English writer (b. 1505)",
    "Nilakantha Somayaji, Indian mathematician and astronomer (b. 1444)",
    "Manco Inca Yupanqui, Inca ruler (b. 1516)",
    "Bonaventure des Périers, French author (b. 1500)"
  ]
}