{
  "events": [
    "January – Burmese–Siamese War (1547–49): King Tabinshwehti of Burma begins his invasion of the Ayutthaya Kingdom, which ends in retreat.",
    "February 3 – Burmese–Siamese War: Burmese viceroy Thado Dhamma Yaza I of Prome slays Sri Suriyothai, queen consort of the Ayutthaya Kingdom, on her war elephant, when she intervenes in battle to protect the life of her husband.",
    "March 29 – The city of Salvador da Bahia, Brazil's first capital, is founded by Tome de Sousa.",
    "June 9 – The Book of Common Prayer is introduced in English churches;[1] the Prayer Book Rebellion against it breaks out in the West Country.[2]",
    "July – Kett's Rebellion breaks out in East Anglia, against land enclosures;[2] rebellion breaks out in Oxfordshire, against landowners associated with religious changes.[3]",
    "July 27 – Francis Xavier arrives in Japan.",
    "August 8–9 – England and France declare war.[4]",
    "August 17 – Battle of Sampford Courtenay in England: The Prayer Book Rebellion is quashed.",
    "August 26 – Battle of Dussindale in England: Kett's Rebellion is quashed.[4]",
    "September 17 – The Council of Trent is prorogued indefinitely.",
    "November 4 – The Pragmatic Sanction is proclaimed by Charles V, Holy Roman Emperor. The Seventeen Provinces are declared inseparable.",
    "November 29 – The lengthy and large Papal conclave, 1549–50 goes into session in the Apostolic Palace in Rome, to decide on a successor to Pope Paul III.",
    "Peter Canisius starts the Counter-Reformation in Bavaria.",
    "The spire of Lincoln Cathedral in England is blown down,[5] leaving St. Olaf's Church, Tallinn, in Estonia as the World's tallest structure.",
    "Although trade existed between the two beforehand, in this year the Portuguese begin to send regular seasonal maritime trade missions to Ming Dynasty China, at Sao João Island (also known as Shangchuan Island) near Macau.",
    "Siege of Kajiki: firearms are used for the first time in a siege in Japanese history. (The previous year's Battle of Uedahara was the first battle in which they were used.)",
    "Excerpta antiqua is published by Hervagius at Basel, Switzerland.",
    "Maidstone Grammar School is founded in England by Edward Seymour, Duke of Somerset.[6]"
  ],
  "births": [
    "January 26 – Jakob Ebert, German theologian (d. 1614)",
    "January 26 – Francesco Bassano the Younger, Italian painter (d. 1592)",
    "February 3 – Louis of Valois, French prince (d. 1550)",
    "February 4 – Eustache Du Caurroy, French composer (d. 1609)",
    "February 15 – Barnim X, Duke of Pomerania (1569–1603) (d. 1603)",
    "February 20 – Francesco Maria II della Rovere, Duke of Urbino, last Duke of Urbino (d. 1631)",
    "March 10 – Francis Solanus, Spanish missionary and saint (d. 1610)",
    "March 11 – Hendrik Laurenszoon Spiegel, Dutch writer (d. 1612)",
    "April 5 – Françoise d'Orléans-Longueville, French princess (d. 1601)",
    "April 13 – Count Juraj IV Zrinski of Croatia (d. 1603)",
    "June 15 – Elizabeth Knollys, English noblewoman (d. 1605)",
    "July 2 – Duchess Sabine of Württemberg, by marriage Landgravine of Hesse-Kassel (d. 1581)",
    "July 5 – Francesco Maria del Monte, Italian Catholic cardinal (d. 1627)",
    "July 12 – Edward Manners, 3rd Earl of Rutland (d. 1587)",
    "July 20 – Pierre de Larivey, Italian-born French dramatist (d. 1619)",
    "July 30 – Ferdinando I de' Medici, Grand Duke of Tuscany (d. 1609)",
    "August 2 – Mikołaj Krzysztof \"the Orphan\" Radziwiłł, Polish nobleman (d. 1616)",
    "August 10 – Catherine of Brandenburg-Küstrin, daughter of Margrave John of Küstrin (d. 1602)",
    "September 1 – Charles Philippe de Croÿ, Marquis d’Havré, Belgian noble and politician (d. 1613)",
    "October 17 – Denis Godefroy (d. 1622)",
    "November 2 – Anna of Austria, Queen of Spain (d. 1580)",
    "November 5 – Philippe de Mornay, French writer (d. 1623)",
    "November 30 – Sir Henry Savile, English educator (d. 1622)",
    "December 9 – Costanzo Antegnati, Italian composer, organist (d. 1624)",
    "December 20 – John Petre, 1st Baron Petre, English politician and baron (d. 1613)",
    "December 24 – Kaspar Ulenberg, German theologian (d. 1617)",
    "date unknown\nKutsuki Mototsuna, Japanese military commander (d. 1632)\nJohn Rainolds, English scholar and Bible translator (d. 1607)\nJuan de Salcedo, Spanish conquistador (d. 1576)\nMarek Sobieski, Polish noble (d. 1605)\nOgawa Suketada, Japanese warlord (d. 1601)",
    "Kutsuki Mototsuna, Japanese military commander (d. 1632)",
    "John Rainolds, English scholar and Bible translator (d. 1607)",
    "Juan de Salcedo, Spanish conquistador (d. 1576)",
    "Marek Sobieski, Polish noble (d. 1605)",
    "Ogawa Suketada, Japanese warlord (d. 1601)"
  ],
  "deaths": [
    "January 28 – Elia Levita, German Yiddish writer (b. 1469)",
    "February 14 – Il Sodoma, Italian painter (b. 1477)",
    "March – Mingyi Swe, Burmese viceroy of Toungoo",
    "March 14 – Lorenzo Cybo, Italian condottiero (b. 1500)",
    "March 20 – Thomas Seymour, 1st Baron Seymour of Sudeley, English politician and diplomat (b. 1508)",
    "March 25 – Veit Dietrich, German theologian, writer and reformer (b. 1506)",
    "April – Andrew Boorde, English traveller (b. 1490)",
    "April 3 – Matsudaira Hirotada, Japanese daimyo (b. 1526)",
    "April 15 – Christine of Saxony, German noble (b. 1505)",
    "April 24 – Ralph Neville, 4th Earl of Westmorland, English earl (b. 1498)",
    "May 11 – María de Toledo, Vicereine and regent of the Spanish Colony of Santo Domingo (b. 1490)",
    "June 26 – Luis Cáncer, Spanish Dominican priest, missionary, martyr and servant of God (b. 1500)",
    "July 19 – Edmund Sheffield, 1st Baron Sheffield, English baron (b. 1521)",
    "August 11 – Otto I, Duke of Brunswick-Harburg, Prince of Lüneburg and Baron of Harburg (b. 1495)",
    "September 10 – Anthony Denny, confidant of Henry VIII of England (b. 1501)",
    "September 21 – Benedetto Accolti the Younger, Italian Catholic cardinal (b. 1497)",
    "October 27 – Marie d'Albret, Countess of Rethel, French nobility (b. 1491)",
    "November 10 – Pope Paul III (b. 1468)[7]",
    "November 26 – Henry Somerset, 2nd Earl of Worcester (b. 1496)",
    "December 7 – Robert Kett, English rebel (executed)",
    "December 21 – Marguerite de Navarre, queen of Henry II of Navarre (b. 1492)",
    "date unknown\nDaniel Bomberg, Brabantian printer",
    "Daniel Bomberg, Brabantian printer"
  ]
}