{
  "events": [
    "May – The first Royal Charter is granted to St Albans, in England.",
    "June – The first of the five Battles of Kawanakajima, the \"Battle of the Fuse,\" commences in Japan between Takeda Shingen of Kai Province and Uesugi Kenshin of Echigo Province, part of a major series of conflicts during the Japanese Sengoku Period.",
    "June 26 – Two new schools, Christ's Hospital[1][2] and King Edward's School, Witley, are created by Royal Charter in accordance with the will of King Edward VI of England; St Thomas' Hospital, London, in existence since the 12th century, is named in the same charter.[3]",
    "July 9 – Battle of Sievershausen: Prince-elector Maurice of Saxony defeats the Catholic forces of Margrave Albert of Brandenburg-Kulmbach. Maurice is mortally wounded.[4]",
    "July 10 – Four days after the death of her cousin King Edward VI of England, Lady Jane Grey is proclaimed Queen of England – a position she holds for the next nine days.[5]",
    "July 19 – The Lord Mayor of London proclaims Mary I the rightful Queen, following a change of allegiance by the Privy Council; Lady Jane Grey voluntarily abdicates.[6]",
    "August – English explorer Richard Chancellor enters the White Sea and reaches Arkhangelsk, going on to the court of Ivan IV of Russia, opening up trade between England and Russia.",
    "August 3 – Queen Mary I of England arrives in London from East Anglia.",
    "August 18 – John Dudley, 1st Duke of Northumberland, is tried and convicted of treason for his role in putting his daughter-in-law, Lady Jane Grey, on the throne.[7]",
    "September – Anglican bishops in England are arrested, and Roman Catholic bishops are restored.",
    "October 6 – Şehzade Mustafa, oldest son of Suleiman the Magnificent, is executed in Konya by order of his father.[8]",
    "September 23 – The Sadians consolidate their power in Morocco, by defeating the last of their enemies.",
    "October 27 – Geneva's governing council burns Michael Servetus at the stake, as a heretic.",
    "December 25 – Battle of Tucapel: Mapuche rebels under Lautaro defeat the Spanish conquistadors, and execute Pedro de Valdivia, the first Royal Governor of Chile.",
    "Tonbridge School is founded by Sir Andrew Judde, under letters patent of Edward VI of England.",
    "The xiii Bukes of Eneados of the famose Poete Virgill, the first complete translation of any major work of classical antiquity into one of the English languages, is published in London.",
    "In Ming Dynasty China:\nThe addition of a new section of the Outer City fortifications is completed in southern Beijing, bringing the overall size of Beijing to 18 square miles (4662 hectares).\nShanghai is fortified for the first time.",
    "The addition of a new section of the Outer City fortifications is completed in southern Beijing, bringing the overall size of Beijing to 18 square miles (4662 hectares).",
    "Shanghai is fortified for the first time."
  ],
  "births": [
    "January 20 – Bernardino de Cárdenas y Portugal, Duque de Maqueda, Spanish noble (d. 1601)",
    "January 22 – Mōri Terumoto, Japanese warrior (d. 1625)",
    "February 24 – Cherubino Alberti, Italian engraver and painter (d. 1615)",
    "March – Eleonora di Garzia di Toledo, Italian noble (d. 1576)",
    "March 29 – Vitsentzos Kornaros, Greek writer (d. 1613)",
    "April 24 – John Maxwell, 8th Lord Maxwell, Scottish noble (d. 1593)",
    "April 29 – Mirza Muhammad Hakim, son of Mughal emperor Humayun and brother of emperor Akbar (d. 1585)",
    "April 30 – Louise of Lorraine, French queen consort (d. 1601)",
    "May 7 – Albert Frederick, Duke of Prussia (d. 1618)",
    "May 15 – Margaret of Valois, Queen of France (d. 1615)",
    "June 5 – Bernardino Baldi, Italian mathematician and writer (d. 1617)",
    "June 15 – Archduke Ernest of Austria, Austrian prince, the son of Maximilian II. (d. 1595)",
    "July 1 – Peter Street, English carpenter (d. 1609)",
    "September 26 – Nicolò Contarini, Doge of Venice (d. 1631)",
    "October 8 – Jacques Auguste de Thou, French historian (d. 1617)",
    "October 18 – Luca Marenzio, Italian composer (d. 1599)",
    "November 2 – Magdalene of Jülich-Cleves-Berg, Countess Palatine of Pfalz-Zweibrücken (d. 1633)",
    "November 4 – Roger Wilbraham, Solicitor-General for Ireland (d. 1616)",
    "November 23 – Prospero Alpini, Italian physician and botanist (d. 1617)",
    "November 28 – George More, English politician (d. 1632)",
    "December 13 – King Henry IV of France (d. 1610)[9]",
    "date unknown\nPatriarch Filaret of Moscow and All Rus' (d. 1633)\nGiovanni Florio, English writer and translator (d. 1625)\nRichard Hakluyt, English travel writer (d. 1616)\nRobert Hues, English mathematician and geographer (d. 1632)\nAmago Katsuhisa, Japanese nobleman (d. 1578)\nPierre de Rostegny, French jurist (d. 1631)\nWilliam Russell, 1st Baron Russell of Thornhaugh, English military leader (d. 1613)\nMoses Székely, Hungarian noble (d. 1603)\nBeatrice Michiel, Venetian spy (d. 1613)",
    "Patriarch Filaret of Moscow and All Rus' (d. 1633)",
    "Giovanni Florio, English writer and translator (d. 1625)",
    "Richard Hakluyt, English travel writer (d. 1616)",
    "Robert Hues, English mathematician and geographer (d. 1632)",
    "Amago Katsuhisa, Japanese nobleman (d. 1578)",
    "Pierre de Rostegny, French jurist (d. 1631)",
    "William Russell, 1st Baron Russell of Thornhaugh, English military leader (d. 1613)",
    "Moses Székely, Hungarian noble (d. 1603)",
    "Beatrice Michiel, Venetian spy (d. 1613)"
  ],
  "deaths": [
    "January 13 – George II, Duke of Münsterberg-Oels, Count of Glatz (b. 1512)",
    "February 4 – Caspar Othmayr, German Protestant priest, theologian and composer (b. 1515)",
    "February 6 – Ernest, Margrave of Baden-Durlach (b. 1482)",
    "February 8 – John Ernest, Duke of Saxe-Coburg, (b. 1521)",
    "February 17 – Chamaraja Wodeyar III, King of Mysore (b. 1492)",
    "February 19 – Erasmus Reinhold, German astronomer and mathematician (b. 1511)",
    "February 25 – Hirate Masahide, Japanese diplomat and tutor of Oda Nobunaga (suicide) (b. 1492)",
    "April – Minkhaung of Prome, last king of Prome in Burma (Myanmar).",
    "April 9 – François Rabelais, French writer[10]",
    "May 5 – Erasmus Alberus, German humanist (b. 1500)",
    "May 28 – Johannes Aal, Swiss theologian (b. 1500)",
    "June 26 – Tsarevich Dmitry Ivanovich of Russia, Grand Prince of Moscow (b. 1552)",
    "July 6 – King Edward VI of England (b. 1537)[11]",
    "July 9 – Maurice, Elector of Saxony (b. 1521)[4]",
    "July 16 – Bernardino Maffei, Catholic cardinal (b. 1514)",
    "August 6 – Girolamo Fracastoro, Italian physician (b. 1478)",
    "August 17 – Charles III, Duke of Savoy (b. 1486)",
    "August 22 – John Dudley, 1st Duke of Northumberland (b. 1502; executed)",
    "September 6 – Juan de Homedes y Coscon, 47th Grandmaster of the Knights Hospitaller (b. c.1477)",
    "October 6 – Şehzade Mustafa, Suleiman the Magnificent's first-born son by Mahidevran Sultan (b. 1515)",
    "October 7 – Cristóbal de Morales, Spanish composer (b. 1500)[12]",
    "October 16 – Lucas Cranach the Elder, German painter (b. 1472)",
    "October 17 – George III, Prince of Anhalt-Dessau, German prince (b. 1507)",
    "October 27 – Michael Servetus, Spanish Protestant theologian (burned at the stake) (b. 1511)",
    "October 28 – Giovanni Salviati, Italian Catholic cardinal (b. 1490)",
    "October 30 – Jacob Sturm von Sturmeck, German statesman and reformer (b. 1489)",
    "November 15 – Lucrezia de' Medici, Italian noblewoman (b. 1470)",
    "November 23 – Sebastiano Antonio Pighini, Italian cardinal (b. 1500)",
    "November 27 – Şehzade Cihangir, Ottoman prince (b. 1531)",
    "December 3 – Ludwig of Hanau-Lichtenberg, German nobleman (b. 1487)",
    "December 25 – Pedro de Valdivia, Spanish conquistador (b. 1497)",
    "date unknown\nGeorge Joye, English Protestant Bible translator (b. c. 1495)\nGunilla Bese, Finnish noble and fiefholder (b. 1475)",
    "George Joye, English Protestant Bible translator (b. c. 1495)",
    "Gunilla Bese, Finnish noble and fiefholder (b. 1475)"
  ]
}