{
  "events": [
    "March – The Takeda clan besiege Katsurayama Castle in eastern Japan. The siege ends with the last stand of the castle garrison, and the complete destruction of Katsurayama, allowing the Takeda to further expand in Shinano Province.",
    "April 12 – The Spanish settlement of Cuenca, Ecuador, is founded.",
    "April 30 – Arauco War – Battle of Mataquito: Spanish forces of Governor Francisco de Villagra launch a dawn surprise attack against the Mapuche (headed by their toqui Lautaro), in present-day Chile.",
    "By June – The 1557 influenza pandemic has spread, probably from China, to Europe.",
    "June 7 – Mary I of England joins her husband Philip II of Spain, in his war against France.",
    "June 10 – The New Testament of the Geneva Bible, a Protestant Bible translation into English (produced under the supervision of William Whittingham, and printed in Roman type), is published in Geneva.",
    "August 10 – Battle of St. Quentin: French forces under Marshal Anne de Montmorency are decisively defeated by the Spanish and English under Duke Emanuel Philibert of Savoy. Montmorency himself is captured, but Philip II refuses to press his advantage, and withdraws to the Netherlands.",
    "September 11–October 8 – The Colloquy of Worms convenes.",
    "October 23 – Mohammed al-Shaykh was assassinated.",
    "October 27 – Emperor Ōgimachi accedes to the throne of Japan.",
    "Özdemir Pasha conquers the Red Sea port of Massawa for the Ottoman Empire.",
    "Cossack chieftain Dimitrash tries to take Azov.",
    "With the permission of the Ming dynasty government of China, and for the benefit of both Western and Eastern merchants, the Portuguese settle in Macau (retroceded in 1999). Direct Sino-Portuguese trade has existed since 1513, but this is the first official legal treaty port on traditional Chinese soil, that will form a long-term Western settlement.",
    "Spain becomes bankrupt, throwing the German banking houses into chaos.[1]",
    "Gonville and Caius College, Cambridge, is refounded by John Caius.[2]",
    "The following schools are founded in England:\nBrentwood School, Essex, by Sir Antony Browne.\nHampton School, Hampton, London, by Robert Hammond.\nRepton School, by Sir John Port.",
    "Brentwood School, Essex, by Sir Antony Browne.",
    "Hampton School, Hampton, London, by Robert Hammond.",
    "Repton School, by Sir John Port.",
    "Welsh-born mathematician Robert Recorde publishes The Whetstone of Witte in London, containing the first recorded use of the equals sign and also the first use in English of plus and minus signs.[3]",
    "German adventurer Hans Staden publishes a widely translated account of his detention by the Tupí people of Brazil, Warhaftige Historia und beschreibung eyner Landtschafft der Wilden Nacketen, Grimmigen Menschfresser-Leuthen in der Newenwelt America gelegen (\"True Story and Description of a Country of Wild, Naked, Grim, Man-eating People in the New World, America\")."
  ],
  "births": [
    "January 1 – Stephen Bocskay, Prince of Transylvania (d. 1606)",
    "February 11 – Johannes Wtenbogaert, Leader of the Remonstrants (d. 1644)",
    "February 15\nAlfonso Fontanelli, Italian composer (d. 1622)\nVittoria Accoramboni, Italian noblewoman (d. 1585)",
    "Alfonso Fontanelli, Italian composer (d. 1622)",
    "Vittoria Accoramboni, Italian noblewoman (d. 1585)",
    "February 24 – Mathias, Holy Roman Emperor (d. 1619)",
    "March 21 – Anne Howard, Countess of Arundel, English countess and poet (d. 1630)",
    "March 22 – Casimir VI, Duke of Pomerania and Lutheran Administrator of Cammin Prince-Bishopric (d. 1605)",
    "April 4 – Lew Sapieha, Polish-Lithuanian noble (d. 1633)",
    "April 11 – Frederick, Count Palatine of Zweibrücken-Vohenstrauss-Parkstein (d. 1597)",
    "May 5 – Emanuel Philibert de Lalaing, Belgian noble and army commander (d. 1590)",
    "May 31 – Tsar Feodor I of Russia (d. 1598)",
    "June 10 – Leandro Bassano, Italian painter (d. 1622)",
    "June 28 – Philip Howard, 20th Earl of Arundel, English nobleman (d. 1595)",
    "August 16 – Agostino Carracci, Italian painter and graphical artist (d. 1602)",
    "August 19 – Frederick I, Duke of Württemberg (d. 1608)",
    "August 26 – Sibylle of Jülich-Cleves-Berg, Duchess of Jülich-Cleves-Berg by birth and by marriage Margravine of Burgau (d. 1628)",
    "September 4 – Sophie of Mecklenburg-Güstrow, Danish-Norwegian royal consort (d. 1631)",
    "September 11 – Joseph Calasanz, Spanish priest and founder of Piarists (d. 1648)",
    "September 16 – Jacques Mauduit, French composer (d. 1627)",
    "October 5 – Antoine Favre, Savoisian lawyer, first President of the Sovereign Senate of Savoy (d. 1624)",
    "date unknown\nJulius Caesar, English judge and politician (d. 1636)\nGiovanni Croce, Italian composer (d. 1609)\nBalthasar Gérard, assassin of William I of Orange (d. 1584)\nToda Katsushige, Japanese warlord (d. 1600)\nOlaus Martini, Archbishop of Uppsala (d. 1609)\nThomas Morley, English composer (d. 1602)\nOda Nobutada, Japanese general (d. 1582)",
    "Julius Caesar, English judge and politician (d. 1636)",
    "Giovanni Croce, Italian composer (d. 1609)",
    "Balthasar Gérard, assassin of William I of Orange (d. 1584)",
    "Toda Katsushige, Japanese warlord (d. 1600)",
    "Olaus Martini, Archbishop of Uppsala (d. 1609)",
    "Thomas Morley, English composer (d. 1602)",
    "Oda Nobutada, Japanese general (d. 1582)",
    "probable – Giovanni Gabrieli, Italian composer and organist (d. 1612)"
  ],
  "deaths": [
    "January 2 – Pontormo, Italian painter (b. 1494)",
    "January 4 – Philip, Duke of Mecklenburg, (b. 1514)",
    "January 8 – Albert Alcibiades, Margrave of Brandenburg-Kulmbach (\"Albert the Warlike\"), Prince of Bayreuth (b. 1522)[4]",
    "March 13 – Louis de Bourbon de Vendôme, French cardinal (b. 1493)",
    "April 9 – Mikael Agricola, Finnish scholar (b. c. 1510)",
    "April 24 – Georg Rörer, German theologian (b. 1492)",
    "April 29 – Lautaro, Mapuche warrior (b. 1534)",
    "May 18 – John II, Count Palatine of Simmern, Count Palatine of Simmern (1509-1557) (b. 1492)",
    "June 11 – King John III of Portugal (b. 1502)",
    "July 10 – Giovanni Battista Ramusio, Italian geographer (b. 1485)",
    "July 16 – Anne of Cleves, fourth queen of Henry VIII of England (b. 1515)[5]",
    "August 1 – Olaus Magnus, Swedish ecclesiastic and writer (b. 1490)",
    "August 18 – Claude de la Sengle, 48th Grandmaster of the Knights Hospitaller (b. 1494)",
    "September 1 – Jacques Cartier, French explorer (b. 1491)[6]",
    "September 13 – John Cheke, English classical scholar and statesman (b. 1514)",
    "September 15 – Juan Álvarez de Toledo, Spanish Catholic cardinal (b. 1488)",
    "September 27 – Emperor Go-Nara of Japan (b. 1495)",
    "October 5 or October 6 – Kamran Mirza, Mughal prince (b. 1509)",
    "October 20 – Jean Salmon Macrin, French poet (b. 1490)",
    "October 25 – William Cavendish, English courtier (b. 1505)",
    "November 19\nBona Sforza, queen of Sigismund I of Poland (b. 1494)\nMaria de' Medici, Italian noble (b. 1540)",
    "Bona Sforza, queen of Sigismund I of Poland (b. 1494)",
    "Maria de' Medici, Italian noble (b. 1540)",
    "December 6 – Elisabeth of Hesse, Hereditary Princess of Saxony (b. 1502)",
    "December 13 – Niccolò Fontana Tartaglia, Italian mathematician (b. 1499)",
    "December 27 – Queen Dangyeong, Korean royal consort (b. 1487)",
    "date unknown\nGonzalo Fernández de Oviedo y Valdés, Spanish historian (b. 1478)\nCharlotte Guillard, French printer\nNicolas de Herberay des Essarts, French translator\nGeoffrey Glyn, English lawyer[7]",
    "Gonzalo Fernández de Oviedo y Valdés, Spanish historian (b. 1478)",
    "Charlotte Guillard, French printer",
    "Nicolas de Herberay des Essarts, French translator",
    "Geoffrey Glyn, English lawyer[7]",
    "probable\nSebastian Cabot, Italian-born English explorer (b. 1476)\nThomas Crecquillon, Flemish composer (b. 1490)",
    "Sebastian Cabot, Italian-born English explorer (b. 1476)",
    "Thomas Crecquillon, Flemish composer (b. 1490)"
  ]
}