{
  "events": [
    "January 6 – Shane O'Neill of Tír Eoghain pleads his cause at the Palace of Whitehall in London, before Queen Elizabeth I of England, who recognises his status. He returns to Ireland on May 26, and resumes his rebellious activities by November.[1]",
    "January 17 – Huguenots are recognized under the Edict of Saint-Germain.",
    "January 18\nThe Council of Trent reconvenes, after a gap of 10 years.\nThomas Norton and Thomas Sackville's play Gorboduc is performed for the first time, before Queen Elizabeth I of England. It is the first known English tragedy, and the first English language play to employ blank verse.[2]",
    "The Council of Trent reconvenes, after a gap of 10 years.",
    "Thomas Norton and Thomas Sackville's play Gorboduc is performed for the first time, before Queen Elizabeth I of England. It is the first known English tragedy, and the first English language play to employ blank verse.[2]",
    "March 1 – Over 80 (?) Huguenots are massacred by the ultra-Catholic Francis, Duke of Guise in Wassy-sur-Blaise, marking the start of the First War of Religion in France. Protestant forces, led by Louis I de Bourbon, Prince de Condé and Gaspard de Coligny, quickly seize control of Orléans, Rouen, and other cities throughout France.[3]",
    "March – English merchant Anthony Jenkinson has an audience with Ivan the Terrible in Moscow, before continuing his second expedition through the Grand Duchy of Moscow to Qazvin, capital of the Safavid Dynasty in Persia.",
    "May 1 – Jean Ribault, French navigator, lands in Florida, and later establishes a Huguenot colony at Charlesfort on Parris Island, South Carolina.",
    "July 12 – Fray Diego de Landa, acting Bishop of Yucatan, burns the sacred books of the Maya.",
    "August – The Wiesensteig witch trial begins.",
    "September 20 – The Treaty of Hampton Court, between Queen Elizabeth I of England and Huguenot leader Louis, Prince of Condé, is signed.[4]",
    "September 22 – Maximilian, son of the Emperor Ferdinand I, succeeds as king of the Kingdom of Bohemia.",
    "October – John Hawkins initiates the English trans-Atlantic slave trade, shipping slaves from Sierra Leone, on the Guinea Coast, to Hispaniola in the Caribbean.[5] As a result, the Spanish prohibit English ships from trading at their new world ports.",
    "October 4 – English forces under Ambrose Dudley, 3rd Earl of Warwick, land at Le Havre to aid the Huguenots.[4]",
    "October 19 – La Herradura naval disaster: Twenty-five ships sink in a storm, and some 5,000 people are killed.",
    "October 26 – Rouen is captured by Royalist forces under Antoine de Bourbon, King of Navarre, who is mortally wounded.",
    "November 5 – Battle of Corrichie in Scotland: The rebellion of George Gordon, Earl of Huntly is crushed by James Stewart, Earl of Moray.[6]",
    "November 20 – Maximilian of Bohemia is elected King of the Romans.",
    "December 19 – Battle of Dreux: Huguenot and Catholic forces fight a bloody battle, narrowly won by the Catholic side. The official leaders of both armies are captured in the battle.[7]",
    "Mughal Emperor Akbar conquers Malwa, and its last Sultan, Baz Bahadur, flees.",
    "The Church of England approves the Thirty-Nine Articles of Religion, defining its doctrinal stance.[5]",
    "Dudley Grammar School is established, and Gresham's School is granted a royal charter, in England.",
    "Fausto Sozzini publishes Brevis explicatio in primum Johannis caput, originating Socinianism.",
    "Giacomo Barozzi da Vignola publishes Regola delli cinque ordini d'architettura (Rules of the Five Orders of Architecture);[8] it will become in succeeding centuries the most published book in architectural history.[9]",
    "The Pünte at Wiltshausen, a small, hand-operated ferry, now a historic monument, is first recorded.",
    "The Portuguese army is defeated at the Battle of Mulleriyawa, Sri Lanka, at the hand of the Sitawaka army commanded by Prince Tikiri Bandara (King Rajasinghe), leaving 1600 dead. This is considered the worst defeat the Portuguese had at that time."
  ],
  "births": [
    "January – Edward Blount, English publisher (d. 1632)",
    "January 12 – Charles Emmanuel I, Duke of Savoy (d. 1630)[10]",
    "January 13 – Mark Alexander Boyd, Scottish poet and soldier of fortune (d. 1601)",
    "January 20\nMaria of Hanau-Münzenberg, German noblewoman (d. 1605)\nOttavio Rinuccini, Italian composer (d. 1621)[11]",
    "Maria of Hanau-Münzenberg, German noblewoman (d. 1605)",
    "Ottavio Rinuccini, Italian composer (d. 1621)[11]",
    "February 15\nRascas de Bagarris, French scholar (d. 1620)\nMaeda Toshinaga, Japanese daimyō (noble) (d. 1614)",
    "Rascas de Bagarris, French scholar (d. 1620)",
    "Maeda Toshinaga, Japanese daimyō (noble) (d. 1614)",
    "March 27 – Jacob Gretser, German Jesuit writer (d. 1625)",
    "April or May – Jan Pieterszoon Sweelinck, Dutch composer (d. 1621)",
    "April 21 – Valerius Herberger, German theologian (d. 1627)",
    "April 24 – Xu Guangqi, Ming Dynasty Chinese politician, agronomist, astronomer, mathematician and lay Catholic leader (d. 1633)",
    "April 25 – Friedrich Wilhelm I, Duke of Saxe-Weimar, German noble (d. 1602)",
    "May 6 – Pietro Bernini, Italian sculptor (d. 1629)",
    "May 26 – James III, Margrave of Baden-Hachberg (d. 1590)",
    "May 28 – John William, Duke of Jülich-Cleves-Berg (d. 1609)",
    "June 24 – Duke François de Joyeuse, French churchman and politician (d. 1615)",
    "June 26 – Anne of Ostfriesland, German noble, Electress Palatine (d. 1621)",
    "July 25 – Katō Kiyomasa, Japanese samurai (d. 1611)",
    "August 17 (bapt.) – Hans Leo Hassler, German composer (d. 1612)",
    "August 19 – Charles II de Bourbon-Vendôme, French cardinal (d. 1594)",
    "September 1 – George, Count of Nassau-Dillenburg (1607-1620) and (1620-1623) (d. 1623)",
    "September 21 – Vincenzo Gonzaga, Duke of Mantua and Montferrat (1587-1612) (d. 1612)",
    "September 24 – Ercole, Lord of Monaco, Monegasque noble (d. 1604)",
    "October 4 – Christian Sørensen Longomontanus, Danish astronomer (d. 1647)",
    "October 19 – George Abbot, Archbishop of Canterbury (d. 1633)",
    "November 25 – Lope de Vega, Spanish poet and dramatist (d. 1635)[12]",
    "December 10 – Roger de Saint-Lary de Termes, French noble (d. 1646)",
    "December 14 – Sir Lionel Tollemache, 1st Baronet, English baronet (d. 1621)",
    "December 18 – Philipp Dulichius, German composer (d. 1631)",
    "date unknown\nIsabella Andreini, Italian actress (d. 1604)\nJohn Bull, English composer (d. 1628)\nHenry Constable, English poet (d. 1613)\nSamuel Daniel, English poet and historian (d. 1619)\nFrancis Godwin, English writer and bishop (d. 1633)\nGeorge Gordon, 1st Marquess of Huntly, Scottish noble (d. 1636)\nNatsuka Masaie, Japanese daimyō (noble) (d. 1600)\nPaulo Miki, Japanese Catholic saint and martyr (d. 1597)\nRichard Neile, English bishop (d. 1640)\nHenry Spelman, English antiquary (d. 1641)\nCornelis van Haarlem, Dutch painter (d. 1638)",
    "Isabella Andreini, Italian actress (d. 1604)",
    "John Bull, English composer (d. 1628)",
    "Henry Constable, English poet (d. 1613)",
    "Samuel Daniel, English poet and historian (d. 1619)",
    "Francis Godwin, English writer and bishop (d. 1633)",
    "George Gordon, 1st Marquess of Huntly, Scottish noble (d. 1636)",
    "Natsuka Masaie, Japanese daimyō (noble) (d. 1600)",
    "Paulo Miki, Japanese Catholic saint and martyr (d. 1597)",
    "Richard Neile, English bishop (d. 1640)",
    "Henry Spelman, English antiquary (d. 1641)",
    "Cornelis van Haarlem, Dutch painter (d. 1638)"
  ],
  "deaths": [
    "January – Prince Ilie II Rareş of Moldavia (b. 1531)",
    "January 25 – Charles Wriothesley, English officer of arms (b. 1508)",
    "February 3 – Georg Giese, German merchant (b. 1497)",
    "May 4 – Lelio Sozzini, Italian Protestant theologian (b. 1525)",
    "July 1 – Wilhelm IV of Eberstein, German President of the Reichskammergericht (b. 1497)",
    "July 4 – Johann Hommel, German astronomer and mathematician (b. 1518)",
    "July 23 – Götz von Berlichingen, German knight and mercenary (b. 1480)",
    "September 5 – Katharina Zell, German Protestant reformer (b. 1497)",
    "October – George Gordon, 4th Earl of Huntly (b. 1514)",
    "October 9 – Gabriele Falloppio, Italian anatomist (b. 1523)[13]",
    "October 13 – Claudin de Sermisy, French composer (b. 1495)",
    "October 18 – Anne d'Alençon, French noblewoman (b. 1492)",
    "November 7 – Maldeo Rathore, Rao of Marwar (b. 1511)",
    "November 12 – Pietro Martire Vermigli, Italian theologian (b. 1500)",
    "November 17 – Antoine de Bourbon, father of Henry IV of France (b. 1518)",
    "November 20 – Giovanni de' Medici, Italian Catholic cardinal (b. 1544)",
    "December 6\nJan van Scorel, Dutch painter (b. 1495)\nGarzia de' Medici, Italian noble (b. 1547)",
    "Jan van Scorel, Dutch painter (b. 1495)",
    "Garzia de' Medici, Italian noble (b. 1547)",
    "December 7 – Adrian Willaert, Flemish composer (b. c. 1490)",
    "December 13 – Francesco Marinoni, Italian Catholic priest (b. 1490)",
    "December 17 – Eleonora di Toledo, Grand Duchess of Tuscany (b. 1522)",
    "December 27 – Joachim of Münsterberg-Oels, Duke of Münsterberg, Duke of Oels, Count of Kladsko, Bishop of Brandenburg (b. 1503)",
    "date unknown\nCristóbal de Guzmán Cecetzin, Tlatoani of Tenochtitlan and Governor of San Juan Tenochtitlan\nMatteo Bandello, Italian novelist (b. 1480)\nNicholas Grimald, English poet and theologian (b. 1519)",
    "Cristóbal de Guzmán Cecetzin, Tlatoani of Tenochtitlan and Governor of San Juan Tenochtitlan",
    "Matteo Bandello, Italian novelist (b. 1480)",
    "Nicholas Grimald, English poet and theologian (b. 1519)"
  ]
}