{
  "events": [
    "January 11–May 6 – The first recorded lottery in England is performed nonstop, at the west door of St Paul's Cathedral. Each share costs ten shillings, and proceeds are used to repair harbours, and for other public works.",
    "March 13 – Battle of Jarnac: Royalist troops under Marshal Gaspard de Tavannes surprise and defeat the Huguenots under the Prince of Condé, who is captured and murdered. A substantial proportion of the Huguenot army manages to escape, under Gaspard de Coligny.[1]",
    "June 10 – German Protestant troops reinforce Coligny, near Limoges.",
    "July 1 – The Union of Lublin unites the Kingdom of Poland and the Grand Duchy of Lithuania into a single state, the Polish–Lithuanian Commonwealth, following votes in the Assemblies of three Lithuanian provinces (Volhynia, Ukraine and Podlasie) in favour of the incorporation.",
    "July–September – Huguenot forces under Coligny and 15-year-old Prince Henry of Navarre besiege Poitiers.",
    "August 2 – Burma invades Siam and captures Ayutthaya. Siam becomes a vassal of Burma.",
    "August 24 – Battle of Orthez: Huguenot forces under Gabriel, comte de Montgomery defeat Royalist forces under General Terride, in French Navarre. Catholics surrender under the condition that their lives will be spared. Huguenots agree, but then massacre the Catholics anyway.[2]",
    "September – A Royalist army under the Duc d'Anjou and Marshal Tavannes forces Coligny to abandon the siege of Poitiers.",
    "October 3 – Battle of Moncontour: The Royalist forces of Tavannaes and Anjou defeat Coligny's Huguenots.",
    "November–December – Rising of the North in England: Three northern earls lead a rebellion against Queen Elizabeth I, in an attempt to place the Catholic Mary, Queen of Scots, on the English throne, but are driven out of the country.",
    "The Mercator projection is first used in Gerardus Mercator's world map, Nova et Aucta Orbis Terrae Descriptio ad Usum Navigantium Emendata.[3]",
    "A conspiracy with the intent to depose John III of Sweden and reinstate the imprisoned Eric XIV of Sweden on the Swedish throne is exposed in Sweden.",
    "The trade compact of 1536 is renewed, exempting French merchants from Ottoman law, and allowing them to travel, buy and sell throughout the sultan's dominions, and to pay low customs duties on French imports and exports.",
    "Akbar founds Fatehpur Sikri, to honor the Muslim holy man Shaikh Salim Chisti, who has foretold the birth of Akbar's son and heir, Jahangir."
  ],
  "births": [
    "January 20 – Heribert Rosweyde, Jesuit hagiographer (d. 1629)",
    "January 22 – Lucio Massari, Italian painter (d. 1633)",
    "February 13 – Johann Reinhard I, Count of Hanau-Lichtenberg (d. 1625)",
    "March 28 – Ranuccio I Farnese, Duke of Parma (d. 1622)",
    "April 10 – Countess Emilia of Nassau, German countess (d. 1629)",
    "April 15 – Joan Shakespeare, William Shakespeare's sister (d. 1646)",
    "April 16 – John Davies, English poet and lawyer (d. 1626)",
    "May 20 – Juan de la Cerda, 6th Duke of Medinaceli, Spanish noble (d. 1607)",
    "June 1 – Sophia of Holstein-Gottorp, Regent of Mecklenburg-Schwerin (1603–1608) (d. 1634)",
    "June 30 – Hedwig of Hesse-Kassel, countess consort of Schaumburg (d. 1644)",
    "July 3 – Thomas Richardson, English politician and judge (d. 1635)",
    "July 19 – Conrad Vorstius, Dutch theologian (d. 1622)",
    "July 30 – Karl I, Prince of Liechtenstein (d. 1627)",
    "August 31 – Jahangir, Mughal emperor (d. 1627)[4]",
    "September – Arthur Lake, English bishop, a translator of the King James Bible (d. 1626)",
    "September 5 – Georg Friedrich of Hohenlohe-Neuenstein-Weikersheim, officer and amateur poet (d. 1645)",
    "September 9 – Joachim Andreas von Schlick, Czech leader (d. 1621)",
    "September 23 – Tachibana Ginchiyo, female samurai leader of the Tachibana clan in Japan (d. 1602)",
    "September 24 – Ernst of Schaumburg, Count of Holstein-Pinneberg and Schaumburg (1601–1622) (d. 1622)",
    "September 27 – John Percy, English priest (d. 1641)",
    "October 13 – Claude de Bullion, French Minister of Finance (d. 1640)",
    "October 14 – Giambattista Marino, Italian poet (d. 1625)",
    "November 5 – Nils Turesson Bielke, Swedish politician (d. 1639)",
    "November 11 – Martin Ruland the Younger, German alchemist (d. 1611)",
    "November 16 – Paul Sartorius, German composer (d. 1609)",
    "November 18 – Antonio Marcello Barberini, Italian cardinal and the younger brother of Maffeo Barberini (d. 1646)",
    "November 24 – Francis Ashley, English politician (d. 1635)",
    "December 15 – Muzio Oddi, Italian mathematician (d. 1639)",
    "December 18 – Jakob Hassler, German composer (d. 1622)",
    "December 22 – Étienne Martellange, French architect (d. 1641)",
    "December 31 – Anna de' Medici, Tuscan princess (d. 1584)",
    "date unknown\nGuillén de Castro y Bellvis, Spanish dramatist (d. 1631)\nTobias Hume, English composer (d. 1645)\nWilliam Monson, British admiral (d. 1643)\nFrans Pourbus the Younger, Flemish painter (d. 1622)\nJohn Suckling, English politician (d. 1627)\nYodo-dono, Japanese concubine of Toyotomi Hideyoshi (d. 1615)",
    "Guillén de Castro y Bellvis, Spanish dramatist (d. 1631)",
    "Tobias Hume, English composer (d. 1645)",
    "William Monson, British admiral (d. 1643)",
    "Frans Pourbus the Younger, Flemish painter (d. 1622)",
    "John Suckling, English politician (d. 1627)",
    "Yodo-dono, Japanese concubine of Toyotomi Hideyoshi (d. 1615)"
  ],
  "deaths": [
    "January 15 – Catherine Carey lady-in-waiting to Elizabeth I of England (b. 1524)",
    "January 20 – Myles Coverdale, English Bible translator (b. c. 1488)[5]",
    "March 13 – Louis, Prince of Condé, French Protestant general (b. 1530)[1]",
    "March 17 – Karl Christoph, Duke of Münsterberg (b. 1545)",
    "April 15 –Maha Chakkraphat, Siamese King of the Ayutthaya Kingdom (b. 1509)",
    "May 10 – John of Ávila, Spanish mystic and saint (b. 1500)",
    "May 16 – Dirk Willems, Dutch Anabaptist martyr",
    "May 17 – Georg, Count Palatine of Simmern-Sponheim (b. 1518)",
    "May 26 – Vidus Vidius, Italian surgeon and anatomist (b. 1509)",
    "May 27 – François de Coligny d'Andelot, French general (b. 1521)",
    "June 11 – Wolfgang, Count Palatine of Zweibrücken (b. 1526)",
    "September 5\nEdmund Bonner, Bishop of London (b. c. 1500)\nBernardo Tasso, Italian courtier and poet (b. 1493)",
    "Edmund Bonner, Bishop of London (b. c. 1500)",
    "Bernardo Tasso, Italian courtier and poet (b. 1493)",
    "September 9 – Pieter Bruegel the Elder, Flemish painter[6]",
    "September 11 – Vincenza Armani, Italian actress  (b. 1530)",
    "October 3 – Philibert, Margrave of Baden-Baden (b. 1536)",
    "October 9 – Vladimir of Staritsa, Russian prince (b. 1533)",
    "October 28 – Ludovica Torelli, Count of Guastalla (b. 1500)",
    "November 24 – Celio Secondo Curione, Italian humanist (b. 1503)",
    "November 29 – António Ferreira, Portuguese poet (b. 1528)",
    "December 10 – Paul Eber, German Lutheran theologian (b. 1511)",
    "December 15 – Ludowika Margaretha of Zweibrücken-Bitsch, spouse of Count Philip V of Hanau-Lichtenberg (b. 1540)",
    "December 23 – Philip II, Metropolitan of Moscow (b. 1507)",
    "date unknown – Janet Beaton, Scottish noble (b. 1519)\nElin Andersdotter, Swedish lady-in-waiting and political conspirator\nGracia Mendes Nasi, Ottoman businessperson and philanthropist (b. 1510)\nMahinthrathirat, Ayutthaya king (b. 1539)",
    "Elin Andersdotter, Swedish lady-in-waiting and political conspirator",
    "Gracia Mendes Nasi, Ottoman businessperson and philanthropist (b. 1510)",
    "Mahinthrathirat, Ayutthaya king (b. 1539)"
  ]
}