{
  "events": [
    "January 16 – Thomas Howard, 4th Duke of Norfolk, is tried for treason, for his part in the Ridolfi plot to restore Catholicism in England. He is executed on June 2.[1]",
    "February – Harrow School is founded, with a royal charter from Queen Elizabeth I of England.[2]",
    "February 13 – Elizabeth I of England issues a proclamation which revokes all commissions, on account of the frauds which they had fostered.",
    "April 1 – Capture of Brielle: The Sea Beggars, Netherlandish Calvinist rebels, capture the port city of Brielle. This leads to a wave of uprisings in Holland and Zeeland against Spanish Habsburg rule, leaving most of those provinces (with the exception of Amsterdam) under rebel control.",
    "May 13 – Pope Gregory XIII succeeds Pope Pius V, as the 226th pope.[3]",
    "June 25 – The Sea Beggars capture the city of Gorkum; several Roman Catholic priests are imprisoned.",
    "July 9 – The Sea Beggars hang 19 previously imprisoned Roman Catholic priests (the Martyrs of Gorkum) at Brielle.",
    "July 11 – Humphrey Gilbert leads 1,500 volunteers from England, on an expedition to assist the Sea Beggars.[1]",
    "July 19 – Wanli Emperor of China ascends the throne at the age of nine; he will rule for 48 years.",
    "July 29–August 2 – Battle of Molodi: A large Crimean Tatar–Ottoman army which invaded Russia is routed.",
    "August 18 – Huguenot King Henry III of Navarre marries Margaret of Valois, sister of King Charles and daughter of Catherine de' Medici, in a supposed attempt to reconcile Protestants and Catholics in France.[4]",
    "August 24 – St. Bartholomew's Day massacre: Catholics in Paris murder thousands of Protestants, including Gaspard de Coligny and Petrus Ramus, at the order of King Charles IX, with Catherine de Medici's connivance. Henry of Navarre and the Prince of Condé barely escape the same fate. This brings about the Fourth War of Religion in France.[5]",
    "October 20 – Eighty Years' War – Relief of Goes: Soldiers of the Spanish Tercios wade across the estuary of the Scheldt, to relieve the siege of Goes in the Spanish Netherlands.",
    "November 9\nSiege of Sancerre: Catholic forces of the king lay siege to Sancerre, a Huguenot stronghold in central France. The fortified city holds out for nearly eight months, without bombard artillery. This is one of the last times that slings are used in European warfare.\nSupernova SN 1572 is first observed in the constellation Cassiopeia, by Cornelius Gemma. Tycho Brahe, who notes it two days later, will use it to challenge the prevailing view that stars do not change.[6]  The supernova remnant remains visible through 1574.",
    "Siege of Sancerre: Catholic forces of the king lay siege to Sancerre, a Huguenot stronghold in central France. The fortified city holds out for nearly eight months, without bombard artillery. This is one of the last times that slings are used in European warfare.",
    "Supernova SN 1572 is first observed in the constellation Cassiopeia, by Cornelius Gemma. Tycho Brahe, who notes it two days later, will use it to challenge the prevailing view that stars do not change.[6]  The supernova remnant remains visible through 1574.",
    "December – The Siege of Haarlem is begun by the Duke of Alva, Spanish commander in the Netherlands.",
    "The Neo-Inca State in Vilcabamba, Peru, the last independent remnant of the Inca Empire, is conquered by Spain.",
    "Girolamo Mercuriale from Forlì (Italy) writes the work De morbis cutaneis (\"On the diseases of the skin\"), the first scientific tract on dermatology.",
    "Imaginary numbers are defined by Rafael Bombelli.",
    "Portugal's national epic Os Lusíadas by Luís de Camões is first published.[7]",
    "Georg Braun begins publication of his urban atlas, Civitates orbis terrarum, in Cologne."
  ],
  "births": [
    "January 7 – Antoine de Gaudier, French Jesuit writer (d. 1622)",
    "January 11 – Elizabeth Wriothesley, Countess of Southampton, English countess (d. 1655)",
    "January 22 – John Donne (d. 1631)",
    "February 1 – Ellen Marsvin, Danish noble, landowner and county administrator (d. 1649)",
    "February 14 – William Cooke, English politician (d. 1619)",
    "February 27 – Francis II, Duke of Lorraine (d. 1632)",
    "February 29 – Edward Cecil, 1st Viscount Wimbledon, English viscount (d. 1638)",
    "March 4 – István Esterházy, Hungarian noble (d. 1596)",
    "March 10 – Tommaso Caracciolo, Field Marshal of Spanish forces in the Thirty Years' War (d. 1631)",
    "March 20 – Otto III, Duke of Brunswick-Harburg (d. 1641)",
    "April 4 – William Strachey, English writer (d. 1621)",
    "April 14 – Adam Tanner, Austrian Jesuit professor of mathematics and philosophy (d. 1632)",
    "May 20 – John Davenant, English Anglican bishop (d. 1641)",
    "May 25 – Maurice, Landgrave of Hesse-Kassel, German musician (d. 1632)",
    "June 8 – Honorat de Porchères Laugier, French writer (d. 1653)",
    "June 10 – Henry II, Count of Reuss-Gera, Lord of Gera, Lobenstein and Oberkranichfeld (1572–1635) (d. 1635)",
    "June 11 – Ben Jonson, English dramatist (d. 1637)",
    "July 16 – Teimuraz I, Prince of Mukhrani, Georgian prince (d. 1625)",
    "July 25 – Theodorus Schrevelius, Dutch Golden Age writer and poet (d. 1649)",
    "August 6 – Fakhr-al-Din II, Ottoman Emir of Chouf (d. 1635)",
    "September 11 – Daniyal, Imperial Prince of the Royal House of Timur, Viceroy of Deccan (d. 1604)",
    "September 27 – Francis van Aarssens, Dutch diplomat (d. 1641)",
    "September 30 – Denis-Simon de Marquemont, French cardinal and archbishop (d. 1626)",
    "October 27 – Marie Elisabeth of France, French princess (d. 1578)",
    "November 4 – William Whitmore, English politician (d. 1648)",
    "November 7 – Johannes Saeckma, Dutch Golden Age magistrate and judge of Leeuwarden (d. 1636)",
    "November 8 – John Sigismund, Elector of Brandenburg (d. 1619)",
    "November 23 – Albret Skeel, State Admiral of Denmark (d. 1639)",
    "November 25 – Daniel Sennert, German physician, chemist (d. 1637)",
    "December 1 – Vilem Slavata of Chlum, Czech nobleman (d. 1652)",
    "December 20 – Edward Russell, 3rd Earl of Bedford, son of Sir Francis Russell (d. 1627)",
    "December 22 – Juan López de Agurto de la Mata, Spanish Catholic prelate who served as Bishop of Coro (later Bishop of Caracas) (1634–1637) and Bishop of Puerto Rico (1630–1634) (d. 1637)",
    "December 27 – Johannes Vodnianus Campanus, Czech humanist, composer, pedagogue, poet and dramatist (d. 1622)",
    "date unknown\nJohann Bayer, German astronomer (d. 1625)\nAlfonso de la Cueva, 1st Marquis of Bedmar, Spanish diplomat (d. 1655)\nArend Dickmann, Dutch admiral in the Polish Navy (d. 1627)\nJohn Floyd, English Jesuit (d. 1649)\nRegina Basilier, German-Swedish merchant banker (d. 1631)\nBartholomew Gosnold, English lawyer and explorer (d. 1607)\nCyril Lucaris, Greek prelate and theologian (d. 1637)\nJames Mabbe, English scholar and poet (d. 1642)\nThomas Tomkins, Welsh composer (d. 1656)",
    "Johann Bayer, German astronomer (d. 1625)",
    "Alfonso de la Cueva, 1st Marquis of Bedmar, Spanish diplomat (d. 1655)",
    "Arend Dickmann, Dutch admiral in the Polish Navy (d. 1627)",
    "John Floyd, English Jesuit (d. 1649)",
    "Regina Basilier, German-Swedish merchant banker (d. 1631)",
    "Bartholomew Gosnold, English lawyer and explorer (d. 1607)",
    "Cyril Lucaris, Greek prelate and theologian (d. 1637)",
    "James Mabbe, English scholar and poet (d. 1642)",
    "Thomas Tomkins, Welsh composer (d. 1656)",
    "probable – Giovanni Bernardino Azzolini or Mazzolini or Asoleni, Italian painter (d. c.1645)"
  ],
  "deaths": [
    "January 22 – Henry VI, Burgrave of Plauen (b. 1536)",
    "January 26 – Pierre de Monte, French 50th Grandmaster of the Knights Hospitaller (b. 1499)",
    "February 21 – Cho Shik, Korean Confucian scholar and politician (b. 1501)",
    "February 23 – Pierre Certon, French composer (b. c. 1510)",
    "February 26 – Pedro Agustín, Spanish Roman Catholic bishop (b. 1512)",
    "February 28\nAegidius Tschudi, Swiss historian (b. 1505)\nCatherine of Austria, Queen of Poland (b. 1533)\nUdai Singh II, King of Mewar (b. 1522)",
    "Aegidius Tschudi, Swiss historian (b. 1505)",
    "Catherine of Austria, Queen of Poland (b. 1533)",
    "Udai Singh II, King of Mewar (b. 1522)",
    "March 2 – Mem de Sá, Portuguese Governor-General of Brazil (b. c. 1500)",
    "March 10 – William Paulet, 1st Marquess of Winchester (b. c. 1483)",
    "March 27 – Girolamo Maggi, Italian Renaissance man (b. c. 1523)",
    "April 2 – Elisabeth of Brunswick-Lüneburg, Duchess of Guelders (1518–1538) (b. 1494)",
    "May 1 – Pope Pius V (b. 1504)",
    "May 11 – Moses Isserles, Polish Jewish rabbi and Talmudist (b. 1530)",
    "June 2 – Thomas Howard, 4th Duke of Norfolk (b. 1536)",
    "June 9 – Jeanne d'Albret, Queen of Navarre (b. 1528)",
    "June 28 – Johannes Goropius Becanus, Dutch physician, linguist, and humanist (b. 1519)",
    "July 5 – Longqing Emperor of China (b. 1537)",
    "July 7 – King Sigismund II Augustus of Poland (b. 1520)",
    "July 9\nJohn of Cologne, Dutch Franciscan friar, martyr and saint (b. 1510)\nMartyrs of Gorkum (b. Dutch nationality)\nNicholas Pieck, Dutch Franciscan friar, martyr and saint (b. 1534)",
    "John of Cologne, Dutch Franciscan friar, martyr and saint (b. 1510)",
    "Martyrs of Gorkum (b. Dutch nationality)",
    "Nicholas Pieck, Dutch Franciscan friar, martyr and saint (b. 1534)",
    "July 25 – Isaac Luria, Palestinian-born Jewish Kabbalist (b. 1534)",
    "August 20 – Miguel López de Legazpi, Spanish conquistador (b. 1502)",
    "August 24\nGaspard de Coligny, French Protestant leader (b. 1519)\nCharles de Téligny, French soldier and diplomat (b. 1535)",
    "Gaspard de Coligny, French Protestant leader (b. 1519)",
    "Charles de Téligny, French soldier and diplomat (b. 1535)",
    "August 26 – Pierre de la Ramée, French humanist scholar (b. 1515)",
    "August – Claude Goudimel, French composer (b. 1510)",
    "September – Denis Lambin, French classical scholar (b. 1520)",
    "September 19 – Archduchess Barbara of Austria (b. 1539)",
    "September 24 – Túpac Amaru, last of the Incas",
    "September 30 – Francis Borgia, Italian Jesuit priest and saint (b. 1510)",
    "October 24 – Edward Stanley, 3rd Earl of Derby, English politician (b. 1508)",
    "October 25 – Cosimo Bartoli, Italian diplomat and writer (b. 1503)",
    "October 29 – John Erskine, Earl of Mar, regent of Scotland",
    "November 9 – Al-Mutahhar, Imam of the Zaidi state of Yemen (b. 1503)",
    "November 12 – Henry of Stolberg, German nobleman (b. 1509)",
    "November 23 – Agnolo di Cosimo (Bronzino), Italian artist and poet (b. 1503)",
    "November 24 – John Knox, Scottish religious reformer (b. 1513)[8]",
    "December 2 – Ippolito II d'Este, Italian cardinal and statesman (b. 1509)",
    "December 12 – Loredana Marcello, Venetian dogaressa and botanist",
    "December 22 – François Clouet, French miniaturist (b. c. 1510)",
    "December 23 – Johann Sylvan, Reformed German theologian (executed; date of birth unknown)[9]",
    "date unknown\nAndrzej Frycz Modrzewski, Polish scholar (b. 1503)\nFrancisco de Moraes, Portuguese author and writer (b. 1500)\nYasumi Naomasa, Japanese military commander\nStanisław Zamoyski, Polish nobleman (b. 1519)",
    "Andrzej Frycz Modrzewski, Polish scholar (b. 1503)",
    "Francisco de Moraes, Portuguese author and writer (b. 1500)",
    "Yasumi Naomasa, Japanese military commander",
    "Stanisław Zamoyski, Polish nobleman (b. 1519)",
    "probable – Christopher Tye, English composer and organist (b. 1505)"
  ]
}