{
  "events": [
    "February 23 – The fifth War of Religion against the Huguenots begins in France.",
    "April 14 – Battle of Mookerheyde: Spanish forces under Sancho de Avila defeat the rebel forces of Louis of Nassau, who is killed.[1]",
    "May 30 – On the death of King Charles IX of France of a tubercular condition at the Château de Vincennes, he is succeeded by his brother King Henry of Poland, who becomes King Henry III of France. His mother, Catherine de' Medici, acts as Regent, until Henry arrives from Poland.[2]",
    "June 10 – Manila, Philippines gains cityhood.",
    "August 30 – Guru Ram Das becomes the fourth of the Sikh gurus.",
    "September – A plot to assassinate John III of Sweden is discovered, headed by Charles de Mornay and implicating Charles Dancay, Hogenskild Bielke, Gustaf Banér, Pontus De la Gardie, Princess Elizabeth of Sweden, Princess Cecilia of Sweden, and Duke Charles.[3]",
    "October 3 – The city of Leiden, besieged by the Spanish, is relieved by a Sea Beggars fleet under Louis Boisot.",
    "November 22 – The Juan Fernández Islands in the South Pacific Ocean are discovered by Spanish sailor Juan Fernández.",
    "November 29 – Limahong and Juan de Salcedo quarrel during the Battle of Manila.",
    "December – Murad III succeeds Selim II, as Ottoman Sultan.",
    "Prince El-Mirza of Kakheti is defeated in his bid for the throne by his half-brother, Alexander II.",
    "The Liturgical Battle royal between the Reformation and Counter Reformation begins in Sweden, and continues until the Uppsala Synod of 1593.",
    "La Alameda, Seville, is laid out in Spain, as Europe's first public garden.[4]"
  ],
  "births": [
    "January 17 – Robert Fludd, English Rosicrucian and Paracelsian physicist (d. 1637)",
    "February 17 – Pedro Téllez-Girón, 3rd Duke of Osuna, Spanish nobleman and politician (d. 1624)",
    "March 4 – Carl Gyllenhielm, Swedish soldier and politician (d. 1650)",
    "March 5 – William Oughtred, English mathematician and Anglican minister (d. 1660)[5]",
    "March 7 – John Wilbye, English composer (date of baptism) (d. 1638)",
    "April 27 – Philip Rubens, Flemish lawyer and older brother to painter Peter Paul Rubens (d. 1611)",
    "May 6 – Pope Innocent X (d. 1655)[6]",
    "May 14\nDaniel Dumonstier, French artist (d. 1646)\nFrancesco Rasi, Italian composer, singer, instrumentalist, poet (d. 1621)",
    "Daniel Dumonstier, French artist (d. 1646)",
    "Francesco Rasi, Italian composer, singer, instrumentalist, poet (d. 1621)",
    "June 13 – Juan Alonso de Solis y Mendoza, Spanish Catholic prelate, Bishop of Puerto Rico (1635–1640) (d. 1640)",
    "June 20 – Wilhelm Kettler, Duke of Courland (d. 1640)",
    "June – Richard Barnfield, English poet (d. 1627)",
    "July 1 – Joseph Hall, English bishop and satirist (d. 1656)",
    "July 2 – Dorothea Maria of Anhalt, Duchess consort of Saxe-Weimar (1602–1605) (d. 1617)",
    "July 10 – Clara Maria of Pomerania-Barth, German noble (d. 1623)",
    "July 23 – Balthasar I Moretus, Flemish printer (d. 1641)",
    "August 2 – Sir Richard Beaumont, 1st Baronet, English politician (d. 1631)",
    "August 7 – Robert Dudley, styled Earl of Warwick, English explorer and geographer (d. 1649)",
    "August 28 – Frederick IV, Duke of Brunswick-Lüneburg (1636–1648) (d. 1648)",
    "August 30 – Albert Szenczi Molnár, Hungarian translator (d. 1634)",
    "September 6 – Luis Sotelo, Spanish Franciscan friar who died as a martyr in Japan (d. 1624)",
    "September 18 – Claudio Achillini, Italian philosopher, theologian, mathematician, poet, jurist (d. 1640)",
    "September 29 – Ludovic Stewart, 2nd Duke of Lennox, Scottish nobleman and politician (d. 1624)",
    "September – Thomas Gataker, English clergyman and theologian (d. 1654)",
    "October 25 – François de Sourdis, French Catholic cardinal (d. 1628)",
    "November 4 – Erycius Puteanus, Dutch humanist, philologist (d. 1646)",
    "November 5 – Charlotte de La Marck, French duchess (d. 1594)",
    "November 10 – Archduchess Maria Christina of Austria, Austrian archduchess (d. 1621)",
    "November 30 – Frederick of Solms-Rödelheim, imperial chamberlain, war and Obrist (d. 1649)",
    "December 8 – Maria Anna of Bavaria, Archduchess of Inner Austria (d. 1616)",
    "December 10 – Mikołaj Łęczycki, Polish Jesuit (d. 1653)",
    "December 12\nAdam Wenceslaus, Duke of Cieszyn (d. 1617)\nAnne of Denmark, queen of James VI of Scotland (d. 1619)",
    "Adam Wenceslaus, Duke of Cieszyn (d. 1617)",
    "Anne of Denmark, queen of James VI of Scotland (d. 1619)",
    "December 15 – Samuel Besler, Polish composer (d. 1625)",
    "date unknown\nJohn Day, English dramatist (d. 1640)\nWilhelm Kinsky, Bohemian nobleman (d. 1634)\nClaudio Pari, Sicilian composer\nFeng Menglong, Chinese poet (d. 1645)",
    "John Day, English dramatist (d. 1640)",
    "Wilhelm Kinsky, Bohemian nobleman (d. 1634)",
    "Claudio Pari, Sicilian composer",
    "Feng Menglong, Chinese poet (d. 1645)"
  ],
  "deaths": [
    "January 26 – Martin Helwig, German cartographer of Silesia (b. 1516)",
    "January 30 – Damião de Góis, Portuguese philosopher (b. 1502)",
    "March 4 – Anna II, Princess-Abbess of Quedlinburg, German noblewoman, reigning from 1516 until her death (b. 1504)",
    "March 27 – Takeda Nobutora, Japanese warlord (b. 1494)",
    "April 14 – Louis of Nassau, Dutch general (b. 1538)[1]",
    "April 17 – Joachim Camerarius, German classical scholar (b. 1500)",
    "April 21 – Cosimo I de' Medici, Grand Duke of Tuscany (b. 1519)",
    "April 30 – Joseph Boniface de La Molle, Provençale lover of Marguerite de Valois (b. 1530)",
    "May 14 – Guru Amar Das, third Sikh Guru (b. 1479)",
    "May 3 – Giovanni Ricci, Italian Catholic cardinal (b. 1498)",
    "May 30 – King Charles IX of France (b. 1550)[2]",
    "June 12 – Renée of France, French princess (b. 1510)",
    "June 14 – John III the Terrible, Voivoide of Moldavia (b. 1521)",
    "June 26 – Gabriel, comte de Montgomery, captain of the Scottish Guard of Henry II of France (b. 1530)",
    "June 27 – Giorgio Vasari, Italian painter and architect (b. 1511)[7]",
    "July 26 – Birgitte Gøye, Danish county administrator, lady in waiting, landholder and educator  (b. 1511)",
    "August 23 – Ebussuud Efendi, Ottoman Grand Mufti (b. 1490)",
    "August 27 – Bartolomeo Eustachi, Italian anatomist",
    "September 1 – Louis, Count of Stolberg, German noble (b. 1505)",
    "September 4 – Charles de Mornay, Swedish (originally French) court official, diplomat and royal favorite (b. 1514)",
    "September 15 – Margaret of France, Duchess of Berry (b. 1523)",
    "September 17 – Pedro Menéndez de Avilés, Spanish admiral and explorer (b. 1519)",
    "September 26 – Elisabeth of Anhalt-Zerbst, Abbess of Gernrode and Frose, Countess of Barby-Mühlingen (b. 1545)",
    "September 28 – Guidobaldo II della Rovere, Duke of Urbino, Italian condottiero (b. 1514)",
    "October 1 – Maarten van Heemskerck, Dutch painter (b. 1498)",
    "November 23 – John III, Count of Nassau-Saarbrücken, German noble (b. 1511)",
    "November 28 – Georg Major, German Protestant theologian (b. 1502)",
    "December 4 – Georg Joachim Rheticus, German mathematician and cartographer (b. 1514)",
    "December 12 – Selim II, Ottoman Sultan (b. 1524)[8]",
    "December 26 – Charles, Cardinal of Lorraine (b. 1524)",
    "date unknown\nHans Eworth, Flemish painter (b. 1520)\nMartin de Goiti, Spanish conquistador",
    "Hans Eworth, Flemish painter (b. 1520)",
    "Martin de Goiti, Spanish conquistador"
  ]
}