{
  "events": [
    "June 16 – The deposed and imprisoned Mary, Queen of Scots, recognizes Philip II of Spain as her heir.",
    "July 6 – The Treaty of Berwick is signed between Queen Elizabeth I of England and King James VI of Scotland.[1]",
    "July 21 – English explorer Thomas Cavendish begins the first deliberately planned circumnavigation of the globe.[2]",
    "September 20–21 – Execution of the Babington Plotters: The 14 men convicted of a plot (uncovered on July 17) to murder Queen Elizabeth and replace her with Mary, Queen of Scots, are hanged, drawn and quartered (the first seven being disembowelled before death) in St Giles Field, London.[3][page needed]",
    "September 22 – Battle of Zutphen: Spanish troops defeat the Dutch rebels and their English allies. English poet and courtier Sir Philip Sidney is mortally wounded.[4]",
    "October 15–25 – Mary, Queen of Scots, is placed on treason trial at Fotheringhay Castle in England for complicity in the Babington Plot and sentenced to death.[1]",
    "November 19 – English Separatist Puritan Henry Barrowe is imprisoned.",
    "December 17 – The reign of Emperor Ōgimachi of Japan ends, and Emperor Go-Yōzei ascends to the throne.",
    "Flemish mathematician Simon Stevin publishes a study showing that two objects of different weight fall with the same speed.",
    "St. Augustine, Florida, and Santo Domingo (modern day Dominican Republic) are plundered and burned by English sea captain Sir Francis Drake.",
    "Jacobus Gallus composes his motet O magnum mysterium.",
    "English topographer William Harrison becomes canon of Windsor.",
    "António da Madalena from Portugal is the first westerner to visit Angkor Wat.",
    "English ship Vanguard, the first Royal Navy vessel to bear this name, is launched at Woolwich.",
    "The cities of Voronezh, Samara, and Tyumen in Russia are founded."
  ],
  "births": [
    "January 1 – Pau Claris i Casademunt, Catalan ecclesiastic (d. 1641)",
    "January 20 – Johann Hermann Schein, German composer of the early Baroque era (d. 1630)[5]",
    "January 29 – Louis Frederick, Duke of Württemberg-Montbéliard (1617–1631) (d. 1631)",
    "February 8 – Jacob Praetorius, German Baroque composer and organist (d. 1651)",
    "February 15 – Jacques de Bela, French writer (d. 1667)",
    "February 20 – Hachisuka Yoshishige, Japanese daimyō of the Edo period (d. 1620)",
    "February 24 – Matthias Faber, German Jesuit priest, writer (d. 1653)",
    "February 26 – Niccolò Cabeo, Italian Jesuit writer, theologian (d. 1657)",
    "March 12 – Jean Dolbeau, French missionary (d. 1652)",
    "March 28 – Domenico Massenzio, Italian baroque composer (d. 1657)",
    "March 29 – Ludwig Crocius, German Calvinist minister (d. 1653)",
    "April 2 – Pietro Della Valle, Italian composer (d. 1652)",
    "April 4 – Richard Saltonstall, English diplomat (d. 1661)",
    "April 5 – Christopher Levett, English explorer (d. 1630)",
    "April 9 – Julius Henry, Duke of Saxe-Lauenburg (d. 1665)",
    "April 17 – John Ford, English dramatist and poet (d. 1640)",
    "April 20 – Saint Rose of Lima, Spanish colonist in Lima (d. 1617)",
    "April 23 – Martin Rinkart, German clergyman and hymnist (d. 1649)",
    "April 24 – Henry Hastings, 5th Earl of Huntingdon, English noble (d. 1643)",
    "May 2 – Étienne de Courcelles, French scholar (d. 1659)",
    "May 7 – Francesco IV Gonzaga, Duke of Mantua and Montferrat (d. 1612)",
    "May 9 – Tsugaru Nobuhira, Japanese daimyō (d. 1631)",
    "May 11 – Angelo Giori, Italian Catholic cardinal (d. 1662)",
    "May 23 – Paul Siefert, German composer and organist (d. 1666)",
    "June 24 – George John II, Count Palatine of Lützelstein-Guttenberg, German noble (d. 1654)",
    "July 1 – Claudio Saracini, Italian composer (d. 1630)",
    "July 5 – Thomas Hooker, prominent Puritan colonial leader (d. 1647)",
    "July 6 – Thomas Trevor, English politician and judge (d. 1656)",
    "July 7 – Thomas Howard, 21st Earl of Arundel, English courtier (d. 1646)",
    "July 26 – Diego de Colmenares, Spanish historian (d. 1651)",
    "August 14 – William Hutchinson, founder of Rhode Island (d. 1642)",
    "August 17 – Johann Valentin Andrea, German theologian (d. 1654)",
    "September 15 – Antoon Sanders, Dutch priest, historian (d. 1664)",
    "September 29 – William Lytton, English Member of Parliament (d. 1660)",
    "October 7 – Isaac Massa, Dutch diplomat (d. 1643)",
    "October 9 – Leopold V, Archduke of Austria, regent of Tyrol (d. 1632)[6]",
    "October 20 – Luke Foxe, English explorer (d. 1635)",
    "October 28 – Francis West, Deputy Governor of the Colony and Dominion of Virginia (d. 1634)",
    "November 20 – Polykarp Leyser II, German theologian (d. 1633)",
    "November 22 – Walter Erle, English politician (d. 1665)",
    "November 23 – Juan Bautista de Lezana, Spanish theologian (d. 1659)",
    "November 27 – Sir John Wray, 2nd Baronet, English politician (d. 1655)",
    "November 28 – Sir Thomas Bowyer, 1st Baronet, English politician (d. 1650)",
    "December 6 – Niccolò Zucchi, Italian astronomer and physicist (d. 1670)",
    "December 14 – Georg Calixtus, German Lutheran theologian who looked to reconcile all Christendom (d. 1656)",
    "December 31 – Duchess Magdalene Sibylle of Prussia, Electress of Saxony (d. 1659)",
    "date unknown – John Mason, English explorer (d. 1635)",
    "date unknown – Kocc Barma Fall, Senegambian philosopher (d. 1655)[7][8]",
    "probable\nGiles Fletcher, English poet (d. 1623)\nDavid HaLevi Segal, Polish Jewish rabbi (d. 1667)",
    "Giles Fletcher, English poet (d. 1623)",
    "David HaLevi Segal, Polish Jewish rabbi (d. 1667)"
  ],
  "deaths": [
    "January 18 – Margaret of Austria, regent of the Netherlands (b. 1522)",
    "January 25 – Lucas Cranach the Younger, German painter (b. 1515)",
    "February 11 – Augustus, Elector of Saxony (b. 1526)",
    "March 1 – Amalia of Cleves, German princess and writer (b. 1517)",
    "March 25 – Margaret Clitherow, English Roman Catholic nun, saint and martyr (b. 1556)",
    "March 30 – Anna of Veldenz, Margrave of Baden (b. 1540)",
    "April 8 – Martin Chemnitz, Lutheran reformer (b. 1522)",
    "May 5 – Henry Sidney, Lord Deputy of Ireland (b. 1529)[9]",
    "May 7 – George II of Brieg, Duke of Brieg (1547–1586) (b. 1523)",
    "May 9 – Luis de Morales, Spanish religious painter (b. 1510)",
    "May 29 – Adam Lonicer, German botanist (b. 1528)",
    "June 1 – Martín de Azpilcueta, Spanish theologian and economist (b. 1491)",
    "June 5 – Matthew Wesenbeck, Belgian jurist (b. 1531)",
    "June 9 – Filippo Boncompagni, Italian Catholic cardinal (b. 1548)",
    "June 28 – Primož Trubar, Carniolan Protestant reformer (b. 1508)",
    "July 5 – Ludwig Lavater, Swiss Reformed theologian (b. 1527)",
    "July 12 – Edward Sutton, 4th Baron Dudley (b. 1525)",
    "August 1 – Richard Maitland, Scottish statesman and historian (b. 1496)",
    "September 7 – Prince Masahito, member of the Japanese imperial family (b. 1552)",
    "September 18 – Ottavio Farnese, Duke of Parma (b. 1521)",
    "September 20\nSir Anthony Babington, English Catholic conspirator (executed) (b. 1561)\nChidiock Tichborne, English conspirator and poet (executed) (b. 1558)",
    "Sir Anthony Babington, English Catholic conspirator (executed) (b. 1561)",
    "Chidiock Tichborne, English conspirator and poet (executed) (b. 1558)",
    "September 21 – Antoine Perrenot de Granvelle, French Roman Catholic cardinal (b. 1517)",
    "October 1 – Adolf, Duke of Holstein-Gottorp (b. 1526)",
    "October 15 – Elizabeth of Denmark, Duchess of Mecklenburg, Danish princess (b. 1524)",
    "October 17 – Philip Sidney, English poet, courtier and soldier (b. 1554)[10]",
    "October 28 – John Günther I, Count of Schwarzburg-Sondershausen (b. 1532)",
    "November 6 – Willem IV van den Bergh, Stadtholder of Guelders and Zutphen (b. 1537)",
    "December 6 – Joachim Ernest, Prince of Anhalt (b. 1536)",
    "December 12 – Stefan Batory, King of Poland (b. 1533)[11]",
    "December 30 – Luigi d'Este, Italian Catholic cardinal (b. 1538"
  ]
}