{
  "events": [
    "March 13 – Battle of Tondibi: In Mali, forces sent by the Saadi Dynasty ruler of Morocco, Ahmad al-Mansur, and led by Judar Pasha, defeat the fractured Songhai Empire, despite being outnumbered by at least five to one.[1]",
    "April 10 – English merchant James Lancaster sets off on a voyage to the East Indies.[2]",
    "April 21 – Japanese tea-master Sen no Rikyū commits seppuku, on the order of Toyotomi Hideyoshi.",
    "May 15 – In Russia, Tsarevich Dimitri, son of Ivan the Terrible, is found dead in mysterious circumstances, at the palace in Uglich. The official explanation is that he has cut his own throat during an epileptic seizure. Many believe he has been murdered by his rival, Boris Godunov, who becomes tsar.",
    "May 24 – Sir John Norreys, with an expeditionary force sent by Queen Elizabeth I of England, takes the town of Guingamp after a brief siege, on behalf of Henry of Navarre.",
    "May 30 – Timbuktu is captured by an expedition of Arma people, sent by the Saadi ruler of Morocco, and led by Judar Pasha.",
    "May 30 – Zutphen is captured by the Dutch and English, under Maurice of Nassau.",
    "June 10 – Deventer is captured by the Dutch, under Maurice of Nassau.",
    "July – Battle of Bhuchar Mori in Gujarat: the Mughal Empire gains a decisive victory over the Nawanagar State.",
    "July 22 – The Durtnell (Dartnell) family of Brasted, Kent, England, begin to work as building contractors. The business continues under thirteen generations of the family until ceasing to trade in 2019.[3]",
    "July 25 – Siege of Knodsenburg: Maurice of Nassau and Francis Vere defeat the Duke of Parma outside Nijmegen.",
    "August – Robert Devereux, Earl of Essex leads an English army in support of the Protestant Henry IV of France at the Siege of Rouen.[2]",
    "August–September – During this year's Atlantic hurricane season, probably the most severe of the pre-1600 seasons, at least eight intense hurricanes occur.",
    "August 30–September 1 – Battle of Flores off Flores Island (Azores): the Spanish fleet is victorious over the English; English ship Revenge is captured on September 1 (and Richard Grenville fatally wounded) but soon afterwards lost with all hands in a week-long storm, along with a large number of the Spanish ships.",
    "September 14 – Siege of Hulst: Hulst is captured by Maurice.",
    "October 8 – The Separation Edict, a law preventing social mobility in Japan, is promulgated by Toyotomi Hideyoshi.",
    "October 21 – Siege of Nijmegen: Nijmegen is captured by Maurice.",
    "October 26 – The Portuguese invasion of Jaffna Kingdom begins.",
    "October 29 – Pope Innocent IX succeeds Pope Gregory XIV, becoming the 230th pope.[4]",
    "The city of Hyderabad, India is founded by Muhammad Quli Qutb Shah.[5]",
    "The Rialto Bridge in Venice, designed by Antonio da Ponte, is completed.",
    "The first of the Conimbricenses commentaries on Aristotle, by the Jesuits of the University of Coimbra, is published. [6]",
    "The Siamese-Cambodian War begins.",
    "The defeated Askia Dynasty move to the Dendi province in modern-day Niger."
  ],
  "births": [
    "January 3 – Valentin de Boulogne, French painter (d. 1632)",
    "January 4 – William Spencer, 2nd Baron Spencer of Wormleighton, British baron (d. 1636)",
    "January 7 – Princess Dorothea, Abbess of Quedlinburg (d. 1617)",
    "January 11 – Robert Devereux, 3rd Earl of Essex, English Civil War general (d. 1646)",
    "January 12 – Jusepe de Ribera, Spanish Tenebrist painter and printmaker (d. 1652)",
    "January 15 – David van Goorle, Dutch theologian and theoretical scientist (d. 1612)",
    "January 26 – Matthew Boynton, English politician (d. 1647)",
    "January 29 – Franciscus Junius, pioneer of Germanic philology (d. 1677)",
    "February 8\nHervey Bagot, English politician (d. 1660)\nGuercino, Italian painter (d. 1666)",
    "Hervey Bagot, English politician (d. 1660)",
    "Guercino, Italian painter (d. 1666)",
    "February 13 – Antonio Sabino, Italian composer (d. 1650)",
    "February 21 (or March 2) – Girard Desargues, French mathematician (d. 1661)",
    "February 25 – Friedrich von Spee, German Jesuit and poet (d. 1635)",
    "February 28 – Henry Clifford, 5th Earl of Cumberland, English politician (d. 1643)",
    "March 2 – Willem Boreel, Dutch diplomat (d. 1668)",
    "March 3 – Lucas de Wael, Flemish painter (d. 1661)",
    "March 6 – Tommaso Tamburini, Italian theologian (d. 1675)",
    "March 9 – Johannes Chrysostomus vander Sterre, Dutch abbot, ecclesiastical writer (d. 1652)",
    "March 11 – Isabella of Savoy, Italian noble (d. 1626)",
    "March 15 or 1593 – Alexandre de Rhodes, French Jesuit missionary (d. 1660)",
    "March 19 – Dirck Hals, Dutch painter (d. 1656)",
    "March 28 – William Cecil, 2nd Earl of Salisbury, English earl (d. 1668)",
    "April 5 – Prince Frederick Ulrich, Duke of Brunswick-Lüneburg (d. 1634)",
    "April 11 – Bartholomeus Strobel, Silezian painter (d. 1650)",
    "April 25 – Marcos de Torres y Rueda, interim viceroy of New Spain (d. 1649)",
    "May 2 – Prince Francis Charles of Saxe-Lauenburg (d. 1660)",
    "May 5 – Frederick Achilles, Duke of Württemberg-Neuenstadt (d. 1631)",
    "May 26 – Olimpia Maidalchini, Italian noblewoman (d. 1657)",
    "June 16 – Joseph Solomon Delmedigo, Italian physician, mathematician, and music theorist (d. 1655)",
    "June 24 – Mustafa I, sultan of the Ottoman empire (d. 1639)",
    "July 4 – Jonathan Rashleigh, English politician (d. 1675)",
    "July 9 – Jean Bagot, French theologian (d. 1664)",
    "July 20 – Anne Hutchinson, English Puritan preacher (d. 1643)",
    "August 6 – George William, Count Palatine of Zweibrücken-Birkenfeld (d. 1669)",
    "August 12 – Louise de Marillac, French co-founder of the Daughters of Charity (d. 1660)",
    "August 24 – Robert Herrick, English poet (d. 1674)[7]",
    "August 28 – John Christian of Brieg, Duke of Brzeg (1602–1639) (d. 1639)",
    "September 8 – Marie Angélique Arnauld, French abbess of the Abbey of Port-Royal (d. 1661)",
    "September 29 – Michael de Sanctis, Spanish saint (d. 1625)",
    "October 2 – Margherita Gonzaga, Duchess of Lorraine (1608–1624) (d. 1632)",
    "October 7 – Pierre Le Muet, French architect (d. 1669)",
    "October 22 – Alfonso III d'Este, Duke of Modena, Italian noble (d. 1644)",
    "November 20 – George Albert II, Margrave of Brandenburg (d. 1615)",
    "November 29 – Bernhard von Mallinckrodt, German bibliophile (d. 1664)",
    "December 22 – Tommaso Dingli, Maltese architect and sculptor (d. 1666)",
    "December 30 – Joseph Furttenbach, German architect (d. 1667)",
    "David Blondel, French Protestant clergyman (d. 1655)",
    "Andrew Bobola, Polish Jesuit missionary and martyr (d. 1657)",
    "Thomas Goffe, English dramatist (d. 1629)",
    "William Lenthall, English politician of the Civil War period (d. 1662)"
  ],
  "deaths": [
    "February 6 – Anna Sophia of Prussia, Duchess of Prussia and Duchess of Mecklenburg (b. 1527)",
    "February 26 – Vespasiano I Gonzaga, Italian noble and diplomat (b. 1531)",
    "March 17 – Jost Amman, Swiss printmaker (b. 1539)",
    "April 9 – Emilie of Saxony, German noble (b. 1516)",
    "April 21 – Sen no Rikyū, Japanese exponent of the tea ceremony (b. 1522)",
    "May 19 – Elizabeth Cecil, 16th Baroness de Ros, English noblewoman (b. c. 1574)",
    "May 15 – Tsarevich Dimitri, of Russia (b. 1582)",
    "June 21 – Aloysius Gonzaga, Italian Jesuit and saint (b. 1568)",
    "July 2 – Vincenzo Galilei, Italian composer (b. 1520)",
    "July 10 – Anna of Hesse, Countess Palatine of Zweibrücken (b. 1529)",
    "July 18 – Jacobus Gallus Carniolus, Slovenian composer (b. 1550)",
    "August 23 – Luis Ponce de León, Spanish lyric poet (b. 1527)",
    "August 27 – Katheryn of Berain, Welsh noblewoman (b. 1534)[8]",
    "September 7 – Heinrich Sudermann, German politician (b. 1520)",
    "September 10 – Richard Grenville, English soldier and explorer (b. 1542)",
    "September 19 – Alonso de Orozco Mena, Spanish Catholic priest (b. 1500)",
    "September 25 – Christian I, Elector of Saxony (b. 1560)",
    "September 29 – Count Johan II of East Frisia (b. 1538)",
    "October 15 – Duke Otto Henry of Brunswick-Harburg, Hereditary Prince of Brunswick-Lüneburg-Harburg (b. 1555)",
    "October 16 – Pope Gregory XIV (b. 1535)[9]",
    "November 20 – Christopher Hatton, English politician (b. 1540)",
    "December 14 – Saint John of the Cross, Spanish Carmelite friar and poet (b. 1542)",
    "December 18 – Marigje Arriens, Dutch woman executed for witchcraft (b. c. 1520)",
    "December 30 – Pope Innocent IX (b. 1519)[10]",
    "Ananias Dare, father of Virginia Dare, (b. circa 1560)",
    "Virginia Dare, first English child born in America, (b. 1587) (Unverified)",
    "Crispin van den Broeck, Flemish painter (b. 1523)",
    "John Erskine of Dun, Scottish religious reformer (b. 1509)",
    "Toyotomi Hidenaga, Japanese nobleman (b. 1540)",
    "John Stubbs, English pamphleteer (b. 1543)",
    "Veronica Franco, Italian poet and courtesan (b. 1546)"
  ]
}