{
  "events": [
    "January 24 – Battle of Turnhout: Maurice of Nassau defeats a Spanish force under Jean de Rie of Varas, in the Netherlands.[1]",
    "February – Bali is discovered, by Dutch explorer Cornelis Houtman.",
    "February 5 – In Nagasaki, Japan, 26 people are martyred by crucifixion. They practiced Catholicism, and were taken captive after all forms of Christianity were outlawed the previous year.",
    "February 8 – Sir Anthony Shirley, England's \"best-educated pirate\", raids Jamaica.",
    "February 24 – The last battle of the Cudgel War was fought on the Santavuori Hill in Ilmajoki, Ostrobothnia.[2]",
    "March 11 – Amiens is taken by Spanish forces.",
    "After April 10 – The Serb uprising of 1596–97 ends in defeat for the rebels, at the field of Gacko (Gatačko Polje).",
    "April 23 – Probable first performance of William Shakespeare's The Merry Wives of Windsor.",
    "April 27 – Johannes Kepler marries Barbara Muhleck.[3]",
    "c. July – Thomas Nashe and Ben Jonson's satirical play The Isle of Dogs is performed at the Swan Theatre in London; it is immediately suppressed by the authorities and no copy survives.",
    "July 14 – Scottish poet Alexander Montgomerie is declared an outlaw, after the collapse of a Catholic plot.",
    "August 13 – The Siege of Namwon begins in Korea.",
    "August 14 – First Dutch Expedition to Indonesia: A Dutch expedition commanded by Cornelis de Houtman returns to Amsterdam, after having successfully reached Java. This achievement opens the Spice trade, which had until then been monopolised by the Portuguese, to the Dutch, who in the next years launch several more expeditions to the Indies.",
    "August 17 – Islands Voyage: Robert Devereux, 2nd Earl of Essex, and Sir Walter Raleigh set sail on an expedition to the Azores.",
    "August 19 – Rheinberg capitulates to forces led by Maurice of Naussau.",
    "August 24 – Christian IV of Denmark-Norway refuses to let Tycho Brahe return to Denmark.",
    "August 28 – Imjin War: Battle of Chilcheollyang – The Japanese fleet defeats the Koreans, in their only naval victory of the war.[4]",
    "September 25 – Amiens is retaken from the Spanish by Anglo-French forces, led by Henry IV of France, after a four-month siege.",
    "October – John Gerard, a Jesuit priest, escapes from the Tower of London.",
    "October/November – The 3rd Spanish Armada is dispersed by a storm; a number of Spanish ships are captured off the coasts of Wales, Cornwall and Devon.",
    "October 26 – Battle of Myeongnyang: The Koreans, commanded by Yi Sunsin, are victorious over a Japanese invasion fleet.",
    "November 12 – Lingen capitulates to forces led by Maurice of Nassau.",
    "Abbas I ends the Uzbek raids on his lands.",
    "Yaqob succeeds his father Sarsa Dengel, as Emperor of Ethiopia at the age of 7.",
    "Jacopo Peri writes Dafne, now recognised as the first opera.",
    "The first edition of Francis Bacon's Essays is published.[5]",
    "Andreas Libavius publishes Alchemia, a pioneering chemistry textbook.[6]",
    "12 million pesos of silver cross the Pacific. Although it is unknown just how much silver flowed from the Spanish base of Manila in the Philippines to the Ming Dynasty of China, it is known that the main port for the Mexican silver trade—Acapulco—shipped out 150,000 to 345,000 kg (4 to 9 million taels) of silver annually from this year to 1602.",
    "Tobias Hess corresponds with Simon Studion and agrees with him that the Papacy must fall in 1604."
  ],
  "births": [
    "January 12 – François Duquesnoy, Flemish Baroque sculptor in Rome (d. 1643)",
    "January 25 – Johann Philipp, Duke of Saxe-Altenburg, German Duke (d. 1639)",
    "January 31 – John Francis Regis, French Jesuit priest (d. 1640)",
    "February 24 – Vincent Voiture, French poet (d. 1648)[7]",
    "March 1 – Jean-Charles de la Faille, Belgian mathematician (d. 1652)",
    "March 10 – Ercole Gennari, Italian drawer and painter (d. 1658)",
    "March 18 – Jérôme le Royer de la Dauversière, French nobleman, founder of Montreal and an order of nursing Sisters (d. 1659)",
    "March 21 – Juan Alonso y Ocón, Spanish Catholic prelate, Archbishop of La Plata o Charcas (d. 1656)",
    "March 27 – William Hyde, President of English College, Douai (d. 1651)",
    "April 9 – John Davenport, English Puritan clergyman, co-founder of the American colony of New Haven (d. 1670)",
    "April 13 – Giovanni Battista Hodierna, Italian astronomer (d. 1660)",
    "April 23 – Alvise Contarini, Italian diplomat, nobleman (d. 1651)",
    "May 13 – Cornelis Schut, Flemish painter, draughtsman and engraver (d. 1655)",
    "May 15 – Squire Bence, English politician (d. 1648)",
    "May 25 – Veit Erbermann, German theologian (d. 1675)",
    "May 31 – Jean-Louis Guez de Balzac, French author (d. 1654)",
    "June 9 – Pieter Jansz. Saenredam, Dutch painter (d. 1665)",
    "July 2 – Theodoor Rombouts, Flemish painter (d. 1637)",
    "July 13 – Sebastian Stoskopff, French painter (d. 1657)",
    "July 22 – Virgilio Mazzocchi, Italian Baroque composer (d. 1646)",
    "July 29 – Abdias Treu, German mathematician and academic (d. 1669)",
    "August 20\nGirolamo Grimaldi-Cavalleroni, Italian Catholic cardinal (d. 1685)\nJózef Bartłomiej Zimorowic, Polish poet (d. 1677)",
    "Girolamo Grimaldi-Cavalleroni, Italian Catholic cardinal (d. 1685)",
    "Józef Bartłomiej Zimorowic, Polish poet (d. 1677)",
    "August 21 – Roger Twysden, English antiquarian and royalist (d. 1672)",
    "August 29 – Henry Gage, Royalist officer in the English Civil War (d. 1645)",
    "September 23 – Francesco Barberini, Italian Catholic cardinal (d. 1679)",
    "September 28 – Justus Sustermans, Flemish painter  (d. 1681)",
    "October 7 – Captain John Underhill, English settler and soldier (d. 1672)",
    "October 13 – Otto Louis of Salm-Kyrburg-Mörchingen, Swedish general in the Thirty Years' War (d. 1634)",
    "October 20 – Matthew Hutton, English politician (d. 1666)",
    "November 15 – Juan Tellez-Girón y Enriquez de Ribera, 4th Duke of Osuna (d. 1656)",
    "November 19 – Elizabeth Charlotte of the Palatinate, wife of George William (d. 1660)",
    "December 16\nGeorge Albert I, Count of Erbach-Schönberg (d. 1647)\nPieter de Neyn, Dutch painter (d. 1639)",
    "George Albert I, Count of Erbach-Schönberg (d. 1647)",
    "Pieter de Neyn, Dutch painter (d. 1639)",
    "December 22 – Frederick III, Duke of Holstein-Gottorp (d. 1659)",
    "December 23\nMartin Opitz, German poet (d. 1639)",
    "Martin Opitz, German poet (d. 1639)",
    "December 24 – Honoré II, Prince of Monaco (d. 1662)",
    "Cristóbal Diatristán de Acuña, Spanish missionary and explorer (d. 1676)",
    "Johan van Heemskerk, Dutch poet (d. 1656)",
    "Cornelis Jol, Dutch naval commander and privateer (d. 1641)",
    "Wang Wei, Chinese poet (d. 1647)"
  ],
  "deaths": [
    "January 29\nMaharana Pratap, Indian statesman (b. 1540)\nElias Ammerbach, German organist (b. 1530)",
    "Maharana Pratap, Indian statesman (b. 1540)",
    "Elias Ammerbach, German organist (b. 1530)",
    "February 2 – James Burbage, English actor",
    "February 5\nFrancisco Blanco, Spanish Franciscan and Roman Catholic priest, missionary, martyr and saint (b. 1570)\nGonsalo Garcia, Portuguese Franciscan and Roman Catholic priest, missionary, martyr and saint (b. 1557)\nPaulo Miki, Japanese Roman Catholic priest, martyr and saint (b. c.1562)\nPhilip of Jesus, Mexican Roman Catholic priest, missionary, martyr and saint (b. 1572)\n26 Martyrs of Japan",
    "Francisco Blanco, Spanish Franciscan and Roman Catholic priest, missionary, martyr and saint (b. 1570)",
    "Gonsalo Garcia, Portuguese Franciscan and Roman Catholic priest, missionary, martyr and saint (b. 1557)",
    "Paulo Miki, Japanese Roman Catholic priest, martyr and saint (b. c.1562)",
    "Philip of Jesus, Mexican Roman Catholic priest, missionary, martyr and saint (b. 1572)",
    "26 Martyrs of Japan",
    "February 6 – Franciscus Patricius, Italian philosopher and scientist (b. 1529)",
    "February 16 – Gilbert Génébrard, French Roman Catholic archbishop (b. 1535)",
    "March 6 – William Brooke, 10th Baron Cobham, English noble and politician (b. 1527)",
    "April 2 – Blas Valera, Peruvian historian (b. 1545)",
    "April 16 – Caspar Cruciger the Younger, German theologian (b. 1525)",
    "June 6 – William Hunnis, English poet",
    "June 8 – Barbara of Hesse (b. 1536)",
    "June 9 – José de Anchieta, Spanish Jesuit missionary (b. 1534)",
    "June 18 – Markus Fugger, German businessman (b. 1529)",
    "June 20 – Willem Barents, Dutch navigator and explorer (b. c. 1550)[8]",
    "July 8 – Luís Fróis, Portuguese Jesuit missionary (b. 1532)",
    "July 19 – Gunilla Bielke, Queen of Sweden (b. 1568)",
    "July 20 – Franciscus Raphelengius, Dutch printer (b. 1539)",
    "July 22 – Gabriele Paleotti, Italian Roman Catholic cardinal (b. 1522)",
    "August 27\nWon Gyun, Korean general and admiral during the Joseon Dynasty (b. 1540)\nYi Eokgi, Korean admiral during the Joseon Dynasty (b. 1561)",
    "Won Gyun, Korean general and admiral during the Joseon Dynasty (b. 1540)",
    "Yi Eokgi, Korean admiral during the Joseon Dynasty (b. 1561)",
    "September 3 – Jakobea of Baden, Margravine of Baden by birth, Duchess of Jülich-Cleves-Berg (b. 1558)",
    "September 20 – Archduchess Gregoria Maximiliana of Austria, Austrian archduchess (b. 1581)",
    "September 30 – William I, Count of Schwarzburg-Frankenhausen (b. 1534)",
    "October 4 – Sarsa Dengel, Emperor of Ethiopia (b. 1550)[9]",
    "October 19 – Ashikaga Yoshiaki, Japanese shōgun (b. 1537)",
    "October 23 – Cyriakus Schneegass, German hymnwriter (b. 1546)",
    "October 27 – Alfonso II d'Este, Duke of Ferrara, Italian noble (b. 1533)",
    "November 1 – Edward Kelley, English spirit medium (b. 1555)",
    "November 11 – Gustav of Saxe-Lauenburg, German noble (b. 1570)",
    "November 6 – Infanta Catherine Michelle of Spain (b. 1567)",
    "December 17 – Frederick, Count Palatine of Zweibrücken-Vohenstrauss-Parkstein (b. 1557)",
    "December 21 – Petrus Canisius, Dutch Jesuit priest and saint (b. 1521)[10]",
    "date unknown - Margaretha Coppier, Dutch heroine  (b. 1516)"
  ]
}