{
  "events": [
    "February 21 – Boris Godunov seizes the throne of Russia, following the death of his brother-in-law, Tsar Feodor I; the Time of Happiness starts.",
    "April 13 – Edict of Nantes (promulgated April 30): Henry IV of France grants French Huguenots equal rights with  Catholics; this is considered the end of the French Wars of Religion.[1]",
    "May – Tycho Brahe's star catalogue Astronomiæ instauratæ mechanica, listing the positions of 1,004 stars, is published.",
    "May 2 – The Peace of Vervins ends the war between France and Spain.",
    "July – Philosopher Tommaso Campanella moves from Naples to Calabria, where he would be involved in a revolt against the rule of the Spanish viceroy the following year.[2]",
    "August 14 – Battle of the Yellow Ford in Ireland: Hugh O'Neill, Earl of Tyrone, gains victory over an English expeditionary force under Henry Bagenal, in the Nine Years' War against English rule.",
    "September 13 – Philip III of Spain starts to rule, on the death of his father.",
    "September 25 – Battle of Stångebro at Linköping in Sweden: The Catholic King Sigismund of Sweden and Poland is defeated in his attempt to resume control of Sweden by the Protestant forces of his uncle, Charles. Sigismund is deposed shortly thereafter.[3]",
    "Autumn – Second Dutch Expedition to Indonesia: After being separated from the main Dutch fleet of Admiral Wybrand Van Warwyck, three ships under Jacob Corneliszoon van Neck land on the island which they name Mauritius, after Maurice, Prince of Orange, and sight the dodo.",
    "December 16 (November 19 (lunar calendar)) – Battle of Noryang: An allied Korean and Chinese fleet under Korean Admiral Yi Sun-sin and Chinese Admiral Chen Lin defeats the Japanese navy, ending the Japanese invasions of Korea (1592–98).[4]",
    "December 21 – Battle of Curalaba: The revolting Mapuche, led by cacique Pelantaro, inflict a major defeat on Spanish troops in southern Chile; all Spanish cities south of the Bío Bío River eventually fall victim to the Destruction of the Seven Cities by the Mapuches, and all conquest of Mapuche territories by Europeans practically ceases, until the later 19th century Occupation of Araucanía.",
    "Carnival – Jacopo Peri's Dafne, the earliest known modern opera, is premièred at the Palazzo Corsini, Florence.[5]",
    "Pentecost – Calvinist congregations in Zürich introduce music into their services.[6]",
    "The Parliament of England passes the Vagabonds Act, that allows transportation of convicts to colonies.",
    "Illustrations of Ottoman Turkish and European riflemen, with detailed illustrations of their firearms, appear in Zhao Shizhen's book Shenqipu in this year, during the Ming Dynasty of China.",
    "The Spanish establish themselves in El Piñal, a trading port on the coast of China in the Pearl River Delta.[7]",
    "New Mexico is founded as the Kingdom of Nuevo México as part of the Viceroyalty of New Spain. The Kingdom eventually became a territory of Mexico, later the New Mexico Territory in the United States, and then the U.S. State of New Mexico."
  ],
  "births": [
    "January 23 – François Mansart, French architect (d. 1666)",
    "March 12 – Guillaume Colletet, French writer (d. 1659)",
    "March 13 – Johannes Loccenius, German historian (d. 1677)",
    "March 15 – Redemptus of the Cross, Portuguese Carmelite lay brother and martyr (d. 1638)",
    "March 25\nRalph Corbie, Irish Jesuit (d. 1644)\nRobert Trelawney, English politician (d. 1643)",
    "Ralph Corbie, Irish Jesuit (d. 1644)",
    "Robert Trelawney, English politician (d. 1643)",
    "March 26 – Sir William Lewis, 1st Baronet, English politician (d. 1677)",
    "April 9 – Johann Crüger, German composer of well-known hymns (d. 1662)",
    "April 11 – William, Duke of Saxe-Weimar, German nobleman (d. 1662)",
    "April 17 – Giovanni Battista Riccioli, Italian astronomer (d. 1671)",
    "April 23 – Maarten Tromp, officer and later admiral in the Dutch navy (d. 1653)",
    "April 28 – Francis Leigh, 1st Earl of Chichester, English politician (d. 1653)",
    "May 23 – Claude Mellan, French painter and engraver (d. 1688)",
    "June 4 – Åke Henriksson Tott, Swedish soldier and politician (d. 1640)",
    "June 19 – Gilbert Sheldon, Archbishop of Canterbury from 1663 until his death (d. 1677)",
    "July 6 – Kirsten Munk, Danish noble, spouse of King Christian IV of Denmark (d. 1658)",
    "July 29 – Henricus Regius, Dutch philosopher (d. 1679)",
    "July 31 – Alessandro Algardi, Italian high-Baroque sculptor active in Rome (d. 1654)",
    "August 7 – Georg Stiernhielm, Swedish civil servant (d. 1672)",
    "September 11 – Imre Thurzó, Hungarian noble (d. 1621)",
    "September 23 – Eleonora Gonzaga, Holy Roman Empress, married to Ferdinand II, Holy Roman Emperor (d. 1655)",
    "September 24 – Giovanni Francesco Busenello, Italian librettist (d. 1659)",
    "September 27 – Robert Blake, English admiral (d. 1657)",
    "October 14 – Nicolas de Neufville de Villeroy, Marshal of France (d. 1685)",
    "October 17 – Jørgen Knudsen Urne, Danish noble (d. 1642)",
    "October 19 – Isaac Commelin, Dutch historian (d. 1676)",
    "October 27 – Lars Stigzelius, Swedish Lutheran archbishop (d. 1676)",
    "November 3 – Christian I, Count Palatine of Birkenfeld-Bischweiler (1600–1654) (d. 1654)",
    "November 4 – Ernst Adalbert von Harrach, Austrian Catholic cardinal (d. 1667)",
    "November 7 – Francisco de Zurbarán, Spanish painter (d. 1664)",
    "November 28 – Hans Nansen, Danish statesman (d. 1667)",
    "December 7 – Gian Lorenzo Bernini, Italian sculptor (d. 1680)[8]",
    "December 20 – Ottavio Farnese, Italian noble (d. 1643)",
    "December 22 – Henri de La Trémoille, French general and noble (d. 1674)",
    "December 24 – Margaret Stuart, Scottish princess (d. 1600)",
    "Bonaventura Cavalieri, Italian mathematician (d. 1647)",
    "Marmaduke Langdale, Royalist in the English Civil War (d. 1661)",
    "Baldassarre Longhena, Venetian architect (d. 1682)[9]",
    "Jean Nicolet, French explorer (d. 1642)",
    "William Strode, English parliamentarian (d. 1645)[10]",
    "Guðríður Símonardóttir, Icelandic woman known as a victim of the Turkish abductions (d. 1682)",
    "probable\nJean-Armand du Peyrer, Comte de Tréville and French officer (d. 1672)\nMary Bankes, Royalist in the English Civil War, defender of Corfe Castle (d. 1661)",
    "Jean-Armand du Peyrer, Comte de Tréville and French officer (d. 1672)",
    "Mary Bankes, Royalist in the English Civil War, defender of Corfe Castle (d. 1661)"
  ],
  "deaths": [
    "January 8 – John George, Elector of Brandenburg, Margrave and Elector of Brandenburg and Duke of Prussia (b. 1525)",
    "January 9 – Jasper Heywood, English Jesuit classicist and translator (b. 1553)",
    "January 16 – Tsar Feodor I of Russia (b. 1557)[11]",
    "February 10 – Anne of Austria, Queen of Poland (b. 1573)",
    "March 4 or March 5 – Lucas Maius, Lutheran Reformation pastor, theologian and playwright (b. 1522)",
    "March 28 – Michele Bonelli, Italian Catholic cardinal (b. 1541)",
    "April 8 – Ludwig Helmbold, German classical singer (b. 1532)",
    "April 10 – Jacopo Mazzoni, Italian philosopher (b. 1548)",
    "April 19\nHans Fugger, German businessman (b. 1531)\nRokkaku Yoshikata, Japanese daimyō (b. 1521)",
    "Hans Fugger, German businessman (b. 1531)",
    "Rokkaku Yoshikata, Japanese daimyō (b. 1521)",
    "May 3 – Anna Guarini, Italian singer (b. 1563)",
    "May 18 – Philipp of Bavaria, German Catholic cardinal (b. 1576)",
    "June – Emery Molyneux, English maker of globes and instruments (date of birth unknown)",
    "June 28 – Abraham Ortelius, Flemish cartographer and geographer (b. 1527)",
    "June 25 – Giacomo Gaggini, Italian artist (b. 1517)",
    "August 4 – William Cecil, 1st Baron Burghley, English statesman (b. 1520)[12]",
    "August 9 – Andreas Angelus, German pastor, teacher, chronicler of the Mark of Brandenburg (b. 1561)",
    "September 13 – Philip II of Spain (b. 1527)[13]",
    "September 18 – Toyotomi Hideyoshi, Japanese warlord (b. 1537)",
    "October 11 – Joachim Camerarius the Younger, German scientist (b. 1534)",
    "November 12 – Johannes Schenck von Grafenberg, German physician (b. 1530)",
    "December 6 – Paolo Paruta, Italian historian (b. 1540)[14]",
    "December 15 – Philips of Marnix, Lord of Saint-Aldegonde, Dutch writer and statesman (b. 1538)[15]",
    "December 16 – Yi Sun-sin, Korean naval leader (b. 1545)",
    "December 31 – Heinrich Rantzau, German humanist writer, astrologer, and astrological writer (b. 1526)",
    "date unknown\nAbdulla Khan, Uzbek/Turkoman ruler\nTeodora Ginés, Dominican musician and composer (b. c. 1530)\nNicolas Pithou, French lawyer and author (b. 1524)",
    "Abdulla Khan, Uzbek/Turkoman ruler",
    "Teodora Ginés, Dominican musician and composer (b. c. 1530)",
    "Nicolas Pithou, French lawyer and author (b. 1524)"
  ]
}