{
  "events": [
    "January 3 – Battle of Kinsale: The English defeat Irish rebels and their Spanish allies. (The battle happens on this date according to the Gregorian calendar used by the Irish and Spanish but on Thursday, 24 December, 1601 according to the old Julian calendar used by the English.)",
    "February 2 (Candlemas night) – First known production of William Shakespeare's comedy Twelfth Night, in London.[1]",
    "March 20 – The United East India Company is established by the United Provinces States-General in Amsterdam, with the stated intention of capturing the spice trade from the Portuguese.",
    "April 20 – The Danish–Icelandic Trade Monopoly is established by the Danish Monarch, in light of recently implemented absolutism.",
    "May 15 – English explorer Bartholomew Gosnold, sailing in the Concord, becomes the first European at Cape Cod.",
    "June – James Lancaster's East India Company fleet arrives at Achin (modern-day Aceh), Sumatra to deal with the local ruler. Having defeated Portugal's ally, the ruler is happy to do business, and Lancaster seizes a large Portuguese galleon and loots it.",
    "October 3–4 – Battle of the Narrow Seas: an English fleet, joined by the Dutch, pursues six Spanish galleys through the Strait of Dover.",
    "November 8 – The Bodleian Library at the University of Oxford in England is opened.[2]",
    "December 11 – A surprise attack by forces under the command of Charles Emmanuel I, Duke of Savoy, and his brother-in-law, Philip III of Spain, is repelled by the citizens of Geneva (this actually takes place after midnight, in the early morning of December 12, but commemorations/celebrations on Fête de l'Escalade are usually held on December 11 or the closest weekend).",
    "Russian famine of 1601–03",
    "Long Turkish War (1591/1593-1606)",
    "Jelali revolts",
    "The Portuguese are expelled from Bahrain.",
    "The Safavid Empire of Persia and the Spanish Empire conclude a defensive alliance and declare war on the Ottoman Empire.",
    "A private trading company is established in Copenhagen with a monopoly on the trade with Iceland.",
    "Ben Jonson's satirical comedy Poetaster is first performed, in London.",
    "William Shakespeare's comedy The Merry Wives of Windsor is published.",
    "The play A Larum for London, or the Siedge of Antwerp is published in London.",
    "Copies are printed of the geographical map of East Asia created by Matteo Ricci, an Italian Jesuit stationed in Ming dynasty Beijing, China, with Chinese-written labeling and map symbols.",
    "The iconoclast and Confucian scholar Li Zhi commits suicide while in a Chinese prison, during the late Ming dynasty; he had taught that women were the intellectual equals of men and should be given equal opportunity in education; he was charged with spreading \"dangerous ideas\"."
  ],
  "births": [
    "January 2\nRodrigo Ponce de León, 4th Duke of Arcos, Spanish noble (d. 1658)\nSir Thomas Twisden, 1st Baronet, English politician (d. 1683)",
    "Rodrigo Ponce de León, 4th Duke of Arcos, Spanish noble (d. 1658)",
    "Sir Thomas Twisden, 1st Baronet, English politician (d. 1683)",
    "January 14 – Sir Henry Slingsby, 1st Baronet, English baronet (d. 1658)",
    "January 18 – Robert Stuart, Duke of Kintyre and Lorne, fifth child of James VI of Scots and Anne of Denmark (d. 1602)",
    "January 19 – Anna Maria Antigó, Spanish Catholic nun (d. 1676)",
    "January 24 – Mildmay Fane, 2nd Earl of Westmorland, English politician (d. 1666)",
    "January 29 – Countess Amalie Elisabeth of Hanau-Münzenberg, Regent of Hesse-Kassel (1637–1650) (d. 1651)",
    "January 31 – Adam Billaut, French poet, carpenter (d. 1662)",
    "February 2 – Jeanne des Anges, French Ursuline nun in Loudun (d. 1665)",
    "February 12 – Michelangelo Cerquozzi, Italian painter (d. 1660)",
    "February 13 – William V, Landgrave of Hesse-Kassel (d. 1637)",
    "February 14 – Francesco Cavalli, Italian composer of the early Baroque period (d. 1676)",
    "February 16 – Eleonore Dorothea of Anhalt-Dessau, Duchess of Saxe-Weimar by marriage (d. 1664)",
    "February 18\nPieter Meulener, Flemish Baroque painter (d. 1654)\nPer Brahe the Younger, Swedish soldier and statesman (d. 1680)",
    "Pieter Meulener, Flemish Baroque painter (d. 1654)",
    "Per Brahe the Younger, Swedish soldier and statesman (d. 1680)",
    "March 12 – Juan Velez, Spanish Catholic prelate who was appointed Bishop of Cebu (d. 1661)",
    "March 18 – Jacques de Billy, French Jesuit mathematician (d. 1679)",
    "March 24 – Edward Leigh, English writer (d. 1671)",
    "March 27 – Sir Christopher Yelverton, 1st Baronet, English politician (d. 1654)",
    "March 29\nJohn Arrowsmith, English theologian and academic (d. 1659)\nJohn Lightfoot, English churchman and rabbinical scholar (d. 1675)",
    "John Arrowsmith, English theologian and academic (d. 1659)",
    "John Lightfoot, English churchman and rabbinical scholar (d. 1675)",
    "April – William Lawes, English composer and musician (d. 1645)",
    "April 2 – Mary of Jesus of Ágreda, Franciscan abbess and spiritual writer (d. 1665)",
    "April 12 – Daniel Knudsen Bildt, Dano-Norwegian military officer and large estate owner in Norway (d. 1651)",
    "April 28 – Tokugawa Yorinobu, Japanese nobleman (d. 1671)",
    "April 30 – Robert Baillie, Scottish divine and historical writer (d. 1662)",
    "May 1 – William Lilly, English astrologer (d. 1681)",
    "May 2 – Athanasius Kircher, German scholar (d. 1680)",
    "May 10 – Samuel Newman, colonial Massachusetts clergyman (d. 1663)",
    "May 12 – Dorothea Augusta of Schleswig-Holstein-Gottorp, German duchess (d. 1682)",
    "May 26 – Philippe de Champaigne, French painter (d. 1674)",
    "June 2 – Rudolf Christian, Count of East Frisia, ruler of East Frisia in the early years of the Thirty Years' War (d. 1628)",
    "July 8 – François Perrochel, French cleric (d. 1682)",
    "July 9 – Maeda Gen'i, Japanese Buddhist priest",
    "July 14 – Cardinal Mazarin, French statesman (d. 1661)[3]",
    "July 15 – John Bradshaw, English judge and regicide (d. 1659)",
    "July 18 – Samuel Stone, Connecticut Puritan minister (d. 1663)",
    "July 26 – Ana de los Angeles Monteagudo, Peruvian nun (d. 1686)",
    "August 10 – Gilles de Roberval, French mathematician (d. 1675)",
    "August 23 – Sir John Marsham, 1st Baronet, English politician (d. 1685)",
    "August 31 – Amalia of Solms-Braunfels, Princess consort to Frederick Henry (d. 1675)",
    "September 1 – Peregrine Hoby, English politician (d. 1679)",
    "September 17 – Sir Richard Newdigate, 1st Baronet, English politician (d. 1678)",
    "September 29 – Algernon Percy, 10th Earl of Northumberland, English military leader (d. 1668)",
    "October 3 – Arnold Braemes, English politician (d. 1681)",
    "October 9 – Robert Caesar, English politician (d. 1637)",
    "October 12 – William Chillingworth, controversial English churchman (d. 1644)",
    "November 6 – William Morice, English politician (d. 1676)",
    "November 17 – Agnes of Jesus, French Catholic nun (d. 1634)",
    "November 20 – Otto von Guericke, German inventor and Mayor of Magdeburg (d. 1686)[4]",
    "November 22 – Elisabeth of France, queen of Philip IV of Spain (d. 1644)",
    "November 23 – Louis Philip, Count Palatine of Simmern-Kaiserslautern, Prince of Paltinate (d. 1655)",
    "November 27 – Chiara Margarita Cozzolani, Italian abbess and composer (d. 1670)",
    "December 4 – Johann Hülsemann, German theologian (d. 1661)",
    "December 7\nAnne Holck, Danish noble and war heroine (d. 1660)\nBartholomew Mastrius, Italian theologian (d. 1673)",
    "Anne Holck, Danish noble and war heroine (d. 1660)",
    "Bartholomew Mastrius, Italian theologian (d. 1673)",
    "December 18 – Simonds d'Ewes, English antiquarian and politician (d. 1650)",
    "December 26 – Sir Norton Knatchbull, 1st Baronet, English politician (d. 1685)",
    "John Berkeley, 1st Baron Berkeley of Stratton (d. 1678)",
    "Caesar, duc de Choiseul, French marshal and diplomat (d. 1675)",
    "John Greaves, English mathematician and antiquary (d. 1652)",
    "Jean-Baptiste Budes, Comte de Guébriant, marshal of France (d. 1643)",
    "Edward Montagu, 2nd Earl of Manchester, English soldier (d. 1671)",
    "Henry Marten, English lawyer, politician and regicide (d. 1680)",
    "Theodorus Moretus, Flemish mathematician (d. 1667)",
    "Nectarius of Jerusalem, Orthodox Patriarch of Jerusalem (d. 1676)",
    "Dudley North, 4th Baron North, English politician (d. 1677)",
    "Katarzyna Ostrogska, Polish noblewoman (d. 1642)",
    "Antoine de l'Age, duc de Puylaurens, French courtier (d. 1635)",
    "Eleonora Ramirez di Montalvo, Italian educator (d. 1659)",
    "Owen Feltham, English religious writer (d. 1668)",
    "Richard Óge Martyn, Irish politician (d. 1648)",
    "Salomon van Ruysdael, Dutch landscape painter (d. 1670)"
  ],
  "deaths": [
    "January – Claude Fauchet, French historian",
    "February 3 – Paulus Melissus, German composer (b. 1539)",
    "February 13 – Alexander Nowell, English clergyman (b. 1507)",
    "February 19 – Philippe Emmanuel, Duke of Mercœur, French soldier (b. 1558)",
    "March 11 – Emilio de' Cavalieri, Italian composer (b. c. 1550)",
    "March 12 – Philip IV, Count of Nassau-Weilburg and Nassau-Saarbrücken (1574–1602) (b. 1542)",
    "March 22 – Agostino Carracci, Italian painter and graphical artist (b. 1557)",
    "March 24 – Ii Naomasa, Japanese general (b. 1561)",
    "March 25 – Joachim Frederick of Brieg, Duke of Wołów (b. 1550)",
    "April 8 – Ludvig Munk, Governor-general of Norway (b. 1537)",
    "April 10 – Amalia of Neuenahr, German noble (b. 1539)",
    "April 20 – Thomas Tichborne, English martyr (b. 1567)",
    "April 26 – Antonio Maria Salviati, Italian Catholic cardinal (b. 1537)",
    "May 9 – Giulio Antonio Santorio, Italian Catholic cardinal (b. 1532)",
    "May 22 – Renata of Lorraine (b. 1544)",
    "May 27 – Robert Stuart, Duke of Kintyre and Lorne, infant son of King James I/VI",
    "July 4 – Anna of Mecklenburg, Duchess consort of Courland (1566–1587) (b. 1533)",
    "July 7 – Friedrich Wilhelm I, Duke of Saxe-Weimar, German noble (b. 1562)",
    "August 12 – Abu'l-Fazl ibn Mubarak, Mughal vizier and historian (b. 1551)",
    "August 23 – Bastianino, Italian painter (b. c. 1536)",
    "September 14 – Jean Passerat, French writer (b. 1534)",
    "September 25\nCaspar Peucer, German reformer (b. 1525)\nWilliam Redman, Bishop of Norwich (b. 1541)",
    "Caspar Peucer, German reformer (b. 1525)",
    "William Redman, Bishop of Norwich (b. 1541)",
    "September 30 – Catherine of Brandenburg-Küstrin, daughter of Margrave John of Küstrin (b. 1549)",
    "October – Thomas Morley, English composer (b. 1557)[5]",
    "October 1 – Hernando de Cabezón, Spanish composer and organist (b. 1541)",
    "October 7 – Thomas Schweicker, German artist (b. 1540)",
    "October 13 – Franciscus Junius, French theologian (b. 1545)",
    "October 20 – Walter Leveson, English Elizabethan Member of Parliament, Shropshire landowner (b. 1550)",
    "October 21\nHedwig of Brandenburg, Duchess of Brunswick-Wolfenbüttel, Duchess consort of Brunswick-Wolfenbüttel (b. 1540)\nKing David I of Kakheti (b. 1569)",
    "Hedwig of Brandenburg, Duchess of Brunswick-Wolfenbüttel, Duchess consort of Brunswick-Wolfenbüttel (b. 1540)",
    "King David I of Kakheti (b. 1569)",
    "October 28 – John, Prince of Schleswig-Holstein, youngest son of Frederick II of Denmark and Norway (b. 1583)",
    "October 30 – Jean-Jacques Boissard, French antiquary and Latin poet (b. 1528)[6]",
    "October 31 – Dominic Collins, Irish Jesuit lay brother and martyr (b. 1566)",
    "November 23 – Agnes of Solms-Laubach, Landgravine of Hesse-Kassel (b. 1578)",
    "November 29 – Anthony Holborne, English composer (b. c. 1545)",
    "December 1 – Kobayakawa Hideaki, Japanese samurai and warlord (b. 1577)",
    "December 29 – Jacopo Corsi, Italian composer (b. 1561)",
    "Kim Myeong-won, Korean politician",
    "Epifani Olives i Terès, Spanish politician",
    "Oda Ujiharu, Japanese warlord",
    "Valpuri Innamaa, Finnish shipowner"
  ]
}