{
  "events": [
    "January 7 – Polish-Swedish War: Battle of Wallhof in Latvia – Gustavus Adolphus, King of Sweden, defeats a Polish army.",
    "January 9 – Peter Minuit sails from Texel Island for America's New Netherland colony, with two ships of Dutch emigrants.",
    "February 2 – King Charles I of England is crowned, but without his wife, Henrietta Maria, who declines to participate in a non-Catholic ceremony.[1]",
    "February 2–10 – Battle of Ningyuan in Xingcheng, Liaoning, China: With a much smaller force, the Ming dynasty commander Yuan Chonghuan defeats the Manchu tribal leader Nurhaci, who dies soon after and is succeeded by Huang Taiji.",
    "February 5 – The Huguenot rebels and the French government sign the Treaty of Paris, ending the second Huguenot rebellion.",
    "February 11 – Emperor Susenyos of Ethiopia and Patriarch Afonso Mendes declare the primacy of the Roman See over the Ethiopian Church, and Roman Catholicism the state religion of Ethiopia.",
    "April 25 – Thirty Years' War: Battle of Dessau Bridge – Albrecht von Wallenstein defeats Ernst von Mansfelds army.",
    "May 4 – Peter Minuit becomes director-general of New Netherland, for the Dutch West India Company.",
    "May 24 – Peter Minuit buys Manhattan from a Native American tribe (Lenape or Shinnecock) for trade goods, valued at 60 guilders ($24.00).",
    "May 30 – Wanggongchang Explosion in Beijing, China: a gunpowder factory explosion destroys part of the city and kills 20,000.[2]",
    "June 15 – King Charles I of England dissolves the English Parliament.[3]",
    "August 1 – Eighty Years' War: Ernst Casimir of Nassau-Dietz retakes Oldenzaal, forcing Spain to withdraw from Overijssel.",
    "August 27 – Thirty Years' War: Battle of Lutter – Tilly defeats King Christian IV of Denmark's army.[4]",
    "September 30 – Nurhaci, chief of the Jurchens and founder of the Qing dynasty, dies and is succeeded by his son Hong Taiji.",
    "November 6 (O.S.) – The ship Arms of Amsterdam arrives in Europe from New Netherland (left September 23) with the news: \"They have purchased the Island Manhattes [Manhattan] from the Indians for the value of 60 guilders.\"[5]",
    "November 18 – The new St Peter's Basilica in the Vatican is consecrated, on the 1,300th anniversary of the previous church in 326.",
    "December 1 – Pasha Muhammad ibn Farukh, tyrannical Governor of Jerusalem, is forced out.",
    "December 20 –  Ferdinand II, Holy Roman Emperor and Transylvanian monarch Bethlen Gabor sign the Peace of Pressburg.",
    "1626 influenza pandemic begins in Asia, then spreads into Europe, Africa, North America,[6][7] and South America[6]",
    "The Würzburg and Bamberg witch trials, which will lead to the mass executions of hundreds of people until 1630/31, begin.",
    "Samuel de Champlain decides to build Cap tourmente (Kap toor-mont) Farm to raise livestock to provide food for settlers in Quebec, rather than depending on supplies sent from France.[8]"
  ],
  "births": [
    "January 9 – Armand Jean le Bouthillier de Rancé, French founder of the Trappist Order (d. 1700)",
    "January 13 – Johann Philipp of Hanau-Lichtenberg, German nobleman (d. 1669)",
    "January 25 – Edward Evelyn, British politician (d. 1692)",
    "February 5 – Marie de Rabutin-Chantal, marquise de Sévigné, French aristocrat and writer (d. 1696)[9]",
    "February 7 – Fabian von Fersen, Swedish soldier and statesman (d. 1677)",
    "February 18 – Francesco Redi, Italian physician (d. 1697)",
    "March 3 – John Hele, English politician (d. 1661)",
    "March 9 – Lorentz Mortensen Angell, Norwegian merchant and landowner (d. 1697)",
    "March 10 – Cornelis Van Caukercken, Flemish engraver, printseller (d. 1680)",
    "March 12 – John Aubrey, English antiquary and writer (d. 1697)[10]",
    "March 16 – Cornelius Van Steenwyk, American politician (d. 1684)",
    "March 21 – Peter of Saint Joseph Betancur, Spanish Catholic saint, missionary to Guatemala (d. 1667)",
    "March 30 – Atto Melani, Italian opera singer (d. 1714)",
    "April 16 – Robert Harley, English politician (d. 1673)[11]",
    "April 10 – Franz Egon of Fürstenberg, German count in the Holy Roman Empire (d. 1682)",
    "April 23 – Maurice Henry, Prince of Nassau-Hadamar (1653–1679) (d. 1679)",
    "April 25 – Sigmund von Birken, German Baroque poet (d. 1681)",
    "May 10 – Jan Jacobszoon Hinlopen, Dutch art collector and merchant (d. 1666)",
    "May 12 – Louis Hennepin, Roman Catholic priest, missionary of the Franciscan Recollet Order (French (d. 1704)",
    "May 14 – Willem Joseph van Ghent, Dutch admiral (d. 1672)",
    "May 16 – Andrea Carlone, Italian painter (d. 1697)",
    "May 17 – Countess Palatine Eleonora Catherine of Zweibrücken, sister of King Charles X of Sweden (d. 1692)",
    "May 21 – Wolfgang Carl Briegel, German organist and composer (d. 1712)",
    "May 27 – William II, Prince of Orange (d. 1650)",
    "June 8 – William Wentworth, 2nd Earl of Strafford, member of England's House of Lords (d. 1695)",
    "June 9 – Sir John Newton, 2nd Baronet, English Member of Parliament (d. 1699)",
    "June 18 – John Mordaunt, 1st Viscount Mordaunt, English politician (d. 1675)",
    "June 29 – Jeffrey Daniel, English politician (d. 1681)",
    "July 15\nChristiane Sehested, daughter of King Christian IV of Denmark, and his morganatic spouse Kirsten Munk (d. 1670)\nHedevig Ulfeldt, daughter of King Christian IV of Denmark and Kirsten Munk (d. 1678)",
    "Christiane Sehested, daughter of King Christian IV of Denmark, and his morganatic spouse Kirsten Munk (d. 1670)",
    "Hedevig Ulfeldt, daughter of King Christian IV of Denmark and Kirsten Munk (d. 1678)",
    "July 17 – Henriette Marie of the Palatinate, German noble (d. 1651)",
    "July 25 – Gerard Brandt, Dutch historian (d. 1685)",
    "August 1\nCharles le Moyne de Longueuil et de Châteauguay, French colonist, interpreter (d. 1685)\nSabbatai Zevi, Sephardic Rabbi (d. 1676)",
    "Charles le Moyne de Longueuil et de Châteauguay, French colonist, interpreter (d. 1685)",
    "Sabbatai Zevi, Sephardic Rabbi (d. 1676)",
    "August 5 – Richard Ottley, English politician (d. 1670)",
    "August 12 – Giovanni Legrenzi, Italian composer (d. 1690)[12]",
    "September 7 – Maria Klara of Dietrichstein, German noblewoman (d. 1667)",
    "September 8 – Simon Patrick, English theologian and bishop (d. 1707)",
    "September 16 – Leopold Wilhelm, Margrave of Baden-Baden, Imperial Field Marshal (d. 1671)",
    "September 27 – William Douglas, 2nd Lord Mordington, eldest son and heir of Sir James Douglas (d. 1671)",
    "September 28 – Elizabeth Maitland, Duchess of Lauderdale, influential British noblewoman (d. 1698)",
    "October 4 – Richard Cromwell, Lord Protector of England, Scotland, and Ireland (d. 1712)[13]",
    "October 5 – George II, Duke of Württemberg-Montbéliard (1662–1699) (d. 1699)",
    "October 6 – Géraud de Cordemoy, French historian, philosopher and lawyer (d. 1684)",
    "October 17 – Samuel Danforth, American Puritan minister, preacher, poet, astronomer, missionary (d. 1674)",
    "October 23 – Francis Marsh, Irish bishop (d. 1693)",
    "November 8\nMatthew Marvin, Jr., Connecticut settler (d. 1712)\nCésar-Pierre Richelet, French grammarian and lexicographer (d. 1698)",
    "Matthew Marvin, Jr., Connecticut settler (d. 1712)",
    "César-Pierre Richelet, French grammarian and lexicographer (d. 1698)",
    "November 30 – Cesare Pronti, Italian painter (d. 1708)",
    "December 8 – Queen Christina of Sweden (d. 1689)",
    "December 10 – George Christian, Landgrave of Hesse-Homburg (1669–1671) (d. 1677)",
    "December 12 – Giovanni Francesco Ginetti, nephew of Cardinal Marzio Ginetti (d. 1691)",
    "December 18 – William Stanhope, English politician (d. 1703)",
    "December 20 – Veit Ludwig von Seckendorff, German statesman (d. 1692)",
    "December 21 – Francis Scott, 2nd Earl of Buccleuch, son of Walter Scott (d. 1651)",
    "December 31 – Ladislaus, Count Esterházy, Hungarian noble (d. 1652)"
  ],
  "deaths": [
    "January 2 – Maria Buynosova-Rostovskaya (b. 1590)",
    "January 19 – Ruqaiya Sultan Begum (b. 1542)",
    "January 23 – Decio Carafa, Archbishop of Naples who had previously served as papal nuncio to the Spanish Netherlands (1606–1607) and to Habsburg Spain (1607–1611) (b. 1556)",
    "January 24 – Samuel Argall, English adventurer and naval officer (b. 1580)",
    "c. January? – Patrick Galloway, Moderator of the General Assembly of the Church of Scotland (b. c. 1551)",
    "February 7 – William V, Duke of Bavaria (b. 1548)",
    "February 11 – Pietro Cataldi, Italian mathematician (b. 1552)",
    "February 20 – John Dowland, English composer and lutenist (b. 1563)[14]",
    "February 21 – Odoardo Farnese, Italian Catholic cardinal  (b. 1573)",
    "March 3 – William Cavendish, 1st Earl of Devonshire, England (b. 1552)",
    "March 10 – John Dormer, English Member of Parliament (b. 1556)",
    "March 19 – Pierre Coton, French Jesuit and royal confessor (b. 1564)",
    "April 5 – Anna Koltovskaya (b. c. 1552)",
    "April 9 – Francis Bacon, English scientist and statesman (b. 1561)[15]",
    "April 11 – Marino Ghetaldi, Croatian mathematician and physicist (b. 1568)",
    "May 4 – Arthur Lake, Bishop of Bath and Wells, English bishop, Bible translator (b. 1569)",
    "May 17 – Joan Pau Pujol, Catalan composer (b. 1570)",
    "May 28 – Thomas Howard, 1st Earl of Suffolk (b. 1561)[16]",
    "June 7 – Anne of Saint Bartholomew, Spanish Discalced Carmelite nun (b. 1550)",
    "June 16\nAlbert, Count of Nassau-Dillenburg, joint ruler of Nassau-Dillenburg 1623–1626 (b. 1596)\nChristian, Duke of Brunswick-Lüneburg-Wolfenbüttel, German Protestant military leader (b. 1599)",
    "Albert, Count of Nassau-Dillenburg, joint ruler of Nassau-Dillenburg 1623–1626 (b. 1596)",
    "Christian, Duke of Brunswick-Lüneburg-Wolfenbüttel, German Protestant military leader (b. 1599)",
    "June 29 – Scipione Cobelluzzi, Italian cardinal and archivist (b. 1564)",
    "June 30 – Honda Tadatoki (b. 1596)",
    "July 13 – Robert Sidney, 1st Earl of Leicester, English statesman (b. 1563)[17]",
    "July 15 – Isabella Brant, Flemish artists' model, first wife of painter Peter Paul Rubens (b. 1591)",
    "July 19 – Elizabeth of Denmark, Duchess of Brunswick-Wolfenbüttel, German regent  (b. 1573)",
    "July 27 – Louis V, Landgrave of Hesse-Darmstadt (b. 1577)",
    "August 13 – Maria of Brunswick-Lüneburg, Duchess Consort of Saxe-Lauenburg (1582–1619) (b. 1566)",
    "August 15 – Girolamo Asteo, Roman Catholic prelate who served as Bishop of Veroli (1608–1626) (b. 1562)",
    "August 23 – Francesco Cereo de Mayda, Roman Catholic prelate who served as Bishop of Lavello (1621–1626) (b. 1568)",
    "August 25 – Alfonso Pozzi, Roman Catholic prelate who served as Bishop of Borgo San Donnino (1620–1626) (b. 1582)",
    "August 28 – Isabella of Savoy, Italian noble (b. 1591)",
    "September 2 – Antonio Franco, Italian Catholic bishop, prelate of Santa Lucia del Mela (b. 1585)",
    "September 16 – Denis-Simon de Marquemont, French cardinal and archbishop (b. 1572)",
    "September 17 – Johann Schweikhard von Kronberg, Archbishop-Elector of Mainz from 1604 to 1626 (b. 1553)",
    "September 21 – François de Bonne, Duke of Lesdiguières, Constable of France (b. 1543)",
    "September 22 – Aodh Mac Cathmhaoil, Irish Franciscan theologian and Archbishop of Armagh (b. 1571)",
    "September 25 – Lancelot Andrewes, English scholar (b. 1555)[18]",
    "September 26 – Wakisaka Yasuharu, Japanese warrior (b. 1554)",
    "September 30 – Nurhaci, Chinese chieftain (b. 1559)",
    "October 1 – Lady Abahai (b. 1590)",
    "October 2 – Diego Sarmiento de Acuña, 1st Count of Gondomar, Spanish diplomat (b. 1567)",
    "October 10 – William Hockmere, English politician (b. 1581)",
    "October 13 – Domingo de Oña, Roman Catholic prelate, Bishop of Gaeta (1605–1626) (b. 1560)",
    "October 28 – Muhammad Parviz, Mughal emperor (b. 1589)",
    "October 29 – Ferdinando Gonzaga, Duke of Mantua, Italian Catholic cardinal (b. 1587)",
    "October 30 – Willebrord Snell, Dutch astronomer and mathematician (b. 1580)",
    "November 21 – Anna Maria of Hesse-Kassel, countess consort of Nassau-Saarbrücke (b. 1567)",
    "November 25 – Edward Alleyn, English actor (b. 1566)",
    "November 29 – Ernst von Mansfeld, German soldier (b. c. 1580)",
    "December 6 – John Ernest I, Duke of Saxe-Weimar, German duke (b. 1594)",
    "December 8 – John Davies, English poet and politician (b. 1569)[19]",
    "December 10 – Edmund Gunter, English mathematician (b. 1581)",
    "December 28\nGábor Esterházy (1580–1626), Hungarian noble (b. 1580)\nJuraj V Zrinski, Ban of Croatia (b. 1599)",
    "Gábor Esterházy (1580–1626), Hungarian noble (b. 1580)",
    "Juraj V Zrinski, Ban of Croatia (b. 1599)"
  ]
}