{
  "events": [
    "January 4 – First English Civil War: Charles I attempts to arrest six leading members of the Long Parliament, but they escape.",
    "March 1 – Georgeana, Massachusetts (now known as York, Maine) becomes the first incorporated city in America.",
    "March 19 – The citizens of Galway seize an English naval ship, close the town gates, and declare support for Confederate Ireland.",
    "April 8 – George Spencer is executed by the New Haven Colony, for alleged bestiality.",
    "May 1 – Honours granted by Charles I, from this date onward, are retrospectively annulled by Parliament.",
    "May 17 – Ville-Marie (later Montreal) is founded as a permanent settlement.",
    "July – First English Civil War: Charles I besieges Hull, in an attempt to gain control of its arsenal.",
    "August 4 – Lord Forbes relieves Forthill, and besieges Galway.",
    "August 22 – King Charles I raises the royal battle standard over Nottingham Castle, so declaring war on his own Parliament.",
    "September 2 – Parliament orders the theatres of London closed, effectively ending the era of English Renaissance theatre.",
    "September 6 – England's Long Parliament suppresses all stage plays in theatres.",
    "September 7 – Lord Forbes raises his unsuccessful siege of Galway.",
    "September 8 – Thomas Granger is executed by hanging at Plymouth, Massachusetts, for confessing to numerous acts of bestiality.[1]",
    "October 23 – First English Civil War – Battle of Edgehill: Royalists and Parliamentarians battle to a draw.",
    "November 13 – First English Civil War – Battle of Turnham Green: The Royalist forces withdraw in face of the Parliamentarian army, and fail to take London.",
    "November 24 – Abel Tasman becomes the first European to discover the island Van Diemen's Land (later renamed Tasmania).",
    "First week of December – First English Civil War – Battle of Muster Green: A small Parliamentarian army routes a small Royalist army after fighting on Muster Green, Haywards Heath.",
    "December 13 – Abel Tasman is the first recorded European to sight New Zealand.",
    "December 25 (O.S.) – Birth of English polymath Isaac Newton at Woolsthorpe-by-Colsterworth in Lincolnshire.",
    "The Dutch drive Spain from Taiwan.",
    "The village of Bro (Broo), Sweden is granted city rights for the second time, and takes the name Kristinehamn (literally \"Christina's port\") after the then Swedish monarch, Queen Christina.",
    "Rembrandt finishes his painting, The Night Watch.",
    "The Manchu, under their leader Hong Taiji, raid the Ming Chinese province of Shandong from their base in Manchuria. Two years later Beijing falls to rebels, the Chongzhen Emperor commits suicide, and the Shunzhi Emperor becomes the first Qing Emperor to rule over China proper.",
    "1642 Yellow River flood: Some 300,000 people die, when the Ming Dynasty army in China intentionally breaks the dams and dykes of the Yellow River, to break the siege by the large rebel force of Li Zicheng.",
    "Isaac Aboab da Fonseca is appointed rabbi in Pernambuco, Brazil, thus becoming the first rabbi of the Americas."
  ],
  "births": [
    "January 2\nJohannes van Haensbergen, Dutch Golden Age painter (d. 1705)\nMehmed IV, Sultan of the Ottoman Empire (1648-1687) (d. 1693)",
    "Johannes van Haensbergen, Dutch Golden Age painter (d. 1705)",
    "Mehmed IV, Sultan of the Ottoman Empire (1648-1687) (d. 1693)",
    "January 3 – Diego Morcillo Rubio de Auñón, Spanish-born Peruvian Catholic bishop (d. 1730)",
    "January 4 – Philippe Pierson, Belgian Jesuit missionary (d. 1688)",
    "January 5 – Johann Philipp Jeningen, German Catholic priest from Eichstätt, Bavaria (d. 1704)",
    "January 6\nJulien Garnier, French Jesuit missionary to Canada (d. 1730)\nGisbert Steenwick, Dutch musician (d. 1679)",
    "Julien Garnier, French Jesuit missionary to Canada (d. 1730)",
    "Gisbert Steenwick, Dutch musician (d. 1679)",
    "January 11\nJohann Friedrich Alberti, German composer and organist (d. 1710)\nMary Carleton, Englishwoman who used false identities (d. 1673)",
    "Johann Friedrich Alberti, German composer and organist (d. 1710)",
    "Mary Carleton, Englishwoman who used false identities (d. 1673)",
    "January 26 – Evert Collier, Dutch Golden Age painter (d. 1708)",
    "February 3 – Philip Aranda, Spanish Jesuit theologian (d. 1695)",
    "February 18 – Marie Champmeslé, French actress (d. 1698)",
    "March 2 – Claudio Coello, Spanish Baroque painter (d. 1693)",
    "March 4 – Stanisław Herakliusz Lubomirski, Polish noble (d. 1702)",
    "March 23 – Hester Davenport, English stage actress (d. 1717)",
    "March 25 – Anna Talbot, Countess of Shrewsbury, English countess (d. 1702)",
    "March 28 – Henry Wolrad, Count of Waldeck-Eisenberg (1645–1664) (d. 1664)",
    "March 29 – Emich Christian of Leiningen-Dagsburg, Lord of Broich, Oberstein and Bürgel (d. 1702)",
    "March 31 – Ephraim Curtis, American colonial military officer (d. 1684)",
    "April 15 – Suleiman II, Ottoman Sultan (d. 1691)",
    "April 21 – Simon de la Loubère, French diplomat (d. 1729)",
    "April 27 – Francisque Millet, Flemish-French painter (d. 1679)",
    "April 30 – Christian Weise, German writer, dramatist, poet, pedagogue and librarian (d. 1708)",
    "May 5 – James Tyrrell, English barrister and writer (d. 1718)",
    "June 8 – Frescheville Holles, English Member of Parliament (d. 1672)",
    "June 12 – Alexander Seton, 3rd Earl of Dunfermline, earl in the Peerage of Scotland (d. 1677)",
    "June 13 – Queen Myeongseong, Korean royal consort (d. 1684)",
    "June 18 – Paul Tallement the Younger, French writer (d. 1712)",
    "June 20 – George Hickes, English minister and scholar (d. 1715)",
    "June 28 – Jacob de Graeff, member of the De Graeff-family from the Dutch Golden Age (d. 1690)",
    "July 3 – Joseph-François Hertel de la Fresnière, military officer of New France (d. 1722)",
    "July 7 – Gregorio II Boncompagni, Italian nobleman, 5th Duke of Sora (d. 1707)",
    "July 25 – Louis I, Prince of Monaco, Monegasque prince (d. 1701)",
    "August 3 – Robert Austen, English politician (d. 1696)",
    "August 12 – Andrea Scacciati, Italian painter (d. 1710)",
    "August 14 – Cosimo III de' Medici, Grand Duke of Tuscany (d. 1723)",
    "September 1 – Angelo Paoli, Italian beatified (d. 1720)",
    "September 5 – Maria of Orange-Nassau, Dutch princess (d. 1688)",
    "September 6 – Georg Christoph Bach, German composer (d. 1697)",
    "September 23 – Giovanni Maria Bononcini, Italian violinist and composer (d. 1678)",
    "October 12 – Abraham van Calraet, Dutch painter (d. 1722)",
    "November 4 – Zheng Jing, Chinese pirate (d. 1681)",
    "November 5 – Nils Gyldenstolpe, Swedish count, official and diplomat (d. 1709)",
    "November 9 – Sir John Lowther, 2nd Baronet, of Whitehaven, English politician (d. 1706)",
    "November 11 – André Charles Boulle, French cabinet-maker (d. 1732)",
    "November 16 – Cornelis Evertsen the Youngest, Dutch admiral (d. 1706)",
    "November 24 – Anne Hilarion de Tourville, French naval commander under King Louis XIV (d. 1701)",
    "November 30 – Andrea Pozzo, Jesuit Brother, architect and painter (d. 1709)",
    "December 6\nJohann Christoph Bach, German composer and organist (d. 1703)[2]\nGerard Callenburgh, Dutch admiral (d. 1722)",
    "Johann Christoph Bach, German composer and organist (d. 1703)[2]",
    "Gerard Callenburgh, Dutch admiral (d. 1722)",
    "December 8 – Nicolas Roland, French priest and founder (d. 1678)",
    "December 13 – Friedrich Seyler, Swiss theologian (d. 1708)",
    "December 17\nFrancisco Castillo Fajardo, Marquis of Villadarias, Spanish general (d. 1716)\nFrancis de Geronimo, Italian priest (d. 1716)",
    "Francisco Castillo Fajardo, Marquis of Villadarias, Spanish general (d. 1716)",
    "Francis de Geronimo, Italian priest (d. 1716)",
    "December 23 – John Holt, English politician (d. 1710)",
    "December 25 – Sir Isaac Newton, English scientist (d. 1727)[3]",
    "December 30\nVincenzo da Filicaja, Italian poet (d. 1707)\nFrançois Roger de Gaignières, French genealogist, antiquary, collector (d. 1715)",
    "Vincenzo da Filicaja, Italian poet (d. 1707)",
    "François Roger de Gaignières, French genealogist, antiquary, collector (d. 1715)",
    "Abdul-Qādir Bīdel, Persian Sufi poet (d. 1720)",
    "Bonaventure Giffard, English Catholic priest (d. 1734)",
    "Albert Janse Ryckman, Mayor of Albany, prominent brewermaster (d. 1737)",
    "Marie Anne de La Trémoille, princesse des Ursins, politically active Spanish court official (d. 1722)"
  ],
  "deaths": [
    "January 8 – Galileo Galilei, Italian astronomer and physicist (b. 1564)[4]",
    "January 12 – Johann Ernst, Count of Hanau-Münzenberg (1641–1642) (b. 1613)",
    "January 13 – Sophia Hedwig of Brunswick-Lüneburg, German noblewoman (b. 1592)",
    "January 21 – Alban Roe, English Benedictine martyr (b. 1583)",
    "February 7 – William Bedell, English clergyman (b. 1571)[5]",
    "February 19 – Jørgen Knudsen Urne, Danish noble (b. 1598)",
    "March 30 – William Augustus, Duke of Brunswick-Harburg (b. 1564)",
    "April 30 – Dmitry Pozharsky, Russian prince (b. 1578)",
    "May 9 – Jacques Bonfrère, Flemish Jesuit priest and biblical scholar (b. 1573)",
    "May 24 – Polyxena von Lobkowicz, politically active Czech aristocrat (b. 1566)",
    "June 14 – Saskia van Uylenburgh, wife of painter Rembrandt van Rijn (b. 1612)",
    "July 3 – Marie de' Medici, French queen consort and regent (b. 1573)[6]",
    "July 4 – Erzsébet Thurzó, Hungarian noblewoman (b. 1621)",
    "July 5 – Festus Hommius, Dutch theologian (b. 1576)",
    "July 18 – William of Nassau-Hilchenbach, German count (b. 1592)",
    "July 25 – Crato, Count of Nassau-Saarbrücken (1640–1642) (b. 1621)",
    "July 30 – Franz von Hatzfeld, Prince-Bishop of Würzburg (b. 1596)",
    "August 18 – Guido Reni, Italian painter (b. 1575)",
    "September 3 – Countess Elisabeth of Nassau, regent of Sedan (b. 1577)",
    "September 8 – Herman de Neyt, Flemish painter (b. 1588)",
    "September 12 – Henri Coiffier de Ruzé, Marquis of Cinq-Mars, French conspirator (b. 1620)",
    "September 29 – René Goupil, French Jesuit missionary, first of the Canadian Martyrs (b. 1608)",
    "October 3 – Charles Howard, 2nd Earl of Nottingham, English noble (b. 1579)",
    "October 19 – Giovanni Doria, Spanish noble (b. 1573)",
    "October 23 – George Stewart, 9th Seigneur d'Aubigny, Scottish nobleman and military commander (b. 1618)",
    "October 24 – Robert Bertie, 1st Earl of Lindsey,  English Fen drainage adventurer and soldier (b. 1583)",
    "November 1 – Jean Nicolet, French explorer (b. 1598)",
    "November 7 – Henry Montagu, 1st Earl of Manchester, English politician (b. c. 1563)",
    "November 14 – Henry Wallop, English politician (b. 1568)",
    "November 24 – Walatta Petros, saint in the Ethiopian Orthodox Tewahedo Church (b. 1592)",
    "November 25 – Christian Günther I, Count of Schwarzburg-Sondershausen (1601–1642) (b. 1578)",
    "December 4 – Armand Jean du Plessis, Cardinal Richelieu, French statesman (b. 1585)",
    "December 6 – Charles Caesar, English politician and judge (b. 1590)",
    "December 23 – Louis de Dieu, Dutch theologian (b. 1590)",
    "December 27 – Herman op den Graeff, Dutch bishop (b. 1585)",
    "date unknown – Catholicos Patriarch Eudemus I of Georgia"
  ]
}