{
  "events": [
    "January 22 – The Royalist Oxford Parliament is first assembled by King Charles I of England.[1]",
    "January 26 – First English Civil War – Battle of Nantwich: The Parliamentarians defeat the Royalists, allowing them to end the 6-week Siege of Nantwich in Cheshire, England.[2]",
    "February–August – Explorer Abel Tasman's second expedition, for the Dutch East India Company, maps the north coast of Australia.",
    "January 30 – Battle of Ochmatów: Polish–Lithuanian Commonwealth forces under hetman Stanisław Koniecpolski secure a substantial victory over the horde of Crimean Tatars, under Tugay Bey.",
    "February 5 – The first livestock branding law in America is passed in Connecticut.[3]",
    "March – Matthew Hopkins begins his career as a witch-hunter in the eastern counties of England.",
    "March 24 – In England, Roger Williams is granted an official grant for his Rhode Island Colony, allowing the establishment of a general assembly.",
    "April 25 – A popular Chinese rebellion led by Li Zicheng sacks Beijing, prompting Chongzhen, the last emperor of the Ming Dynasty, to commit suicide.",
    "May 6 – Johan Mauritius resigns as Governor of Brazil.[3]",
    "May 25 – Ming general Wu Sangui forms an alliance with the invading Manchus, and opens the gates of the Great Wall of China at Shanhaiguan Pass, letting the Manchus through, towards the capital Beijing.",
    "May 26 – Battle of Montijo: The Kingdom of Portugal is victorious over Habsburg Spain, in the first major action between the two nations during the Portuguese Restoration War.",
    "May 27 – Battle of Shanhai Pass: The Manchu Qing Dynasty and Wu Sangui gain a decisive victory, over Li Zicheng's Shun Dynasty.",
    "June 3 – Li Zicheng proclaims himself emperor of China.",
    "June 6 – The invading Qing army, with the help of Ming general Wu Sangui, captures Beijing, China. This marks the beginning of Manchu rule over China proper.",
    "July 2 – English Civil War – Battle of Marston Moor: The Parliamentarians crush the Royalists, ending Charles I's hold on the north of England.[4]",
    "September 1 – English Civil War – Battle of Tippermuir: Montrose defeats Lord Elcho's Covenanters, reviving the Royalist cause in Scotland.",
    "September 2 – English Civil War – Second Battle of Lostwithiel: Charles I and the Royalists gain their last major victory.[5]",
    "September 15 – Pope Innocent X succeeds Pope Urban VIII, becoming the 236th pope.[6]",
    "October 1 – The Jews of Mogilev, Polish–Lithuanian Commonwealth, are attacked during Tashlikh.",
    "November – The Castle of Elvas in Portugal resists a 9-day siege by the Spanish during the Portuguese Restoration War.",
    "November 8 – The Shunzhi Emperor, the third emperor of the Qing dynasty, is enthroned in Beijing after the collapse of the Ming dynasty as the first Qing emperor to rule over China.",
    "November 23\nBattle of Jüterbog: Sweden's forces defeat those of the Holy Roman Empire.\nAreopagitica, by John Milton, is published in England.",
    "Battle of Jüterbog: Sweden's forces defeat those of the Holy Roman Empire.",
    "Areopagitica, by John Milton, is published in England.",
    "December – Plague breaks out in Edinburgh.",
    "December 18 (December 8 Old Style) – As Christina comes of age, she is made ruling queen of Sweden.",
    "The opera Ormindo is first performed in Venice (music by Francesco Cavalli, and libretto by Giovanni Faustini).",
    "Sigismund's Column is erected in Warsaw, to commemorate King Sigismund III Vasa, who moved the capital of Poland from Kraków to Warsaw in 1596.",
    "Philosopher René Descartes publishes Principia Philosophiae (Principles of Philosophy).",
    "During the English Civil War, Prince Rupert and his men take Liverpool Castle, which is later reclaimed by Sir John Moore.",
    "Opchanacanough leads the Powhatan Indians in an unsuccessful uprising against the English at Jamestown. This is the last such Indian rebellion in the region.",
    "A Spanish officer is murdered in St. Dominic's Church, Macau during mass, by colonists loyal to Portugal, during the Portuguese Restoration War.",
    "The West India Company[which?] displays greater interest in profit than in colonization.[vague]"
  ],
  "births": [
    "January 9 – Robert Gibbes, English landgrave (d. 1715)",
    "January 10\nLouis François, duc de Boufflers, Marshal of France (d. 1711)\nCelestino Sfondrati, Italian Catholic cardinal (d. 1696)",
    "Louis François, duc de Boufflers, Marshal of France (d. 1711)",
    "Celestino Sfondrati, Italian Catholic cardinal (d. 1696)",
    "January 11 – Hayashi Hōkō, Japanese philosopher (d. 1732)",
    "January 14 – Thomas Britton, English concert promoter (d. 1714)",
    "January 18 – John Partridge, English astrologer (d. 1708)",
    "January 23 – Jonas Budde, Norwegian army officer (d. 1710)",
    "January 25 – Antoine Thomas, Jesuit priest, missionary, astronomer (d. 1709)[7]",
    "January 26 – Thomas Boylston, American colonial doctor (d. 1695)",
    "February 2\nIsaac Chayyim Cantarini, Italian rabbi (d. 1723)\nJohannes Hancke, German writer (d. 1713)",
    "Isaac Chayyim Cantarini, Italian rabbi (d. 1723)",
    "Johannes Hancke, German writer (d. 1713)",
    "February 7 – Nils Bielke, member of the High Council of Sweden (d. 1716)",
    "February 8 – Pierre de La Broue, American bishop (d. 1720)",
    "February 12 – Jakob Ammann, Swiss founder of the Amish sect (d. 1712)",
    "February 24 – Maria Elisabeth Lämmerhirt, German mother of Johann Sebastian Bach (d. 1694)",
    "March 1 – Simon Foucher, French polemicist (d. 1696)",
    "March 15 – Veit Hans Schnorr von Carolsfeld, German iron and cobalt magnate (d. 1715)",
    "March 21 – Sir Walter Bagot, 3rd Baronet, English politician (d. 1704)",
    "March 22\nOtto Mencke, German philosopher and scientist (d. 1707)\nSir James Rushout, 1st Baronet, English politician (d. 1698)",
    "Otto Mencke, German philosopher and scientist (d. 1707)",
    "Sir James Rushout, 1st Baronet, English politician (d. 1698)",
    "March 25 – Heinrich von Cocceji, German jurist from Bremen (d. 1719)",
    "March 31 – Henry Winstanley, English engineer (d. 1703)",
    "April 6 – António Luís de Sousa, 2nd Marquis of Minas, Portuguese general, governor-general of Brazil (d. 1721)",
    "April 7\nNathaniel Johnson, American politician (d. 1713)\nFrançois de Neufville, duc de Villeroy, French soldier (d. 1730)",
    "Nathaniel Johnson, American politician (d. 1713)",
    "François de Neufville, duc de Villeroy, French soldier (d. 1730)",
    "April 11 – Marie Jeanne Baptiste of Savoy-Nemours, Duchess of Savoy (d. 1724)",
    "April 17 – Abraham Storck, Dutch painter (d. 1708)",
    "April 21 – Conrad von Reventlow, Danish statesman and the first Grand Chancellor of Denmark (d. 1708)",
    "May 2 – Robert Cotton, English politician (d. 1717)",
    "May 4 – Juan Caballero y Ocio, Spanish priest remarkable for lavish gifts to the Catholic Church and charity (d. 1707)",
    "May 5 – Sir Richard Newdigate, 2nd Baronet, English landowner (d. 1710)",
    "May 26 – Michael Ettmüller, German physician (d. 1683)",
    "June 2 – William Salmon, English medical writer (d. 1713)",
    "June 7 – Johann Christoph Volkamer, German botanist (d. 1720)",
    "June 16 – Henrietta Anne Stuart, Princess of Scotland, England and Ireland (d. 1670)[8]",
    "June 17 – Johann Wolfgang Franck, German baroque composer (d. 1710)",
    "July 2 – Abraham a Sancta Clara, German Augustinian monk (d. 1709)",
    "July 4 – Josceline Percy, 11th Earl of Northumberland, English noble (d. 1670)",
    "July 7 – Joan Geelvinck, Dutch politician (d. 1707)",
    "July 10 – Miguel Bayot, Spanish Catholic prelate, Bishop of Cebu (1697–1700) (d. 1700)",
    "July 22 – Peter Drelincourt, Irish chaplain (d. 1722)",
    "August 6\nChristian Ernst, Margrave of Brandenburg-Bayreuth (1655–1712) (d. 1712)\nLouise de La Vallière, French mistress of Louis XIV of France (d. 1710)[9]",
    "Christian Ernst, Margrave of Brandenburg-Bayreuth (1655–1712) (d. 1712)",
    "Louise de La Vallière, French mistress of Louis XIV of France (d. 1710)[9]",
    "August 12 – Heinrich Ignaz Franz Biber, Bohemian composer and violinist (d. 1704)",
    "August 29 – Anne Bourdon, nun in New France (d. 1711)",
    "August 30 – Thomas Tufton, 6th Earl of Thanet, British politician (d. 1729)",
    "September 3 – Richard Newport, 2nd Earl of Bradford, English politician (d. 1723)",
    "September 6 – Juan Bautista Cabanilles, Spanish composer (d. 1712)",
    "September 11 – Jacob Rotius, Dutch painter (d. 1681)",
    "September 22 – Jacques Échard, French Dominican, historian of the Order (d. 1724)",
    "September 25 – Ole Rømer, Danish astronomer (d. 1710)",
    "October 1 – Jean Rousseau, French viol player (d. 1699)",
    "October 2 – François-Timoléon de Choisy, French author (d. 1724)",
    "October 3 – Adriaen Frans Boudewijns, Landscape painter (d. 1719)",
    "October 12 – Christopher Sandius, Dutch Arian writer (d. 1680)",
    "October 13 – Sipihr Shikoh, Mughal Emperor (d. 1708)",
    "October 14 – William Penn, English Quaker and founder of Pennsylvania (d. 1718)",
    "October 26 – Mathias Steuchius, Swedish archbishop (d. 1730)",
    "November 23 (bapt.) – Cornelia van der Gon, Dutch art collector (d. 1701)",
    "December 8 – Maria d'Este, Italian noble (d. 1684)",
    "December 9 – Robert Kirk, Scottish folklorist, Bible translator, Gaelic scholar (d. 1692)",
    "December 23 – Tomás de Torrejón y Velasco, Spanish composer, musician and organist (d. 1728)",
    "December 25 – Walter Scott, Earl of Tarras, Scottish nobleman (d. 1693)",
    "December 29 – Philips van Almonde, Dutch Lieutenant Admiral (d. 1711)",
    "Matsuo Bashō, Japanese poet (d. 1694)",
    "Pietro Erardi, Maltese chaplain and painter (d. 1727)[10]",
    "Gilles Schey, Dutch admiral (d. 1703)",
    "Antonio Stradivari, Italian violin maker (d. 1737)[11]"
  ],
  "deaths": [
    "January 20 – Stefano Amadei, Italian painter (b. 1580)",
    "January 30 – William Chillingworth, controversial English churchman (b. 1602)",
    "January 31 – Georg II of Fleckenstein-Dagstuhl, German nobleman (b. 1588)",
    "February 28 – Guru Har Gobind, the Sixth Sikh Guru (b. 1595)",
    "March 15 – Countess Louise Juliana of Nassau, Regent of Bohemia (b. 1576)",
    "March 24 – Cecilia Renata of Austria, Queen of Poland (b. 1611)",
    "March 29 – Lord John Stewart, Scottish aristocrat, Royalist commander in the English Civil War (b. 1621)",
    "April 2 – Diego Salcedo, Spanish bishop (b. 1575)",
    "April 10 – Reverend William Brewster, English Pilgrim leader (b. 1567)",
    "April 25 – Chongzhen, last Ming Emperor of China (suicide) (b. 1611)",
    "April 28 – Zsófia Bosnyák, Hungarian noblewoman (b. 1609)",
    "May 26 – Alfonso III d'Este, Duke of Modena, Italian noble (b. 1591)",
    "June 17\nAnne de Montafié, Countess of Clermont-en-Beauvaisis, French countess (b. 1577)\nJohn of St. Thomas, Portuguese philosopher (b. 1589)",
    "Anne de Montafié, Countess of Clermont-en-Beauvaisis, French countess (b. 1577)",
    "John of St. Thomas, Portuguese philosopher (b. 1589)",
    "July 4 – Brian Twyne, English archivist (b. 1581)",
    "July 7 – Hedwig of Hesse-Kassel, countess consort of Schaumburg (b. 1569)",
    "July 16 – Giovanni Biliverti, Italian painter (b. 1585)",
    "July 25 – Amar Singh Rathore, Rajput nobleman affiliated with the royal house of Marwar (b. 1613)",
    "July 29 – Pope Urban VIII (b. 1568)[12]",
    "August 25 – Johann Heinrich Alting, German Lutheran theologian (b. 1583)",
    "September 4 – Johannes Wtenbogaert, Dutch leader of the Remonstrants (b. 1557)",
    "September 7\nGuido Bentivoglio, Italian statesman and historian (b. 1579)[13]\nRalph Corbie, Irish Jesuit (b. 1598)",
    "Guido Bentivoglio, Italian statesman and historian (b. 1579)[13]",
    "Ralph Corbie, Irish Jesuit (b. 1598)",
    "September 8\nJohn Coke, English politician (b. 1563)[14]\nFrancis Quarles, English poet (b. 1592)[15]",
    "John Coke, English politician (b. 1563)[14]",
    "Francis Quarles, English poet (b. 1592)[15]",
    "October 6 – Elisabeth of France, queen of Philip IV of Spain (b. 1602)",
    "October 19 – Johann Friedrich, Count Palatine of Sulzbach-Hilpoltstein (b. 1587)",
    "October 30 – Jorge de Cárdenas y Manrique de Lara, Spanish noble (b. 1584)",
    "November 6 – Thomas Roe, English diplomat (b. c. 1581)",
    "November 10 – Luis Vélez de Guevara, Spanish writer (b. 1579)",
    "November 20 – Nathaniel Foote, American colonist (b. 1592)",
    "November 24 – Deodat del Monte, Flemish painter, architect (b. 1582)",
    "December 20 – Albert IV, Duke of Saxe-Eisenach (1640–1644) (b. 1599)",
    "December 23 – Sir Alexander Carew, 2nd Baronet, English politician (b. 1609)",
    "December 28 – John Bankes, Attorney General and Chief Justice to King Charles I of England (b. 1589)",
    "December 30 – Jan Baptist van Helmont, Flemish chemist (b. 1577)"
  ]
}