{
  "events": [
    "January – The Khmelnytsky Uprising in Ukraine, at this time part of the Republic of Both Nations (Polish–Lithuanian Commonwealth), begins.",
    "January 17 – England's Long Parliament passes the Vote of No Addresses, breaking off negotiations with King Charles I, and thereby setting the scene for the second phase of the English Civil War.",
    "January 30 – The Dutch and the Spanish sign the Peace of Münster, ending the Eighty Years' War. The Spanish Empire recognizes the Dutch Republic of United Netherlands as a sovereign state (governed by the House of Orange-Nassau and the States General), which was previously a province of the Spanish Empire (ratified May 15).",
    "March 31 – A major earthquake strikes Van in Ottoman Armenia.[2]",
    "April 19 – First Battle of Guararapes: The Portuguese army defeats the Dutch army, in the north of Brazil.",
    "June–September – Semyon Dezhnyov makes the first recorded voyage through the Bering Strait, between Asia and North America.[3]",
    "June 1 – The Roundheads defeat the Cavaliers at the Battle of Maidstone in the Second English Civil War.",
    "July 16–19 – Thirty Years' War – Battle of Prague: The west bank of Prague (including Prague Castle) is occupied and looted by Swedish armies.",
    "August\nArabs besiege the Portuguese in Muscat.\nThe First Fronde, the Fronde Parlementaire, an insurrection, begins in France.\nThe Cambridge Platform, a new, localized system of Christian church governance, is agreed upon and written down in New England.",
    "Arabs besiege the Portuguese in Muscat.",
    "The First Fronde, the Fronde Parlementaire, an insurrection, begins in France.",
    "The Cambridge Platform, a new, localized system of Christian church governance, is agreed upon and written down in New England.",
    "August 8 – Mehmed IV (1648–1687) succeeds Ibrahim I (1640–1648), as Ottoman Emperor.",
    "August 20 – Battle of Lens: The French under the Prince of Condé defeat the Spaniards.",
    "September 12 – Battle of Stirling in Scotland: \"Engagers\" achieve victory over the Kirk Party.",
    "October 24 – Signing of the Treaties of Münster and Osnabrück conclude the Peace of Westphalia, ending the Thirty Years' War. Rulers of the Imperial States can personally convert to Protestant, Catholic or Calvinist. Ecclesiastical property is restored to the status of 1624, with the minorities of each of the three recognized faiths granted toleration of worship, and there is general recognition of exclusive sovereignty, including that of the Dutch Republic and Switzerland. France and Sweden gain territory, and the latter is granted an indemnity. However, France remains at war with Spain until 1659.",
    "October 31 – A treaty is signed between the Arabs and the Portuguese. The terms include a provision that the Portuguese should build fortresses at Kuriyat, Dibba Al-Hisn (Sharjah) and Muttrah (Oman).[4]",
    "November 11 – France and the Netherlands agree to divide the Caribbean island of Saint Martin between them.",
    "December 11 – \"Pride's Purge\" in England: Elements of the New Model Army, under the leadership of Oliver Cromwell invade London and expel a majority of the Long Parliament, resulting in the creation of the Rump Parliament.",
    "In India, building of the Red Fort in Shahjahanabad is completed.",
    "The epic poem Padmavati is written by Alaol.[5]",
    "Sabbatai Zevi declares himself the Messiah at Smyrna.",
    "George Fox founds the Religious Society of Friends (Quakers) in England.[6]",
    "The Dutch artist Rembrandt produces the works Rembrandt drawing at a window and Beggars at the Door.[7][8]",
    "Giacomo Carissimi composes Historia di Jephte, one of the first significant Latin oratorios.[9]"
  ],
  "births": [
    "January 1 – Matthijs Wulfraet, Dutch painter (d. 1727)",
    "January 14 – Clara Elisabeth von Platen, German noblewoman (d. 1700)",
    "February 1 – Elkanah Settle, English poet and playwright (d. 1724)",
    "February 23 – Arabella Churchill, English mistress of James II of England (d. 1730)",
    "February 26 – George Albert II, Count of Erbach-Fürstenau, held the fiefs of Fürstenau (d. 1717)",
    "March 2 – John Hales, English politician (d. 1723)",
    "March 5 – David Caspari, German Lutheran theologian (d. 1702)",
    "March 7 – Charles-Amador Martin, Canadian Catholic priest (d. 1711)",
    "March 12 – Charles de Sévigné, French baron (d. 1713)",
    "March 13 – Anne Henriette of Bavaria, Duchess of Guise (d. 1723)",
    "March 31 – Sebastiaen van Aken, Flemish painter (d. 1722)",
    "April 4 – Grinling Gibbons, Dutch-British sculptor and wood carver known for his work in England (d. 1721)",
    "April 5 – Nicolas Pasquin, early pioneer in New France (now Quebec) (d. 1708)",
    "April 7 – John Sheffield, 1st Duke of Buckingham and Normanby, English statesman and poet (d. 1721)",
    "April 8 – Charles, Count of Marsan, French noble (d. 1708)",
    "April 9 – Henri de Massue, Marquis de Ruvigny, 1st Earl of Galway, French soldier and diplomat (d. 1720)",
    "April 13 – Jeanne Marie Bouvier de la Motte Guyon, French mystic (d. 1717)",
    "April 16 – Antoine de Pas de Feuquières, French soldier (d. 1711)",
    "April 20 – Maurice Bocland, English Member of Parliament (d. 1710)",
    "April 23 – Philip Verheyen, Flemish physician (d. 1710)",
    "April 26 – King Peter II of Portugal (d. 1706)",
    "May 12 – Philip Foley, English politician (d. 1716)",
    "May 14 – René de Froulay de Tessé, French Marshal and diplomat (d. 1725)",
    "May 15 – William, Landgrave of Hesse-Rotenburg (from 1683) (d. 1725)",
    "May 23 – Johan Teyler, Dutch painter (d. 1709)",
    "May 24 – Albert V, Duke of Saxe-Coburg (d. 1699)",
    "June 18 – Petrus Houttuyn, Dutch botanist (d. 1709)",
    "July 2 – Arp Schnitger, German organ builder (d. 1719)",
    "July 19 – Jakub Kresa, Czech mathematician (d. 1715)",
    "July 21 – John Graham, 1st Viscount Dundee, Scottish general (d. 1689)",
    "July 25 – Joseph Anthelmi, French ecclesiastical historian (d. 1697)",
    "July 30 – Anne Marie Thérèse de Lorraine, Abbess of Remiremont (d. 1661)",
    "August 5 – Guichard Joseph Duverney, French anatomist (d. 1730)",
    "August 9 – Johann Michael Bach, German composer (d. 1694)",
    "August 11 – Jeremiah Shepard, American Puritan minister and the youngest son of Thomas Shepard (d. 1720)",
    "August 14 – Alphonse Henri, Count of Harcourt, French noble (d. 1718)",
    "August 22\nGerard Hoet, Dutch painter (d. 1733)\nTsarevich Dmitry Alexeyevich of Russia, first son and heir of Tsar Alexis of Russia (d. 1649)",
    "Gerard Hoet, Dutch painter (d. 1733)",
    "Tsarevich Dmitry Alexeyevich of Russia, first son and heir of Tsar Alexis of Russia (d. 1649)",
    "August 30 – Jean-Baptiste Morvan de Bellegarde, French Jesuit (d. 1734)",
    "September 2 – Magdalena Sibylle of Saxe-Weissenfels, German noblewoman (d. 1681)",
    "September 3 – Sarah Cloyce, American accused of witchcraft (d. 1703)",
    "September 6 – Johann Schelle, German composer (d. 1701)",
    "September 10 – Nicolas Desmarets, Controller-General of Finances under Louis XIV of France (d. 1721)",
    "September 14\nLouis Nicolas le Tonnelier de Breteuil, French noble (d. 1728)\nCaspar Neumann, German professor and clergyman (d. 1715)",
    "Louis Nicolas le Tonnelier de Breteuil, French noble (d. 1728)",
    "Caspar Neumann, German professor and clergyman (d. 1715)",
    "September 24 – Richard Graham, 1st Viscount Preston, English politician (d. 1695)",
    "September 27\nCharles Gustav of Baden-Durlach, German general (d. 1703)\nMichelangelo Tamburini, Italian Jesuit Superior General (d. 1730)",
    "Charles Gustav of Baden-Durlach, German general (d. 1703)",
    "Michelangelo Tamburini, Italian Jesuit Superior General (d. 1730)",
    "October 3 – Élisabeth Sophie Chéron, French musician (d. 1711)",
    "October 6 – Henrietta Catharina, Baroness von Gersdorff, German noblewoman; poet (d. 1726)",
    "October 13 – Françoise Madeleine d'Orléans, French princess (d. 1664)",
    "October 19 – Domenico Viva, Italian Jesuit theologian (d. 1726)",
    "October 22 – Aleijda Wolfsen, Dutch Golden Age painter (d. 1692)",
    "October 29 – John Verelst, Dutch Golden Age painter (d. 1734)",
    "November 12\nLouis-Hector de Callière, French politician (d. 1703)\nJuana Inés de la Cruz, Mexican Hieronymite nun and polymath (d. 1695)",
    "Louis-Hector de Callière, French politician (d. 1703)",
    "Juana Inés de la Cruz, Mexican Hieronymite nun and polymath (d. 1695)",
    "November 15 – Juan María de Salvatierra, Italian Jesuit priest and missionary (d. 1717)",
    "November 16 – Charles Duncombe, English banker and politician (d. 1711)",
    "November 24 – Humphrey Humphreys, British bishop (d. 1712)",
    "November 27 – Petrus Codde, Dutch cleric, first Old Catholic bishop (d. 1710)",
    "December 5 – Charles François d'Angennes, Marquis de Maintenon, French nobleman, Caribbean buccaneer (d. 1691)",
    "December 6 – Leonard Goffiné, German Catholic priest and writer (d. 1719)",
    "December 15 – Gregory King, English statistician (d. 1712)",
    "December 20 – Tommaso Ceva, Italian Jesuit mathematician from Milan (d. 1737)",
    "December 23 – Robert Barclay, Scottish Quaker (d. 1690)",
    "John Coode, Colonial governor of Maryland (d. 1709)",
    "Lionel Copley, colonial governor of Maryland (d. 1693)",
    "Anne de Rohan-Chabot, short-term mistress of Louis XIV of France (d. 1709)",
    "Kong Shangren, Qing Chinese dramatist and poet (d. 1718)."
  ],
  "deaths": [
    "January 14 – Caspar Barlaeus, Dutch polymath (b. 1584)",
    "January 15 – St. Francisco Fernandez de Capillas, Spanish saint (b. 1607)",
    "January 20 – Countess Palatine Magdalene Catherine of Zweibrücken and Duchess of Birkenfeld (b. 1607)",
    "January 23 – Francisco de Rojas Zorrilla, Spanish dramatist (b. 1607)",
    "January 29 – Francesco Palliola, Italian Servant of God (b. 1612)",
    "February 22 – Wilhelm Lamormaini, Luxembourgian theologian (b. 1570)",
    "February 28 – Christian IV, King of Denmark and Norway (b. 1577)",
    "March 4 – Nicholas Stoughton, English politician (b. 1592)",
    "March 7 – Catherine of Lorraine, Abbess of Remiremont (b. 1573)",
    "March 12 – Tirso de Molina, Spanish writer (b. 1571)",
    "March 14 – Ferdinando Fairfax, 2nd Lord Fairfax of Cameron, English general (b. 1584)",
    "March 22 – Sir Edward Hussey, 1st Baronet, English politician (b. 1585)",
    "April 7 – Robert Roberthin, German poet (b. 1600)",
    "April 12 – Countess Catharina Belgica of Nassau, regent of Hanau-Münzenberg (b. 1578)",
    "April 29 – John Forbes, Scottish theologian (b. 1593)",
    "May 17 – Peter Melander Graf von Holzappel, Protestant military leader (b. 1589)",
    "May 20 – King Władysław IV Vasa of Poland (b. 1595)",
    "May 26 – Vincent Voiture, French poet (b. 1597)",
    "June 4 – George Seton, Lord Seton, Scottish noble (b. 1613)",
    "July 4 – Antoine Daniel, Jesuit missionary at Sainte-Marie among the Hurons (b. 1601)",
    "July 31 – Noël Juchereau, Quebec pioneer (b. 1593)",
    "August 2 – Claude Françoise de Lorraine, Princess of Lorraine (b. 1612)",
    "August 5 – Ivan III Drašković, Croatian nobleman and soldier (b. 1603)",
    "August 12 – Peter Sainthill, English politician (b. 1593)",
    "August 18 – Ibrahim, Ottoman Sultan (b. 1615)",
    "August 20 – Edward Herbert, 1st Baron Herbert of Cherbury, English diplomat, poet, and philosopher (b. 1583)",
    "August 24 – Juan Damián López de Haro, Spanish Catholic bishop of Puerto Rico (b. 1581)",
    "August 25 – Joseph Calasanz, Spanish priest and founder of Piarists (b. 1557)",
    "August 31 – Michele Mazzarino, Italian Catholic cardinal (b. 1605)",
    "September 1 – Marin Mersenne, French mathematician (b. 1588)",
    "October 11 – George I Rákóczi, Hungarian prince of Transylvania (b. 1593)",
    "October 15 – Simone Cantarini, Italian painter and engraver (b. 1612)",
    "November 1 – Ulrich II, Count of East Frisia, ruler of East Frisia (b. 1605)",
    "November 17 – Thomas Ford, English composer (b. c. 1580)",
    "November 25 – Daišan, Manchu politician (b. 1583)",
    "November 27 – Squire Bence, English politician (b. 1597)",
    "December 10 – Frederick IV, Duke of Brunswick-Lüneburg (b. 1574)",
    "December 17 – George Gillespie, Scottish theologian (b. 1613)",
    "December 25 – Claudia de' Medici (b. 1604)",
    "date unknown – Emerentia Krakow, Swedish war heroine\nCvijeta Zuzorić, Croatian poet (b. 1552)",
    "Cvijeta Zuzorić, Croatian poet (b. 1552)"
  ]
}