{
  "events": [
    "January 1 – Charles II is crowned King of Scots at Scone (his first crowning).",
    "January 24 – Parliament of Boroa in Chile: Spanish and Mapuche authorities meet at Boroa, renewing the fragile peace established at the parliaments of Quillín, in 1641 and 1647.[1][2]",
    "February 22 – St. Peter's Flood: A first storm tide in the North Sea strikes the coast of Germany, drowning thousands. The island of Juist is split in half, and the western half of Buise is probably washed away.",
    "March 4–5 – St. Peter's Flood: Another storm tide in the North Sea strikes the Netherlands, flooding Amsterdam.",
    "March 6 – The town of Kajaani was founded by Count Per Brahe the Younger.[3]",
    "March 26 – Silver-loaded Spanish ship San José is pushed south by strong winds, subsequently it wrecks in the coast of southern Chile and its surviving crew is killed by indigenous Cuncos.[4][5]",
    "April – Thomas Hobbes publishes his magnum opus, the political tract Leviathan, in England.",
    "June 17 – Franco-Spanish War (1635-1659); A squadron of Spanish galleys under John of Austria the Younger capture the French galleon Lion Couronné off Formentera, Balearic Islands, Spain.",
    "June 28–30 – Battle of Berestechko, Ukraine: The Polish–Lithuanian Commonwealth Army defeats the Zaporozhian Cossacks in one of the biggest land battles of the century, with some 205,000 troops in the field.",
    "July 20 – Battle of Inverkeithing in Scotland: The English Parliamentarian New Model Army, under Major-General John Lambert, defeats a Scottish Covenanter army acting on behalf of Charles II, led by Sir John Brown of Fordell.",
    "September 1 – Siege of Dundee ends with the English Parliamentarian army, under General Monck, decisively defeating Covenanters in the last battle of the Wars of the Three Kingdoms in Scotland.",
    "September 2 - Assassination of Kösem Sultan by her daughter-in-law, Turhan Sultan.",
    "September 3 – English Civil War: Charles II of England, leading a largely-Scottish army, is defeated in the Battle of Worcester, the last major battle of the war, and forced to flee.",
    "October – An English diplomatic team, headed by Oliver St John, goes to The Hague to negotiate an alliance between the Commonwealth of England and the Dutch Republic.",
    "October 14 – Laws are passed in Massachusetts, forbidding poor people from adopting excessive styles of dress.",
    "October 15–16 – Escape of Charles II from England to France.[6]",
    "December 17 – Castle Cornet in Guernsey, the last stronghold which had supported the King in the Third English Civil War, surrenders.",
    "The Keian Uprising fails in Japan.",
    "The first coffee house in England is opened in Oxford,[6] indicative of their increasing popularity in Europe.",
    "The Madanmohan-jiu Temple is built at Samta (India), a village in the Howrah district of West Bengal."
  ],
  "births": [
    "January 9 – Petronio Franceschini, Italian Baroque composer (d. 1680)",
    "January 18 – William Coddington, Jr., Rhode Island colonial governor (d. 1689)",
    "January 19 – Johannes Wolfgang von Bodman, German bishop (d. 1691)",
    "January 20 – Edward Tyson, British scientist (d. 1708)",
    "February 2 or 1950 – William Phips, first royal governor of the Province of Massachusetts Bay (d. 1695)",
    "February 9 – Procopio Cutò, French entrepreneur (d. 1727)",
    "February 11 – Sir Ralph Assheton, 2nd Baronet, of Middleton, English politician (d. 1716)",
    "February 11 – Anne Scott, 1st Duchess of Buccleuch, wealthy Scottish peeress (d. 1732)",
    "February 21 – Silvius II Frederick, Duke of Württemberg-Oels (d. 1697)",
    "February 25 – Quirinus Kuhlmann, German Baroque poet and mystic (d. 1689)",
    "February 26 – Pieter van der Hulst, Dutch painter (d. 1727)",
    "March 2 – Carlo Gimach, Maltese architect, engineer and poet (d. 1730)",
    "March 4 – John Somers, 1st Baron Somers, Lord Chancellor of England (d. 1716)",
    "March 31 – Karl II, Elector Palatine of Germany (d. 1685)",
    "April 2 – Fabrizio Paolucci, Italian Catholic cardinal (d. 1726)",
    "April 6 – André Dacier, French classical scholar (d. 1722)",
    "April 10 – Ehrenfried Walther von Tschirnhaus, German mathematician (d. 1708)",
    "April 17 – Giuseppe Archinto, Italian cardinal, Archbishop of Milan (d. 1712)",
    "April 21 – Blessed Joseph Vaz, Apostle of Ceylon (d. 1711)",
    "April 30 – Jean-Baptiste de la Salle, French educational reformer (d. 1719)",
    "May 17 – Jacques Gravier, French Jesuit missionary in the New World (d. 1708)",
    "May 27 – Louis-Antoine, Cardinal de Noailles, French bishop (d. 1729)",
    "June 6 – Willem van Ingen, Dutch painter (d. 1708)",
    "June 10 – Alexander Edward, Scottish landscape architect (d. 1708)",
    "June 21 – William VII, Landgrave of Hesse-Kassel (d. 1670)",
    "July 4 – Honoratus a Sancta Maria, French Discalced Carmelite (d. 1729)",
    "July 12 – Margaret Theresa of Spain (d. 1673)",
    "July 22 – Ferdinand Tobias Richter, Austrian Baroque composer (d. 1711)",
    "July 26 – Jacques Bigot (Jesuit), French Jesuit priest, missionary to the Abenakis in Canada (d. 1711)",
    "August 6 – François Fénelon, Archbishop of Cambrai, France (d. 1715)",
    "August 6 – Carl Gustav Rehnskiöld, Swedish Field Marshal (d. 1722)",
    "August 13 – Balthasar Permoser, German sculptor (d. 1732)",
    "August 25 – François Baert, Jesuit hagiographer (d. 1719)",
    "September 1 – Nataliya Kyrillovna Naryshkina, Tsaritsa of Russia (d. 1694)",
    "September 2 – Zubdat-un-Nissa, Mughal princess, daughter of Emperor Aurangzeb (d. 1707)",
    "September 5 – William Dampier, English explorer (d. 1715)",
    "September 6 – Aoyama Tadao, Japanese daimyō (d. 1685)",
    "September 16 – Engelbert Kaempfer, German physician and traveler (d. 1716)",
    "September 26 – Francis Daniel Pastorius, German founder of Germantown, Pennsylvania (d. 1720)",
    "October 24 – Jean de La Chapelle, French writer and dramatist (d. 1723)",
    "October 26 – Perizonius, Dutch linguist (d. 1715)",
    "November 1 – Jean-Baptiste Colbert, Marquis de Seignelay, French politician (d. 1690)",
    "November 12 – Juana Inés de la Cruz, Mexican nun, writer and poet (d. 1695)",
    "December 25 – Pedro Manuel Colón de Portugal (d. 1710)",
    "December 28 – Johann Krieger, German composer and organist (d. 1735)",
    "date unknown – Gorgin Khan, Persian Governor of Kandahar (d. 1709)"
  ],
  "deaths": [
    "January – Thomas Greene, Colonial governor of Maryland (b. 1609)",
    "January 22 – Johannes Phocylides Holwarda, Dutch astronomer (b. 1618)",
    "January 29 – Diego de Colmenares, Spanish historian (b. 1586)",
    "February 6 – Erdmann August of Brandenburg-Bayreuth, Hereditary Margrave (b. 1615)",
    "February 8 – Richard Newport, 1st Baron Newport, English politician (b. 1587)",
    "February 9 – Herman Krefting, Norwegian businessman (b. 1592)",
    "March 11 – Alvise Contarini, Italian diplomat, nobleman (b. 1597)",
    "April 1 – John of Hesse-Braubach, German general (b. 1609)",
    "April 7 – Lennart Torstensson, Swedish Field Marshal, Privy Councillour and Governor-General (b. 1603)",
    "April 10 – Sir William Airmine, 1st Baronet, English politician (b. 1593)",
    "May 16 – Sophie of Solms-Laubach, wife of Joachim Ernst, Margrave of Brandenburg-Ansbach (b. 1594)",
    "May 26 – Jeane Gardiner, British woman executed for witchcraft in Bermuda",
    "May 28 – Henry Grey, 10th Earl of Kent (b. 1594)",
    "June 8 – Tokugawa Iemitsu, Japanese shōgun (b. 1604)",
    "June 16 – Francisco Cuervo y Valdés, Spanish colonial governor (d. 1714)",
    "June 17\nRoger North, English politician (b. 1577)\nFrancesco Piccolomini, Italian Jesuit (b. 1582)",
    "Roger North, English politician (b. 1577)",
    "Francesco Piccolomini, Italian Jesuit (b. 1582)",
    "July 7 – Dina Vinhofvers, Danish alleged conspirator (b. 1620)",
    "August 1 – Maria Anna Vasa, Polish princess (b. 1650)",
    "August 2 – Ercole, Marquis of Baux, member of the House of Grimaldi (b. 1623)",
    "August 8 – Countess Amalie Elisabeth of Hanau-Münzenberg, regent of Hesse-Kassel (d. 1602)",
    "August 16 – Filippo Benedetto de Sio, Italian  Catholic prelate and bishop (b. 1585)",
    "August 20 – Jeremi Wiśniowiecki, Polish nobleman (b. 1612)",
    "September 3\nKösem Sultan, regent of the Ottoman Empire (b. c. 1590)\nWilliam Widdrington, 1st Baron Widdrington, English landowner, politician (b. 1610)",
    "Kösem Sultan, regent of the Ottoman Empire (b. c. 1590)",
    "William Widdrington, 1st Baron Widdrington, English landowner, politician (b. 1610)",
    "September 10 – Yui Shōsetsu (b. 1605), Japanese rebel",
    "September 12\nFélix Castello, Spanish artist (b. 1595)\nWilliam Hamilton, 2nd Duke of Hamilton, Scottish nobleman (b. 1616)",
    "Félix Castello, Spanish artist (b. 1595)",
    "William Hamilton, 2nd Duke of Hamilton, Scottish nobleman (b. 1616)",
    "September 18 – Henriette Marie of the Palatinate, German noble (b. 1626)",
    "September 24\nÉtienne Pascal, French mathematician (b. 1588)\nMarubashi Chūya, Japanese rebel",
    "Étienne Pascal, French mathematician (b. 1588)",
    "Marubashi Chūya, Japanese rebel",
    "September 27 – Maximilian I, Elector of Bavaria (b. 1573)",
    "October 4 – Ludwig Camerarius, German politician (b. 1573)",
    "October 6 – Heinrich Albert, German composer and poet (b. 1604)",
    "October 7 – Jacques Sirmond, French Jesuit scholar (b. 1559)",
    "October 8\nIsaac Elzevir, Dutch printer and publisher (b. 1596)\nAnna Catherine Constance Vasa, Polish princess, daughter of King Sigismund III Vasa (b. 1619)",
    "Isaac Elzevir, Dutch printer and publisher (b. 1596)",
    "Anna Catherine Constance Vasa, Polish princess, daughter of King Sigismund III Vasa (b. 1619)",
    "October 10 – Philippus Rovenius, Dutch priest (b. 1573)",
    "October 15 – James Stanley, 7th Earl of Derby (b. 1607)",
    "October 25 – Saint Job of Pochayiv, Ukrainian Orthodox Christian saint (b. 1551)",
    "November 20 – Mikołaj Potocki, Polish soldier (b. 1595)",
    "November 22 – Francis Scott, 2nd Earl of Buccleuch, son of Walter Scott (b. 1626)",
    "November 26 – Henry Ireton, English Civil War leader (b. 1611)",
    "December 14 – Pierre Dupuy, French scholar (b. 1582)",
    "December 15 – Virginia Centurione Bracelli, Italian saint (b. 1587)",
    "November 18 – Anna Amalia of Baden-Durlach, Regent of Nassau-Saarbrücken (b. 1595)",
    "December 18 – William Brabazon, 1st Earl of Meath (b. 1580)",
    "date unknown\nEva Bacharach, Bohemian Hebraist (b. 1580)\nGiulia Tofana, Italian poisoner (b. 1581)\nAngélique Paulet, French salonnière, singer, musician and actress (b. 1592)\nHelena Czaplińska, Ukrainian Hetmana",
    "Eva Bacharach, Bohemian Hebraist (b. 1580)",
    "Giulia Tofana, Italian poisoner (b. 1581)",
    "Angélique Paulet, French salonnière, singer, musician and actress (b. 1592)",
    "Helena Czaplińska, Ukrainian Hetmana"
  ]
}