{
  "events": [
    "January 17 – The Chair of Saint Peter (Cathedra Petri, designed by Bernini) is set above the altar in St. Peter's Basilica in Rome.[1]",
    "February 1 – The joint English and Scottish royal court returns to London, as the Great Plague of London subsides.[2]",
    "March 11 – The tower of St. Peter's Church, Riga, collapses, burying eight people in the rubble.",
    "June 4 – Molière's comedy The Misanthrope is premièred at the Théâtre du Palais-Royal in Paris, by the King's Players.[3]",
    "June 11–14 (June 1–4 Julian calendar) – Second Anglo-Dutch War: Four Days' Battle – The Dutch Republic fleet under Michiel de Ruyter defeats that of the Kingdom of England in the North Sea, in one of the longest naval engagements in history.[2]",
    "July – The town of Piteå, Sweden is completely burned by a large fire.",
    "August 4 (July 25 Julian calendar) – Second Anglo-Dutch War: St. James's Day Battle – The English fleet, under Prince Rupert of the Rhine and George Monck, 1st Duke of Albemarle, defeats the Dutch off the North Foreland of England.[2]",
    "August 19–20 (August 9–10 Julian calendar) – Holmes's Bonfire: Rear Admiral Robert Holmes leads an English raid on the Dutch island of Terschelling, destroying 150 merchant ships in the Vlie estuary, and pillaging the town of West-Terschelling.",
    "September 2–5 – Great Fire of London: A large fire breaks out in the City of London, in the house of a baker on Pudding Lane, near London Bridge. The fire destroys more than 13,000 buildings (including Old St Paul's Cathedral), but only six people are known to have died,[4] while at least 80,000[5] are left destitute and homeless. The resurveying of property is credited with giving both cartography and the practices of surveying a leg up, as well as resulting in the modern definition by John Ogilby of the statute mile, as 1,760 yards.[6]",
    "September 6 – The Cestui que Vie Act 1666 is passed by the Parliament of England, to provide for disposal of the property of missing persons.",
    "September 7 – Samuel Pepys describes the aftermath (two days prior) of the Great Fire of London in his diary, and details the city in ruins.",
    "September 16 – Apostasy of Sabbatai Zevi in Istanbul.",
    "November 28 – Pentland Rising: Battle of Rullion Green in the Pentland Hills of Midlothian (Scotland), culmination of the brief rising which began on November 15: at least 3,000 men of the Scottish Royal Army, led by Tam Dalyell of the Binns, defeat about 900 rebel Covenanters.",
    "December 12 – A sobor (church council) of the Russian Orthodox Church deposes Patriarch Nikon of Moscow, but accepts his liturgical reforms. Dissenters from his reforms, known as Old Believers, continue to this day.",
    "December 22 – The French Academy of Sciences, founded by Louis XIV, first meets.[7]",
    "Mughal forces of Emperor Aurangzeb, in alliance with the Portuguese, under Shaista Khan and his son Buzurg Umed Khan, expel the Arakans from the Bengal port city of Chittagong, renaming the city as Islamabad.",
    "Moulai al-Rashid conquers Fes, marking the beginning of Morocco's Alaouite dynasty, which will continue in power into the 21st century.",
    "Isaac Newton uses a prism to split sunlight into the component colours of the optical spectrum, assisting understanding of the scientific nature of light. He also develops differential calculus. His discoveries this year lead to it being referred to as his Annus mirabilis or Newton's Year of the Morning Star.",
    "Lund University is founded in Lund, Sweden.[8]",
    "Dutch artist Johannes Vermeer paints The Art of Painting, his largest and most complex work.",
    "The first completed printed Bible translation into Armenian, Astuacašunč hnoc' ew noroc' ktakaranac (Oskanean Bible), is published in Amsterdam, edited by Bishop Oskan Yerevantsi.[9]",
    "Jean Talon completes a census of New France, the first census in North America.",
    "House of Commons of England seek to prosecute Thomas Hobbes for blasphemy contained in his treatise Leviathan"
  ],
  "births": [
    "February 1 – Marie Thérèse de Bourbon, Princess of Conti and titular queen of Poland (d. 1732)",
    "February 9 – George Hamilton, 1st Earl of Orkney, British soldier (d. 1737)",
    "March 15 – George Bähr, German architect (d. 1738)",
    "May 14 – Victor Amadeus II of Sardinia (d. 1732)",
    "July 10 – John Ernest Grabe, German-born Anglican theologian (d. 1711)",
    "July 23 – Thomas Parker, 1st Earl of Macclesfield (d. 1732)",
    "August 4 – Maria Sophia of Neuburg, Queen consort of Portugal (d. 1699)",
    "August 13 – William Wotton, English scholar (d. 1727)",
    "September 5 – Gottfried Arnold, German church historian (d. 1714)",
    "September 6 – Tsar Ivan V of Russia (d. 1696)[10]",
    "November 12 – Mary Astell, English feminist writer (d. 1731)",
    "December 22 – Guru Gobind Singh, 10th Guru of Sikhism, social reformist, poet, and revolutionary (d. 1708)",
    "date unknown –\nArthur Chichester, 3rd Earl of Donegall (d. 1706)\nMary Pix, English author (d. 1709)[11]",
    "Arthur Chichester, 3rd Earl of Donegall (d. 1706)",
    "Mary Pix, English author (d. 1709)[11]"
  ],
  "deaths": [
    "January 2 – John Holles, 2nd Earl of Clare, English politician and Earl (b. 1595)",
    "January 10 – Henry Hastings, 1st Baron Loughborough, English Royalist army commander (b. 1610)",
    "January 20 – Anne of Austria, queen of Louis XIII of France and regent (b. 1601)[12]",
    "January 22 – Shah Jahan, Mughal Emperor of India (b. 1592)[13]",
    "January 24 – Johann Andreas Herbst, German composer (b. 1588)",
    "January 28 – Tommaso Dingli, Maltese architect and sculptor (b. 1591)",
    "February 12 – Mildmay Fane, 2nd Earl of Westmorland, English politician (b. 1602)",
    "February 24 – Nicholas Lanier, English composer (b. 1588)",
    "February 26 – Armand de Bourbon, Prince of Conti, Frondeur (b. 1629)",
    "February 27\nLuisa de Guzmán, Duchess of Braganza and Queen consort of Portugal (b. 1613)\nGustav Evertsson Horn, Finnish-Swedish politician, Field Marshal (b. 1614)",
    "Luisa de Guzmán, Duchess of Braganza and Queen consort of Portugal (b. 1613)",
    "Gustav Evertsson Horn, Finnish-Swedish politician, Field Marshal (b. 1614)",
    "March 1 – Ecaterina Cercheza, Princess consort of Moldavia (b. 1620)",
    "March 18 – Jan van Vliet, Dutch linguist (b. 1622)",
    "April 12 – Johann Rudolf Wettstein, Swiss diplomat (b. 1594)",
    "April 25 – Johann Reinhard II, Count of Hanau-Lichtenberg, German aristocrat (b. 1628)",
    "May 6 – Paul Siefert, German composer and organist (b. 1586)",
    "May 13 – Pier Francesco Mola, Italian painter of the High Baroque (b. 1612)",
    "May 22 – Gaspar Schott, German Jesuit scholar (b. 1608)",
    "June 11 – Cornelis Evertsen the Elder, Dutch admiral (b. 1610)",
    "June 12 – Abraham van der Hulst, Dutch admiral (b. 1619)",
    "June 16 – Sir Richard Fanshawe,  British diplomat and translator (b. 1608)",
    "June 17 – Carlo de' Medici, Italian Catholic cardinal (b. 1595)",
    "June 28 – Sir Gervase Clifton, 1st Baronet, English politician (b. 1587)",
    "June 30 – Alexander Brome, English poet (b. 1620)",
    "July 5 – Albert VI, Duke of Bavaria (b. 1584)",
    "July 18 – Sir John Bowyer, 1st Baronet, English soldier and politician (b. 1623)",
    "July 25 – Henri, Count of Harcourt (b. 1601)",
    "July 26 – Camillo Francesco Maria Pamphili, Italian Catholic cardinal (b. 1622)",
    "July 30 – Francis Erdmann, Duke of Saxe-Lauenburg, Germany (b. 1629)",
    "August 5 – Johan Evertsen, Dutch admiral (b. 1600)",
    "August 6 – Tjerk Hiddes de Vries, Frisian naval hero and commander (of wounds received in the St. James's Day Battle) (b. 1622)",
    "August 15 – Johann Adam Schall von Bell, German Jesuit missionary (b. 1591)",
    "August 19 – Anton Günther I, Count of Schwarzburg-Sondershausen (b. 1620)",
    "August 23 – Johannes Hoornbeek, Dutch theologian (b. 1617)",
    "August 24 – Francisco Manuel de Mello, Portuguese writer (b. 1608)",
    "August 26 – Frans Hals, Dutch painter (b. 1580)[14]",
    "September 4 – Girolamo Colonna, Catholic cardinal (b. 1604)",
    "September 10 – Christian Günther II, Count of Schwarzburg-Sondershausen-Arnstadt (b. 1616)",
    "September 17 – Augustus the Younger, Duke of Brunswick-Lüneburg (b. 1579)",
    "September 23 – François Mansart, French architect (b. 1598)",
    "September 27\nGeorg Albrecht, Margrave of Brandenburg-Bayreuth-Kulmbach (b. 1619)\nJános Szalárdi, Hungarian historian (b. 1601)",
    "Georg Albrecht, Margrave of Brandenburg-Bayreuth-Kulmbach (b. 1619)",
    "János Szalárdi, Hungarian historian (b. 1601)",
    "October 12 – Dirk Graswinckel, Dutch jurist (b. 1600)",
    "October 27 – Manuel António of Portugal, Dutch-Portuguese nobleman (b. 1600)",
    "October 29 – Edmund Calamy the Elder, English Presbyterian leader (b. 1600)",
    "October 29 – James Shirley, English dramatist (b. 1596)",
    "November 1 – Jan Albertsz Rotius, Dutch painter (b. 1624)",
    "December 1 – James Ware, Irish genealogist (b. 1594)",
    "December 8 – Philippe Charles, Duke of Valois (b. 1664)",
    "December 20 – William Strode, English politician (b. 1589)",
    "December 22 – Guercino, Italian painter (b. 1591)[15]",
    "December 26 – Alexandrine von Taxis, German Imperial General Post Master (b. 1589)",
    "December 30 – John Strangways, English politician (b. 1585)",
    "date unknown\nPhilip Fruytiers, Flemish painter (b. 1627)\nJames Howell, British writer (b. c. 1594)\nSong Yingxing, Chinese encyclopedist (b. 1587)",
    "Philip Fruytiers, Flemish painter (b. 1627)",
    "James Howell, British writer (b. c. 1594)",
    "Song Yingxing, Chinese encyclopedist (b. 1587)"
  ]
}