{
  "events": [
    "January 23 – The Triple Alliance of 1668 is formed between England, Sweden and the United Provinces of the Netherlands.",
    "February 13 – In Lisbon, a peace treaty is established between Afonso VI of Portugal and Carlos II of Spain, by mediation of Charles II of England, in which the legitimacy of the Portuguese monarch is recognized. Portugal yields Ceuta to Spain.",
    "March 8 – In the Cretan War, the navy of the Republic of Venice defeats an Ottoman Empire naval force of 12 ships and 2,000 galleys that had attempted to seize a small Venetian galley near the port of Agia Pelagia.",
    "March 23 – The Bawdy House Riots of 1668 take place in London when a group of English Dissenters begins attacking brothels, initially as a protest against the harsh enforcement of laws against private worshipers and the lack of enforcement of laws against prostitution.  Over a period of three days, rioters who join in the violence destroy brothels in the London districts of Poplar,  Moorfields, East Smithfield, St Leonard's, Shoreditch, St Andrew's and Holborn.",
    "March 27 – King Charles II of England signs an agreement with representatives of the English East India Company to lease the Indian city of Bombay (now Mumbai) to the company for a rent of 10 pounds sterling per year, with transfer taking effect on September 21.",
    "April 21 – The Henry Brouncker is expelled from the English House of Commons for treason during the 1665 Battle of Lowestoft during the Second Anglo-Dutch War.",
    "April 22 – Tenzin Dalai Khan is proclaimed as the new Protector King of Tibet by the 5th Dalai Lama, following the death of Tenzin's father, Dayan Khan.",
    "April 24 – The Treaty of Breda, signed in 1667 and ending the Second Anglo-Dutch War, goes into effect worldwide.",
    "April 25 – The Swedish Empire signs a treaty with England and the Dutch Republic to join the Triple Alliance.",
    "May 2 – The first Treaty of Aix-la-Chapelle ends the War of Devolution.",
    "May 18 – Charles Sedley's comedy The Mulberry-Garden premieres at the Theatre Royal in London.",
    "June 4 – Tangier, a city in Morocco that had come under control of the English colonial empire in 1661, is elevated by the English crown to the status of \"free city\".",
    "June 12 – John Dryden's play An Evening's Love, or The Mock Astrologer premieres at the Theatre Royal in London in a performance by the King's Company players for King Charles and Queen Catherine.",
    "June 16 – A group of Spanish Jesuit missionaries become the first European settlers to arrive at the island of Guam, founding a mission to convert the Chamorro people of the Mariana Islands to Christianity.",
    "June 18 – Petro Doroshenko is proclaimed by the Russian Empire as the hetman of all of Ukraine, after having previously been granted leadership of the western half. Ivan Briukhovetsky, who had ruled the eastern half and then led an uprising, is executed on the same day.",
    "July 7 – Bishop Isaac Barrow founds the Bishop Barrow Trust with the intention of establishing a university on the Isle of Man; this becomes King William's College.[1]",
    "July – Welsh privateer Henry Morgan sacks Portobello and Panama City; the lack of booty from the latter attack leads to the city being burned.",
    "July 25 – The magnitude 8.5 Shandong earthquake causes 43,000 to 50,000 deaths in Shandong during the Qing Dynasty, making it the largest historical earthquake in Eastern China.[2][3]",
    "August 17 – The magnitude 8.0 North Anatolia earthquake causes 8,000 deaths in northern Anatolia, Ottoman Empire, and is the most powerful earthquake recorded in Turkey.[4][5]",
    "September 9 – Molière's comedy The Miser (L'Avare) is first performed, in Paris.",
    "September 21 – The British East India Company takes over Bombay under a Royal Charter of March 27.",
    "One of the world's earliest central banks, the Sveriges Riksbank, is founded in Stockholm, Sweden.",
    "Emperor Yohannes I of Ethiopia convenes a church council in Gondar, which decides to expel all Roman Catholics from the country.",
    "English scientist Isaac Newton builds the first reflecting telescope (Newton's reflector).[6]"
  ],
  "births": [
    "May 8 – Alain-René Lesage, French writer (d. 1747)",
    "June 23 – Giambattista Vico, Italian philosopher and historian (d. 1744)",
    "July 21 – Frederick Heinrich of Saxe-Zeitz-Pegau-Neustadt (d. 1713)",
    "September 8 – Giorgio Baglivi, Armenian doctor and writer (d. 1707)",
    "October 18 – John George IV, Elector of Saxony (d. 1694)",
    "October 30 – Sophia Charlotte of Hanover, sister of King George I of Great Britain (d. 1705)",
    "November 10\nLouis III, Prince of Condé (d. 1710)\nFrançois Couperin, French composer (d. 1733)",
    "Louis III, Prince of Condé (d. 1710)",
    "François Couperin, French composer (d. 1733)",
    "November 11 – Johann Albert Fabricius, German scholar (d. 1736)[7]",
    "November 27 – Henri François d'Aguesseau, Chancellor of France (d. 1751)",
    "November 30 – William August, Duke of Saxe-Eisenach (d. 1671)",
    "December 11 – Apostolo Zeno, Italian poet and journalist (d. 1750)",
    "December 31 – Herman Boerhaave, Dutch humanist and physician (d. 1738)[8]",
    "date unknown – Stokkseyrar-Dísa, Icelandic Galdrmistress (d. 1728)"
  ],
  "deaths": [
    "January 6\nLuis de Benavides Carrillo, Marquis of Caracena (b. 1608)\nMagdalene Sibylle of Saxony, Crown Princess of Denmark (b. 1617)",
    "Luis de Benavides Carrillo, Marquis of Caracena (b. 1608)",
    "Magdalene Sibylle of Saxony, Crown Princess of Denmark (b. 1617)",
    "January 14 – Arnauld de Oihenart, Basque historian and poet (b. 1592)",
    "January 31 – Hermann Busenbaum, German Jesuit theologian (b. 1600)",
    "February 2 – Antonio del Castillo y Saavedra, Spanish artist (b. 1616)",
    "February 8 – Alessandro Tiarini, Italian painter (b. 1577)",
    "February 21 – John Thurloe, English Puritan spy (b. 1616)",
    "March 16 – Francis Talbot, 11th Earl of Shrewsbury (b. 1623)",
    "April 12 – Alexander Daniell, sole proprietor of the Manor of Alverton, Cornwall (b. 1599)",
    "April 21 – Jan Boeckhorst, Flemish painter (b. c. 1604)",
    "May 1 – Frans Luycx, Flemish painter (b. 1604)",
    "May 8 – Catherine of St. Augustine, French nun and nurse of New France (b. 1632)",
    "May 9 – Otto Christoph von Sparr, German general (b. 1599)",
    "May 21 – Christoph Delphicus zu Dohna, Prussian-born Swedish soldier, diplomat (b. 1628)",
    "June 20 – Heinrich Roth, German Sanskrit scholar (b. 1620)",
    "July 26 – Hans Svane, Danish statesman (b. 1606)",
    "August 9 – Jakob Balde, German Latinist (b. 1604)[9]",
    "August 23 – Artus Quellinus the Elder, Flemish sculptor (b. 1609)",
    "August 24 – Tyman Oosdorp, Dutch brewer and magistrate of Haarlem (b. 1613)",
    "September 16\nPaolo Emilio Rondinini, Italian Bishop of Assisi (b. 1617)\nJan Miense Molenaer, Dutch painter (b. 1610)",
    "Paolo Emilio Rondinini, Italian Bishop of Assisi (b. 1617)",
    "Jan Miense Molenaer, Dutch painter (b. 1610)",
    "September 19 – Sir William Waller, English Civil War general (b. c. 1635)",
    "October 12 – Zacharias Wagenaer, secretary, painter, then merchant and administrator (Dutch East-India Company) (b. 1614)",
    "October 13\nRobert Sutton, 1st Baron Lexinton, English politician (b. 1594)\nAlgernon Percy, 10th Earl of Northumberland, English military leader (b. 1602)",
    "Robert Sutton, 1st Baron Lexinton, English politician (b. 1594)",
    "Algernon Percy, 10th Earl of Northumberland, English military leader (b. 1602)",
    "November 17 – Joseph Alleine, English non-conformist preacher (b. 1634)",
    "November 21 – Adolf William, Duke of Saxe-Eisenach (b. 1632)",
    "December 3 – William Cecil, 2nd Earl of Salisbury, English earl (b. 1591)",
    "December 14 – Charles Berkeley, 2nd Viscount Fitzhardinge, English politician (b. 1599)",
    "December 23 – Martin Bauzer, Gorizian Jesuit priest and writer (b. 1595)[10]",
    "December 24 – Wadham Wyndham, English judge (b. 1609)",
    "unknown date – Fang Weiyi, Chinese poet, calligrapher, painter and literature historian (b. 1585)[11]"
  ]
}