{
  "events": [
    "January 10 – England and the Dutch Republic sign a mutual defense treaty in order to fight against France.",
    "January 27 – The first fire engine company (in what will become the United States) goes into service.",
    "February 18 – The first part of English nonconformist preacher John Bunyan's Christian allegory, The Pilgrim's Progress, is published in London.",
    "March 6 – King Charles II of England opens his third Parliament.",
    "March 21 – Thomas Shadwell's comedy, A True Widow, is given its first performance, debuting at The Duke's Theatre and staged by the Duke's Company.",
    "March 23 – Rebel Chinese general Wu Sangui takes the imperial crown, names himself monarch of \"The Great Zhou\", based in the Hunan report, with Hengyang as his capital.  He contracts dysentery over the summer and dies on October 2, ending the rebellion against the Kangxi Emperor. [1]",
    "March 25 – The Spanish Netherlands city of Ypres falls after an eight-day siege by the French Army.  It is later returned to the Netherlands and is now part of Belgium.",
    "March 28 – The nova V529 Orionis is discovered by Poland astronomer Jan Heweliusz, referred to in history as Johannes Hevelius.",
    "April 2 – Ignatius Gregory Peter VI Shahbaddin is enthroned as the Patriarch of the Syriac Catholic Church in Aleppo, after receiving recognition by Ottoman Sultan Mehmed IV and by Pope Innocent XI.",
    "April 12 – The Treaty of Casco Bay is signed between officials of the Province of New York and the Penobscot tribe and the Wabanaki Confederacy, bringing and end to further fighting that had happened in the two years saince the end of King Philip's War in what is now the U.S. state of Maine.  Under the terms of the treaty, English settlers pay rent to the Penobscots and are given back farm land that had been confiscated in the war, while the English settlers agree to respect the Penobscot land rights. [2]",
    "May 11 – French admiral Jean d'Estrees runs his whole fleet aground in Curaçao.",
    "June 10 – French buccaneer Michel de Grammont arrives at Spanish-held Venezuela with six pirate ships, 13 smaller craft, and 2,000 men in a daring raid on the South American territory, then leads half of his force inward toward Maracaibo, which he takes on June 14.  During the rest of the month, he and his soldiers march inland as far as Trujillo.  Grammont and his pirates finally depart on December 3.  [3]",
    "June 25 – Elena Lucrezia Cornaro Piscopia becomes the first woman to be awarded a university degree, a doctorate in philosophy from the University of Padua.",
    "July 20 – Muhammad Azam Shah is appointed as the Mughal Governor of Bengal by his father, the Emperor Aurangzeb, and serves for a little more than a year before being recalled from Dhaka.",
    "July 23 – The Battle of Ortenbach, one of the last major engagements of the Franco-Dutch War, takes place near Offenburg at the Rhine river in southwestern Germany, as French forces under the command of François de Créquy overwhelm a larger force of Holy Roman Empire troops commanded by the Duke of Lorraine, Karl V Leopold.",
    "August 3 – Robert LaSalle builds the Le Griffon, the first ship to sail on the Great Lakes of North America.",
    "August 10 – The Treaties of Nijmegen end the Franco-Dutch War. The County of Burgundy is ceded to the Kingdom of France.",
    "August 14–15 – The Battle of Saint-Denis is fought after the peace was signed between France and the Dutch Republic in the Treaties of Nijmegen on 10 August.",
    "August 21 – On the island of Java in what is now Indonesia, the Kediri campaign begins as Mataram Sultanate and Dutch East India Company (VOC) forces under the command of VOC Captain François Tack begin marching from Jepara toward Kediri to suppress the Trunajaya rebellion that had driven out the Mataram Sultan.  They are joined by two other columns of troops over the next two weeks.",
    "September 5 – Sultan Amangkurat II of Mataram sets off from Jepara with the main force in the Kediri campaign, leading native troops, along with VOC forces under the command of Anthonio Hurdt, leader of the campaign.",
    "September 6 – Titus Oates begins to present allegations of the Popish Plot, a supposed Roman Catholic conspiracy to assassinate king Charles II of England. Oates applies the term Tory to those who disbelieve his allegations.",
    "September 17 – The Franco-Dutch War between France against the Dutch Republic and Dutch allies, comes to an end after more than six years as the Treaties of Nijmegen bring about a ceasefire.",
    "October 17 – English magistrate Sir Edmund Berry Godfrey is found murdered in Primrose Hill, London. Titus Oates claims it as a proof of his allegations of a Roman Catholic conspiracy.",
    "November 11 (November 1 O.S.) – England's House of Commons votes to begin impeachment proceedings against five Roman Catholic members of the House of Lords, Viscount Stafford, the Marquess of Powis, Baron Arundell, Baron Petre and Baron Belasyse accused by Protestant members as participating in a \"Popish Plot\".  Viscount Stafford is convicted and executed, while the other four are imprisoned in the Tower of London for more than five years.",
    "November 25 – The Kediri campaign is successfully concluded in Indonesia as Anthonio Hurdt and Sultan Amangkurat II capture Kediri and force the rebel Prince Trunajaya to flee.",
    "November 26 – William Staley, an English banker and a Roman Catholic, becomes the first person to be executed in connection with the Popish Plot arrests.",
    "December 3 – The Test Act provides that members of both the House of Lords and House of Commons of England must swear an anti-Catholic oath, before taking office.",
    "Rebellion breaks out in southern China.",
    "About 1,200 Irish families sail from Barbados, to Virginia and the Carolinas.",
    "In Ireland, the vacant Bishopric of Leighlin is given to the Bishop of Kildare, to form the Roman Catholic Diocese of Kildare and Leighlin."
  ],
  "births": [
    "March 4 – Antonio Vivaldi, Italian composer (d. 1741)",
    "March 7 – Filippo Juvara, Italian architect (d. 1736)",
    "April 14 – Abraham Darby I, one of the English fathers of the Industrial Revolution (d. 1717)",
    "May 3 – Amaro Pargo, Spanish corsair (d. 1747)",
    "May 16 –  Andreas Silbermann, German organ builder (d. 1734)",
    "July 26 – Joseph I, Holy Roman Emperor (d. 1711)",
    "September 16 – Henry St John, 1st Viscount Bolingbroke, English statesman and philosopher (d. 1751)",
    "September 29 – Adrien-Maurice, 3rd duc de Noailles, French soldier (d. 1766)",
    "October 10 – John Campbell, 2nd Duke of Argyll, Scottish soldier (d. 1743)",
    "October 16 – Anna Waser, Swiss painter (d. 1714)",
    "November 26 – Jean Jacques d'Ortous de Mairan, French geophysicist (d. 1771)",
    "December 8 – Horatio Walpole, 1st Baron Walpole of Wolterton, English diplomat (d. 1757)",
    "December 13 – Yongzheng Emperor of China (d. 1735)",
    "December 14 – Daniel Neal, English historian (d. 1743)",
    "December 30 – William Croft, English composer (d. 1727)",
    "date unknown\nGeorge Farquhar, Irish dramatist (d. 1707)\nMaria Faxell, Swedish vicar's wife and war heroine (d. 1738)\nJoachim Ludwig Schultheiss von Unfriedt, German architect (d. 1753)\nPierre Fauchard, French physician and author, considered The father of modern dentistry (d. 1761)\nJohn Senex, British geographer (d. 1740)[4]",
    "George Farquhar, Irish dramatist (d. 1707)",
    "Maria Faxell, Swedish vicar's wife and war heroine (d. 1738)",
    "Joachim Ludwig Schultheiss von Unfriedt, German architect (d. 1753)",
    "Pierre Fauchard, French physician and author, considered The father of modern dentistry (d. 1761)",
    "John Senex, British geographer (d. 1740)[4]"
  ],
  "deaths": [
    "January 11 – Ferrante III Gonzaga, Duke of Guastalla, Italian noble (b. 1618)",
    "January 12 – Robert Ellison, English politician (b. 1614)",
    "January 23  – Sir William Curtius FRS, German magistrate and English baronet b. (1599)",
    "January 24 – Joan Maetsuycker, Governor-General of the Dutch East Indies (b. 1606)",
    "January 27 – Maria Overlander van Purmerland, Dutch noble (b. 1603)",
    "January 29 – Jeronimo Lobo, Portuguese Jesuit missionary (b. 1593)",
    "February 7 – Sir Philip Musgrave, 2nd Baronet, English politician (b. 1607)",
    "November 20 – Daniel Clasen, German academic (b. 1622)",
    "March 3 – Philip Bell, British colonial governor (b. 1590)",
    "March 10 – Jean de Launoy, French historian (b. 1603)",
    "March 27 – Juan de Leyva de la Cerda, conde de Baños, Spanish noble (b. 1604)",
    "April 12 – Mary Rich, Countess of Warwick, 7th daughter of Richard Boyle (b. 1625)",
    "April 23 – Walter Aston, 2nd Lord Aston of Forfar, second and eldest surviving son of Walter Aston (b. 1609)",
    "April 24 – Louis VI, Landgrave of Hesse-Darmstadt (1661–1678) (b. 1630)",
    "April 27 – Nicolas Roland, French priest and founder (b. 1642)",
    "May 2 – Willem Nieupoort, Dutch politician, and diplomat (b. 1607)",
    "May 3 – Bernhard II, Duke of Saxe-Jena, German noble (b. 1638)",
    "May 4 or May 14 – Anna Maria van Schurman, Dutch poet and scholar (b. 1607)",
    "May 16 – Tamura Muneyoshi, Japanese daimyō of the Iwanuma Domain (b. 1637)",
    "May 18 – Miyamoto Iori, Japanese samurai (b. 1612)",
    "June 2 – Pieter de Groot, Dutch diplomat (b. 1615)",
    "June 17 – Giacomo Torelli, Italian stage designer, engineer, and architect (b. 1608)",
    "June 19 – Benedict Arnold, Rhode Island colonial governor (b. 1615)",
    "August 5 – Juan García de Zéspedes, Mexican musician and composer (b. 1619)",
    "August 16 – Andrew Marvell, English writer (b. 1621)",
    "August 17 – Guillaume Herincx, Flemish theologian, Bishop of Ypres (b. 1621)",
    "August 28 – John Berkeley, 1st Baron Berkeley of Stratton, English soldier (b. 1602)",
    "August 31 – Louis VII, Landgrave of Hesse-Darmstadt (b. 1658)",
    "September 1 – Jan Brueghel the Younger, Flemish painter (b. 1601)",
    "September 8 – Pietro della Vecchia, Italian painter (b. 1603)",
    "September 19 – Christoph Bernhard von Galen, German Catholic bishop (b. 1606)",
    "September 28 – Maurizio Cazzati, Italian composer (b. 1616)",
    "October 5 – Hedevig Ulfeldt, daughter of King Christian IV of Denmark and Kirsten Munk (b. 1626)",
    "October 11 – Sir Peter Leycester, 1st Baronet, British historian (b. 1614)",
    "October 12\nPieter Codde, Dutch painter (b. 1599)\nEdmund Berry Godfrey, English magistrate (b. 1621)",
    "Pieter Codde, Dutch painter (b. 1599)",
    "Edmund Berry Godfrey, English magistrate (b. 1621)",
    "October 14 – Sir Richard Newdigate, 1st Baronet, English politician (b. 1602)",
    "October 16 – Cornelis HrR Ridder de Graeff, Dutch nobleman and chief landholder of the Zijpe and Haze Polder (b. 1650)",
    "October 18 – Jacob Jordaens, Flemish painter (b. 1593)",
    "October 19 – Samuel Dirksz van Hoogstraten, Dutch painter (b. c. 1627)",
    "November 1 – William Coddington, first Governor of Rhode Island (b. 1601)",
    "November 4 – Solomon Swale, English politician (b. 1610)",
    "November 5 – Giovan Battista Nani, Italian historian and diplomat (b. 1616)",
    "November 10 – Daniel Zwicker, German physician (b. 1612)",
    "November 30 – Andries de Graeff, Dutch politician (b. 1611)",
    "December 3 – Edward Colman, English Catholic courtier under Charles II (b. 1636)",
    "December 20 – Matthew Marvin, Sr., Connecticut settler (b. 1600)",
    "December 31 – Charles de Lorme, French physician (b. 1584)"
  ]
}