{
  "events": [
    "January 3 – In Madras (now Chennai) in India, local residents employed by the East India Company threaten to boycott their jobs after corporate administrator William Gyfford imposes a house tax on residences within the city walls.  Gyfford places security forces at all entrances to the city and threatens to banish anyone who fails to pay their taxes, as well as to confiscate the goods of merchants who refuse to make sales.  A compromise is reached the next day on the amount of the taxes.",
    "January 17 – King Louis XIV of France reports the success of the Edict of Fontainebleau, issued on October 22 against the Protestant Huguenots, and reports that after less than three months, the vast majority of the Huguenot population had left the country.",
    "January 29 – In Guatemala, Spanish Army Captain Melchor Rodríguez Mazariegos leads a campaign to conquer the indigenous Maya people in the rain forests of Lacandona, departing from Huehuetenango to rendezvous with the colonial governor at San Mateo Ixtatán.",
    "January 31 – In the wake of the success of France's campaign against Protestantism, Victor Amadeus II, the Duke of Savoy, issues an edict against the Valdesi, the Duchy's Protestant minority, setting a 15-day deadline for 15,000 members of the Valdesi to public renounce their beliefs as erroneous, or face banishment or death.  The February 15 deadline is ignored.",
    "February 15 – After the Valdesi in the Duchy of Savoy decline to obey the edict to convert to Catholicism, Duke Victor Amadeus dispatches a force of 9,000 French and Piedmontese soldiers to enforce the edict.",
    "February 22 – Sweden's Council of State endorses the reforms proposed by King Charles XI for the Swedish Church Law 1686, after having debated it in three sessions on February 18, 19 and 20.[1] The law confirms and describes the rights of the Lutheran Church and confirms Sweden as a Lutheran state; all non-Lutherans are banned from immigration unless they convert to Lutheranism; the Romani people are to be incorporated to the Lutheran Church; the poor care law is regulated; and all parishes are forced by law to teach the children within them to read and write, in order to learn the scripture, which closely eradicates illiteracy in Sweden.[2]",
    "February 27 – Gabriel Milan, the controversial Governor of the Danish West Indies since 1684, is removed from office by order of King Frederick III and placed under arrest for treason.  Three years later, after being found guilty in a trial after being brought back to Copenhagen, Milan is beheaded on March 26, 1689.",
    "March 3 – A group of 107 French Canadian soldiers, under the command of Pierre de Troyes, begins the Hudson Bay expedition, departing from Montreal on an 800 miles (1,300 km) journey to take control of the properties of British North American settlers of the Hudson's Bay Company.[3] The group marches for 82 days and arrives at the first Hudson's Bay fort, at Moose Factory on June 19.",
    "April 9 – As the Valdesi rebellion continues, the Duke of Savoy issues a second edict, giving the Protestant Valdesi eight days to lay down their arms and allows safe passage into exile for those who agree.",
    "April 22 – In the wake of Savoy's newest repression of the Protestant Valdesi, a third war breaks out and Protestant pastor Henri Arnaud leads the resistance with 3,000 rebel soldiers against 8,500 Savoyard soldiers and mercenaries.  The Valdesi are overwhelmed within one month.",
    "May 4 – The Municipality of Ilagan is founded in the Philippines.",
    "May 6 – The Treaty of Perpetual Peace (1686) is signed between the Tsardom of Russia and the Polish–Lithuanian Commonwealth, recognizing the former's possession of Left-bank Ukraine and the city of Kiev, as agreed upon in the earlier Treaty of Andrusovo in 1667. The treaty also brings the Tsardom of Russia into the Great Turkish War, on the side of the Holy League of 1684.",
    "May 14 – Joseph Dudley formally begins his tenure, as President of the Council of the newly formed Dominion of New England.",
    "May 25 – The third war against the Protestant Valdesi ends.  Soon afterward, 2,000 of the Valdesi are massacred, 8,500 taken prisoner and about 3,000 surviving civilians forcibly resettled and converted to Catholicism.",
    "June 20 – French Canadian soldiers on the Hudson Bay expedition capture the first of the British Hudson's Bay Company outposts, with the surrender the unarmed inhabitants of the fortress at Moose Factory, Ontario.[4]",
    "July 9 – The Grand Alliance (League of Augsburg) is founded, in response to claims made by Louis XIV of France on the Electorate of the Palatinate in western Germany. It comprises the Holy Roman Empire, the Netherlands, Sweden, Spain, the electors of Bavaria, Saxony and the Electorate of the Palatinate.[5][6]",
    "July 17 – King James II of England appoints four Roman Catholics to the Privy Council of England,[7] in defiance of the Test Acts, which bar Catholics from public office. Suspicions about James's intentions lead to a group of conspirators meeting at Charborough House in Dorset, to plan his overthrow and replacement with the Protestant Dutch Stadtholder, William III of Orange-Nassau (James's son-in-law).",
    "July 18 – An army of 3,000 Chinese troops demand Russian surrender of a Russian Empire fortress at Albazino on the Amur River.  The fortress is manned by only 736 Russian soldiers and militia but is armed with cannons.  Over the next several weeks, the Chinese troops are joined by another 3,000 men in supply boats, but the Russians hold off the attacks for the next five months.  By December, only 24 Russians remain, and Albazino is ceded to China in 1689.",
    "July 22 – New York City and Albany, New York, are granted city charters by the colonial governor.",
    "August 4 – Portuguese soldiers hired by the East India Company mutiny rather than follow orders to join the war in Bengal.  The ringleaders are quickly arrested and executed, and the mutiny ends.",
    "August 15 – Christina, who had ruled as the monarch of Sweden until her abdication in 1654 in favor of her cousin Charles, responds to the revocation in France of the Edict of Nantz and declares that Jews within Sweden will be under her protection.",
    "August 16 – King James VII of Scotland dismisses the Parliament of Scotland after the members refuse to remove restrictions on Roman Catholics and on Protestants outside of the Church of Scotland and the Church of England.  The Parliament does not meet again for more than two and a half years.",
    "August 17 – Spanish troops attack and plunder the Scottish colony of Stuarts Town in the Province of Carolina (now Port Royal, South Carolina) and plunder the city.  After three days, the Spaniards begin a march of over 75 miles (121 km) toward the larger port city of Charles Town.",
    "September 2 – Great Turkish War: Battle of Buda – Imperial forces of the Holy League of 1684 (Russia, Saxony, Brandenburg and Bavaria under Austrian leadership) liberate Buda (now part of Budapest) from Ottoman Turkish rule (leading to the end of Ottoman rule in Hungary during subsequent years).",
    "September 4 – A hurricane saves Charleston, South Carolina from attack by Spanish vessels.[8]",
    "September 30 – The Ottoman fortress of Sinj in Dalmatia falls to the army of the Republic of Venice.",
    "October 17 – As the Savoyard–Waldensian wars, draw to a close, the Duke of Savoy announces that the Protestant Valdisi defenders will be granted safe passage to Switzerland, and that children taken during the war will be allowed to return to their families.  By January, a little more than 2,500 Valdisi take the offer.",
    "October 22 – In the Great Turkish War, the Siege of Pécs ends when the Ottoman-held city, located across the Danube River from the recent liberated Buda, surrenders to Austrian troops of the Holy League, continuing the Austrian assumption of control of Hungary.  Buda and Pécs are later combined to form the Hungarian city (and now capital) of Budapest.",
    "October 23 – Szeged, now the second largest city in Hungary, is liberated from Turkish Ottoman rule.",
    "October 31 – Anglurah Agung, the virtual leader of the island of Bali as king of the paramount state of Gelgel, is killed in battle fighting Batu Lepang (who also dies in the fighting), ending the unification of the island (now part of Indonesia) and causing Bali to split into several principalities.",
    "November 26 – The Treaty of Whitehall, more formerly the Treaty of Neutrality for America, is signed at the Palace of Whitehall in Westminster between representatives of King Louis XIV of France and King James II of England, with both sides pledging that \"though the two Countries might be at war in Europe their Colonies in America should continue in peace and Neutrality\".[9] The treaty is broken less than two years later when King William's War breaks out in what is now the U.S. state of Maine.",
    "November 30 – Melchor Portocarrero, 3rd Count of Monclova becomes the new Viceroy of New Spain (encompassing what is now Mexico and much of the southewstern United States) as he arrives in Mexico City to take over at the end of the term of Tomás de la Cerda, 3rd Marquess of la Laguna.",
    "December 20 – Edmund Andros arrives in Boston to become the British Governor of the newly-created Dominion of New England, which includes most of the what are now the U.S. states of Connecticut, Maine, Massachusetts, New Hampshire, New Jersey, Rhode Island, Vermont and much of the eastern portion of New York.  The unpopular Andros, who reigns as a dictator after being appointed by King James II, is driven out of office in 1689 after the overthrow of James, and the Dominion of New England is broken up into its constituent colonies.",
    "December 22 – Frederick William, Elector of Brandenburg and Duke of Prussia, head of the House of Hohenzollern, enters into an alliance with the Holy Roman Empire, ruled by Emperor Charles VI of the Holy Roman Empire and head of the Austrian House of Habsburg.",
    "English historian and naturalist Robert Plot publishes The Natural History of Staffordshire, a collection of illustrations and texts detailing the history of the county. It is the first document known to mention crop circles and a double sunset.",
    "The Café Procope, which remains in business in the 21st century, is opened in Paris by Procopio Cutò, as a coffeehouse."
  ],
  "births": [
    "January 8 – William Frederick, Margrave of Brandenburg-Ansbach, Margrave of Brandenburg-Ansbach (1703-1723) (d. 1723)",
    "January 9 – Andrew Michael Ramsay, Scottish writer (d. 1743)",
    "January 12 – Adam Christian Thebesius, German anatomist (d. 1732)",
    "January 17 – Archibald Bower, Scottish historian (d. 1766)",
    "January 23 – Moritz Georg Weidmann, German bookseller (d. 1743)",
    "January 31 – Hans Egede, Dano-Norwegian Lutheran missionary who launched mission efforts to Greenland (d. 1758)",
    "February 1 – Suzanne Henriette of Lorraine, French noblewoman, Duchess of Mantua and Montferrat (d. 1710)",
    "February 2 – John Eames, English academic (d. 1744)",
    "February 10 – Jan Frederik Gronovius, Dutch botanist notable as a patron of Linnaeus (d. 1762)",
    "February 11 – William Bowles (1686–1748), British politician (d. 1748)",
    "February 13 – John Churchill, Marquess of Blandford, British noble (d. 1703)",
    "February 14 – Harry Pulteney, British politician (d. 1767)",
    "February 16 – Eleonore of Löwenstein-Wertheim, German countess (d. 1753)",
    "March 17 – Jean-Baptiste Oudry, French painter (d. 1755)",
    "March 22 – James Hamilton, 7th Earl of Abercorn (d. 1744)",
    "March 27 – Johann Jakob Quandt, Lutheran theologian, translated the Bible into Lithuanian (d. 1772)",
    "April 1 – Jan Frans van Bredael, Flemish painter (d. 1750)",
    "April 8 – Stefano Felice Ficatelli, Italian painter of the late Baroque period (d. 1771)",
    "April 9 – James Craggs the Younger, English politician (d. 1721)",
    "April 17 – François Victor Le Tonnelier de Breteuil, French nobleman (d. 1743)",
    "April 19 – Vasily Tatishchev, Russian statesman, ethnographer (d. 1750)",
    "April 28 – Michael Brokoff, Czech sculptor (d. 1721)",
    "April 29 – Peregrine Bertie, 2nd Duke of Ancaster and Kesteven (d. 1742)",
    "May 19 – Samuel-Jacques Bernard (1686–1753), French billionaire (d. 1753)",
    "May 24 – Gabriel Fahrenheit, German physicist, inventor of the Fahrenheit temperature scale (d. 1736)",
    "May 25 – William Steuart (Scottish politician) (d. 1768)",
    "May 30 – Antonina Houbraken, Dutch artist (d. 1736)",
    "June 5\nEdward Howard, 9th Duke of Norfolk, British peer (d. 1777)\nIgnatius of Santhià, Italian Catholic priest (d. 1770)",
    "Edward Howard, 9th Duke of Norfolk, British peer (d. 1777)",
    "Ignatius of Santhià, Italian Catholic priest (d. 1770)",
    "June 6 – John Reading (New Jersey governor), Colonial Governor of New Jersey (d. 1767)",
    "June 7\nAdolphus Frederick III, Duke of Mecklenburg-Strelitz (d. 1752)\nArmand de La Richardie, French missionary (d. 1758)",
    "Adolphus Frederick III, Duke of Mecklenburg-Strelitz (d. 1752)",
    "Armand de La Richardie, French missionary (d. 1758)",
    "June 9 – Andrei Osterman, Russian statesman (d. 1747)",
    "June 24 – Domenico Montagnana, Italian luthier (d. 1750)",
    "June 29 – Pietro Paolo Troisi, Maltese artist (d. 1743)",
    "July 3 – Edward Watson, Viscount Sondes, Member of the Parliament of Great Britain (d. 1722)",
    "July 5 – Jan Macaré, interim Dutch governor of Ceylon (d. 1742)",
    "July 6 – Antoine de Jussieu, French naturalist (d. 1758)",
    "July 9 – Philip Livingston, American politician (d. 1749)",
    "July 25 – William Hardres, British politician (d. 1736)",
    "July 27 – Mary Butterworth, American colonial counterfeiter (d. 1775)",
    "July 31 – Charles, Duke of Berry (1686–1714), grandson of Louis XIV of France (d. 1714)",
    "July 31 (or August 1) – Benedetto Marcello, Italian composer (d. 1739)",
    "August 3 – Gervais Baudoin, Canadian physician (d. 1752)",
    "August 10 – Georg Christian, Fürst von Lobkowitz, Austrian field marshal (d. 1755)",
    "August 12\nJohn Balguy, English divine and philosopher (d. 1748)\nBendix Grodtschilling the Youngest, Danish painter (d. 1737)",
    "John Balguy, English divine and philosopher (d. 1748)",
    "Bendix Grodtschilling the Youngest, Danish painter (d. 1737)",
    "August 17 – Nicola Porpora, Neapolitan composer of Baroque operas and teacher of singing (d. 1768)",
    "August 18 – Peter von Bemmel, German artist (d. 1754)",
    "August 19\nEustace Budgell, English writer and politician (d. 1737)\nNicola Porpora, Italian composer (d. 1768)",
    "Eustace Budgell, English writer and politician (d. 1737)",
    "Nicola Porpora, Italian composer (d. 1768)",
    "August 22 – Albert Schultens, Dutch philologist (d. 1750)",
    "August 27 – Agostino Cornacchini, Italian sculptor and painter of the Rococo period (d. 1754)",
    "August 29 – Aloysius Centurione, Italian Jesuit (d. 1757)",
    "September 5 – Antoine Touron, French historian (d. 1775)",
    "September 29 – Cosmas Damian Asam, German painter and architect during the late Baroque period (d. 1739)",
    "September 30 – John Alexander (Presbyterian minister) (d. 1743)",
    "October 13 – Sir John Baird, 2nd Baronet, British politician (d. 1745)",
    "October 15 – Allan Ramsay (poet), Scottish poet (or makar) (d. 1758)",
    "October 17 – Jacques Hardion, French historian (d. 1766)",
    "October 17 (bapt.) ? – John Machin, English mathematician (d. 1751)",
    "October 19 – Peter van der Bosch, Jesuit hagiographer (d. 1736)",
    "October 30 – Charles Jean-Baptiste Fleuriau, French politician (d. 1732)",
    "October 31 – Senesino, Italian singer (d. 1758)",
    "November 1\nColin Campbell (Swedish East India Company), Scottish businessman (d. 1757)\nAxel Löwen, Swedish duke (d. 1773)",
    "Colin Campbell (Swedish East India Company), Scottish businessman (d. 1757)",
    "Axel Löwen, Swedish duke (d. 1773)",
    "November 13 – Eleonora Luisa Gonzaga, Tuscan princess (d. 1741)",
    "November 15 – Claude Louis d'Espinchal, marquis de Massiac, French politician (d. 1770)",
    "November 16 – Yinxiang (prince), Manchu prince of the Qing Dynasty (d. 1730)",
    "November 23 – Ignácio Barbosa-Machado, Portuguese historian (d. 1734)",
    "November 30 – Richard Lumley, 2nd Earl of Scarbrough (d. 1740)",
    "December 8 – John Dawnay (MP), British politician (d. 1740)",
    "December 15 – Jean-Joseph Fiocco, Flemish composer (d. 1746)",
    "December 25 – Giovanni Battista Somis, Italian violinist and composer (d. 1763)",
    "date unknown –\nWilliam Law, English cleric (d. 1761)\nNetawatwees, Indigenous American (Lenape) leader (d. 1776)",
    "William Law, English cleric (d. 1761)",
    "Netawatwees, Indigenous American (Lenape) leader (d. 1776)",
    "approximate date – Queen Nanny of the Maroons, Jamaican national heroine (d. 1755)"
  ],
  "deaths": [
    "January 10 – Ana de los Angeles Monteagudo, Peruvian nun (b. 1602)",
    "January 17 – Carlo Dolci, Italian painter (b. 1616)",
    "January 19 – Simon Digby, 4th Baron Digby, English politician (b. 1657)",
    "January 21 – François Blondel, French architect (b. 1618)",
    "January 22 – Duchess Johanna Magdalena of Saxe-Altenburg (b. 1656)",
    "January 31 – Jean Mairet, French dramatist (b. 1604)",
    "February 6 – Dorothy White, English Quaker and writer (b. 1630)",
    "February 10 – William Dugdale, English antiquarian (b. 1605)",
    "February 21 – Sibylle Christine of Anhalt-Dessau, Princess of Anhalt-Dessau (b. 1603)",
    "March 17 – Elisabeth Marie, Duchess of Oels, Regent of Oels (b. 1625)",
    "March 22 – John Frederick, Margrave of Brandenburg-Ansbach (b. 1654)",
    "March 26 – Charlotte, Landgravine of Hesse-Kassel, German noble (b. 1627)",
    "April 6 – Arthur Annesley, 1st Earl of Anglesey, English royalist statesman (b. 1614)",
    "April 15 – Joseph Bridger, Colonial Governor of Virginia (b. 1631)",
    "April 19 – Antonio de Solís y Ribadeneyra, Spanish writer (b. 1610)",
    "April 23 – Henrietta Wentworth, 6th Baroness Wentworth of England (b. 1660)",
    "April 26 – Magnus Gabriel De la Gardie, Swedish statesman and military man (b. 1622)",
    "May 21 – Otto von Guericke, German physicist and inventor of the Magdeburg Hemispheres (b. 1602)",
    "May 29 – Ove Juul, Governor-General of Norway (b. 1615)",
    "May 31 – Nicholas Barré, French Minim friar, priest and founder (b. 1621)",
    "June 23 – William Coventry, English statesman (b. c.1628)",
    "July 10 – John Fell, English churchman (b. 1625)",
    "July 16 – John Pearson, English theologian (b. 1612)",
    "August 3 – Anna Margaret of Hesse-Homburg, Duchess consort of Schleswig-Holstein-Sonderburg-Wiesenburg (b. 1629)",
    "August 13 – Louis Maimbourg, French-born historian (b. 1610)",
    "September 19 – John George I, Duke of Saxe-Eisenach, German duke (b. 1634)",
    "October 26 – John Egerton, 2nd Earl of Bridgewater, English politician (b. 1623)",
    "November 1 – William Duckett, English politician (b. 1624)",
    "November 25 – Nicolas Steno, Danish pioneer in anatomy and geology, bishop (b. 1638)",
    "November 28 – Nicolas Letourneux, French preacher, ascetical writer (b. 1640)",
    "December 6 – Eleonora Gonzaga, Queen consort of Ferdinand III, Holy Roman Emperor (b. 1630)",
    "December 11 – Louis, Grand Condé, French general (b. 1621)[10]",
    "December 12 – Charles de Noyelle, French Jesuit Superior General (b. 1615)",
    "December 24 – Philip Packer, British barrister and architect (b. 1618)"
  ]
}