{
  "events": [
    "January 2 – Fleeing from the Spanish Navy, French pirate Raveneau de Lussan and his 70 men arrive on the west coast of Nicaragua, sink their boats, and make a difficult 10 day march to the city of Ocotal.",
    "January 5 – Pirates Charles Swan and William Dampier and the crew of the privateer Cygnet become the first Englishmen to set foot on the continent of Australia.",
    "January 11 – The Patta Fort and the Avandha Fort, located in what is now India's Maharashtra state near Ahmednagar, are captured from the Maratha clan by Mughul Army commander Matabar Khan.  The Mughal Empire rules the area 73 years.",
    "January 17 – Ilona Zrínyi, who has defended the Palanok Castle in Hungary from Austrian Imperial forces since 1685, is forced to surrender to General Antonio Caraffa.",
    "January 29 – Madame Jeanne Guyon, French mystic, is arrested in France and imprisoned for seven months.",
    "January 30 (January 20, 1687 old style) – King James II of England and Scotland issues a proclamation offering amnesty to pirates in the West Indies who surrender to Sir Robert Holmes.",
    "February 7 – Six French Jesuit scientists, Joachim Bouvet, Jean-François Gerbillon, Louis-Daniel Lecomte, Guy Tachard, Claude de Visdelou and the leader, Jean de Fontaney, arrive in Beijing and are welcomed by the Emperor of China, Kangxi.  [1]",
    "February 17 – James Renwick, the last of the Covenanters in Scotland to be martyred for opposing the authority of King Charles II, is publicly hanged at Grassmarket square in Edinburgh.",
    "February 23 – Abaza Siyavuş Pasha, the Grand Vizier of the Ottoman Empire, is assassinated by the Janissaries, the Turkish troops who had placed him in power in September, after the new Sultan fails to make payment of an expected bonus.",
    "February 28 – The French opera David et Jonathas, composed by Marc-Antoine Charpentier, is performed for the first time.",
    "March 1 – A great fire devastates Bungay, England.",
    "March – William Dampier makes the first recorded visit to Christmas Island, now a territory of Australia, located south of the island of Java (now part of Indonesia).",
    "April 3 – Francesco Morosini becomes Doge of Venice.",
    "April 10 – Morean War: The Venetian forces under Francesco Morosini evacuate Athens and Piraeus.",
    "April 18 (Julian calendar) – The Germantown Quaker Protest Against Slavery is drafted by four Germantown Quakers.",
    "April 29 – Friedrich Wilhelm, the Great Elector of Brandenburg-Prussia, dies. Friedrich III becomes Elector of Brandenburg-Prussia until 1701, when he becomes the first King of Prussia, as Friedrich I.",
    "May 4 – King James II of England orders his Declaration of Indulgence, suspending penal laws against Catholics, to be read from every Anglican pulpit in England. The Church of England and its staunchest supporters, the peers and gentry, are outraged; on June 8 the Archbishop of Canterbury, William Sancroft, is imprisoned in the Tower of London for refusing to proclaim it.",
    "May 10 – King Narai of Ayutthaya nominates Princess Sudawadi as his successor, with Constantine Phaulkon, Mom Pi and Phetracha acting as joint regents.",
    "May 17 – The arrest of King Narai of Ayutthaya launches a coup d'état.",
    "June 5 –\nA 7.0 magnitude earthquake strikes southern Italy at 6:30 in the evening and kills at least 10,000 people in the Kingdom of Naples in what is now the province of Benevento.\nConstantine Phaulkon is beheaded after having been arrested in May.",
    "A 7.0 magnitude earthquake strikes southern Italy at 6:30 in the evening and kills at least 10,000 people in the Kingdom of Naples in what is now the province of Benevento.",
    "Constantine Phaulkon is beheaded after having been arrested in May.",
    "June 10 – The birth of James Francis Edward Stuart (later known as the Old Pretender), son and heir to James II of England and his Catholic wife Mary of Modena, at St James's Palace in London, increases public disquiet about a Catholic dynasty, particularly when the baby is baptised into the Catholic faith. Rumours about his true maternity swiftly begin to circulate.",
    "June 24 – French forces under Chevalier de Beauregard abandon their garrison at Mergui, following repeated Siamese attacks; this ultimately leads to their withdrawal from the country.",
    "June 30 – A high-powered conspiracy of notables (the Immortal Seven) invite Dutch stadtholder William III of Orange and Princess Mary to \"defend the liberties of England\", and depose King James VII and II.",
    "July 13 – The siege of Negroponte by the Venetians begins.",
    "August 1 – Phetracha becomes king of Ayutthaya, after a coup d'état.",
    "August 27 – The funding of the armed invasion of William III in England causes a financial crisis in the Dutch Republic.[2]",
    "September 6 – Great Turkish War: The Habsburg army captures Belgrade.",
    "October 21 – The Venetians raise the siege of Negroponte.",
    "October 27 – King James II of England dismisses his minister Robert Spencer, 2nd Earl of Sunderland.",
    "November 11 (November 1 OS) – Glorious Revolution: William III of Orange sets sail a second time from Hellevoetsluis, the Netherlands, to take over England, Scotland and Ireland from King James II of England.",
    "November 15 (November 5 OS) – The Glorious Revolution begins: William of Orange lands at Torbay, England with a multinational force of 15,000 mercenaries. He makes no claim to the British Crown, saying only that he has come to save Protestantism and to maintain English liberty, and begins a march on London.",
    "November 19 (November 9 OS) – William of Orange captures Exeter, after the magistrates flee the city.",
    "November 20 (November 10 OS) – The Wincanton Skirmish between forces loyal to James II led by Patrick Sarsfield and a party of Dutch troops is one of the few armed clashes in England during the Glorious Revolution.",
    "November 23 – A group of 1,500 Old Believers immolate themselves to avoid capture, when troops of the tsar lay siege to their monastery on Lake Onega.",
    "November 26 – Hearing that William of Orange has landed in England, Louis XIV declares war on the Netherlands. Perhaps revealingly, he does not attack the Netherlands, but instead strikes at the heart of the Holy Roman Empire, with about 100,000 soldiers. The Nine Years' War begins in Europe and America.",
    "December 7 –   December 7: The shutting of the gates in Derry in a stained glass window of the Guildhall[3] The gates of Derry are shut in front of the Jacobite Earl of Antrim and his \"redshanks\". This initiates the siege of Derry, which is the first major event in the Williamite War in Ireland.",
    "December 9 – The Battle of Reading takes place in Reading, Berkshire. It is the only substantial military action in England during the Glorious Revolution and ends in a decisive victory for forces loyal to William of Orange.",
    "December 11 – Having led his army to Salisbury and been deserted by his troops, James VII and II attempts to flee to France.",
    "December 18 – William of Orange, Stadtholder of the Dutch Republic and the future King William III of the United Kingdom, enters London.",
    "The Austrians incite the Chiprovtsi Uprising, against the Ottomans in Bulgaria.",
    "Edward Lloyd opens the London coffee house that soon becomes a popular meeting place for shipowners, merchants, insurance brokers and underwriters. In time the business association they form will outgrow the coffee house premises, and become Lloyd's of London.",
    "Neuruppin becomes a Prussian garrison town.",
    "Johann Weikhard von Valvasor becomes a member of the Royal Society.",
    "Antonio Verrio begins work on the Heaven Room at Burghley House.",
    "The earliest known mention of the balalaika is made.",
    "Oroonoko one of the first English novels and the first work by a professional female author is published."
  ],
  "births": [
    "January 15 – Maria van Lommen, Dutch gold- and silversmith (b. 1742)",
    "January 18 – Lionel Cranfield Sackville, 1st Duke of Dorset, Lord Lieutenant of Ireland (d. 1765)",
    "January 23 – Queen Ulrika Eleonora of Sweden (d. 1741)[4]",
    "January 29 – Emanuel Swedenborg Swedish scientist, philosopher, and theologian (d. 1772)",
    "February 4 – Pierre de Marivaux, French playwright (d. 1763)",
    "March – William Burnet, British colonial administrator (d. 1729)",
    "March 14 – Anna Maria Garthwaite, British designer (d. 1763)",
    "April 4 – Joseph-Nicolas Delisle, French astronomer (d. 1768)",
    "April 15 – Johann Friedrich Fasch, German composer (d. 1758)",
    "May 21 – Alexander Pope, English poet (d. 1744)",
    "June 10 – James Francis Edward Stuart, The Old Pretender, claimant to the English and Scottish throne (d. 1766)",
    "July 19 – Giuseppe Castiglione, Italian missionary to China (d. 1766)",
    "June 30 – Abu l-Hasan Ali I, ruler of Tunisia (d. 1756)",
    "August 14 – King Frederick William I of Prussia (d. 1740)",
    "September 12 – Ferdinand Brokoff, Czech sculptor (d. 1731)",
    "October 17 – Domenico Zipoli, Italian composer (d. 1726)",
    "October 22 – Nader Shah of Persia (d. 1747)",
    "November 15 (bapt.) – Charles Rivington, English publisher (d. 1742)"
  ],
  "deaths": [
    "January 7 – James Howard, 3rd Earl of Suffolk",
    "January 27 – Empress Dowager Xiaozhuang, concubine of Qing Dynasty ruler Hong Taiji (b. 1613)[5]",
    "January 28 – Ferdinand Verbiest, Flemish Jesuit missionary in China (b. 1623)",
    "February 2 – Abraham Duquesne, French naval officer (b. 1610)",
    "February 13 – David Christiani, German mathematician and philosopher (b. 1610)",
    "February 17 – James Renwick, Scottish minister and Covenanter martyr (b. 1662)",
    "February 28 – Johann Sigismund Elsholtz, German naturalist and physician (b. 1623)",
    "March 1 – Sir Thomas Slingsby, 2nd Baronet of England (b. 1636)",
    "March 3 – Marie de Lorraine, Duchess of Guise (b. 1615)",
    "March 8 – Honoré Fabri, French mathematician (b. 1608)",
    "March 20 – Maria of Orange-Nassau, Dutch princess (b. 1642)",
    "March 23 – Marcantonio Giustinian, 107th Doge of Venice (b. 1619)",
    "March 26 – Winston Churchill (1620–1688), English noble, soldier (b. 1620)",
    "March 27 – Frederick, Burgrave of Dohna, Dutch officer, and governor of Orange (b. 1621)",
    "April 28 – Frederick, Duke of Mecklenburg-Grabow, German nobleman, titular Duke of Mecklenburg (b. 1638)",
    "April 29 – Frederick William, Elector of Brandenburg (b. 1620)",
    "May 14 – Antoine Furetière, French writer (b. 1619)",
    "May 22 – Johannes Andreas Quenstedt, German theologian (b. 1617)",
    "June 1 – Peder Hansen Resen, Danish historian (b. 1625)",
    "June 3 – Maximilian Henry of Bavaria, Roman Catholic bishop (b. 1621)",
    "June 5 – Constantine Phaulkon, Greek adventurer (b. 1647)",
    "June 26\nJohn Claypole, English politician (b. 1625)\nRalph Cudworth, English philosopher (b. 1617)",
    "John Claypole, English politician (b. 1625)",
    "Ralph Cudworth, English philosopher (b. 1617)",
    "June 28 – Richard Winwood, English politician (b. 1609)",
    "June 29 – Ippolito Lante Montefeltro della Rovere, Italian nobleman and Duke of Bomarzo (b. 1618)",
    "July 11 – King Narai of Thailand (b. 1639)",
    "July 21 – James Butler, 1st Duke of Ormonde, Irish statesman (b. 1610)",
    "August 25 – Henry Morgan, Welsh privateer and Governor of Jamaica (b. c. 1635)",
    "August 31 – John Bunyan, English writer (b. 1628)",
    "September 2 – Robert Viner, Lord Mayor of London (b. 1631)",
    "September 9 – Claude Mellan, French painter and engraver (b. 1598)",
    "September 20 – Queen Jangnyeol, Korean royal consort (b. 1624)",
    "November 26 – Jacques Goulet, early pioneer in New France (now Québec) (b. 1615)",
    "October 4\nPhilip de Koninck, Dutch painter (b. 1619)\nRoger Pepys, English lawyer and politician (b. 1617)",
    "Philip de Koninck, Dutch painter (b. 1619)",
    "Roger Pepys, English lawyer and politician (b. 1617)",
    "October 6 – Christopher Monck, 2nd Duke of Albemarle, English statesman (b. 1653)",
    "October 9 – Claude Perrault, French architect (b. 1613)",
    "October 13 – Sir John Bright, 1st Baronet, English politician (b. 1619)",
    "October 14 – Joachim von Sandrart, German Baroque art-historian and painter (b. 1606)",
    "October 23 – Charles du Fresne, sieur du Cange, French philologist (b. 1610)",
    "November 26 – Philippe Quinault, French dramatist (b. 1635)",
    "November 28 – Bohuslav Balbín, Czech writer and Jesuit (b. 1621)",
    "December 4 – Sir Edward Seymour, 3rd Baronet, Member of Parliament (b. 1610)",
    "December 8 – Thomas Flatman, British artist (b. 1635)",
    "December 15 – Gaspar Fagel, Dutch statesman (b. 1634)",
    "December 15 – Louis Victor de Rochechouart de Mortemart, French military man, brother of Madame de Montespan (b. 1636)"
  ]
}