{
  "events": [
    "January 24 – At least 75 residents of what is now York, Maine, United States, are killed in the Candlemas Massacre, carried out by French soldiers led by missionary Louis-Pierre Thury, along with a larger force of Abenaki and Penobscot Indians under the command of Penobscot Chief Madockawando during King William's War, between the French colonists and their indigenous allies, against the English colonists.  At least 112 English survivors are captured and taken from the Maine District of the  Province of Massachusetts Bay and forced to walk to French Canada, where they are held until Massachusetts captain John Alden pays a ransom.",
    "January 30 – English Army General John Churchill, 1st Duke of Marlborough, a close adviser to King William III, is fired from all of his jobs by the English Secretary of State, the Earl of Nottingham, on orders of Queen Mary.  He is later incarcerated briefly on charges of treason for allegedly contacting the dethroned King James II.",
    "February 13 – Massacre of Glencoe: The forces of Robert Campbell slaughter around 40 members of the Clan MacDonald of Glencoe in Scotland (from whom they have previously accepted hospitality), for delaying to sign an oath of allegiance to King William III of England.[1]",
    "March 1 – The Salem witch trials begin in Salem Village, Massachusetts Bay Colony, with the charging of 3 women with witchcraft.  Tituba, a slave owned by Samuel Parris, is the first to be arrested, and she implicates Sarah Good and Sarah Osborne, who are arrested later in the day.  Osborne dies in prison in May, while Good is hanged in July; Tituba is set free after confessing to committing witchcraft.",
    "March 22 – The Kangxi Emperor of the Qing dynasty issues the Edict of Toleration, recognizing all the Roman Catholic Church, not just the Jesuits, and legalizing missions and their conversion of Chinese people.[2]",
    "April 18 – Giles Corey, Mary Warren, Abigail Hobbs and Bridget Bishop, all residents of Salem, Massachusetts, are arrested and charged with the practice of witchcraft.  Corey and Bishop are later executed, while Warren and Hobbs avoid a death sentence.",
    "May 29 (May 19 OS) – Nine Years' War: Battle of Barfleur – The Anglo-Dutch fleet breaks the French line off the Cotentin Peninsula, foiling the French plan to invade England.[3]",
    "June 13–14 (June 3–4 OS) – Nine Years' War: Battle of La Hogue – The action begun at Barfleur ends with further destruction of the French fleet.[3]",
    "June 7 – Jamaica earthquake: An earthquake and related tsunami destroy Port Royal, capital of Jamaica, and submerge a major part of it; an estimated 2,000 are immediately killed, 2,300 injured, and a probable additional 2,000 die from the diseases which ravage the island in the following months.",
    "June 8 – During a famine in Mexico City, an angry mob torches the Viceroy's palace and ignites the archives; most of the documents and some paintings are saved by royal geographer Carlos de Sigüenza y Góngora.",
    "June 10 – The Salem witch trials' first victim, Bridget Bishop, is hanged for witchcraft.",
    "July 1 – The siege of the strategically-located Belgian city of Namur in the Spanish Netherlands ends as Dutch General Menno van Coehoorn capitulates to King Louis XIV of France after five weeks.  The siege, a battle in the ongoing Nine Years War, had begun on May 24. [4]",
    "July 5 – Wine shop owner Antoine Savetier and his wife are murdered by thieves in the French city of Lyon, and a peasant named Jacques Aymar-Vernay is called in as a detective to solve the case.  Aymar follows clues to a nearby town, Beaucaire, and finds one of the perpetrators, Joseph Arnoul, who confesses to the crime and implicates two accomplices who manage to escape.  Arnoul is executed by being \"broken on the wheel\" on August 30.  [5]",
    "August 12 – The city of Ponce is founded in Puerto Rico,",
    "September 8 – An earthquake in Brabant of scale 5.8 is felt across the Low Countries, Germany and England.[6]",
    "September 14 – Diego de Vargas leads Spanish colonists in retaking the city of Santa Fe, New Mexico, after a 12-year exile, following the Pueblo Revolt of 1680.",
    "September 19 – Giles Corey is pressed to death, in an attempt to coerce a confession from him of witchcraft during the Salem witch trials.",
    "September 22 – The last of those convicted of witchcraft in the Salem witch trials are hanged.  By the end of September, 14 women and 5 men have been executed by hanging.  The remainder of those convicted are all eventually released.",
    "September 27 – The trial for socrcery of Anne Palles of Denmark begins, and she gives a long confession of giving her body and soul to Satan.  The court finds her guilty on November 2 and sentences her to death, and the sentence is carried out on April 4.",
    "October 21 – In Barbados, a slave revolt is crushed.",
    "November 5 – Mohamed bin Hajj Ali Thukkala becomes the new Sultan of the Maldives as Muhammad Ali IV.",
    "November 8 – William Mountfort's play Henry The Second, King Of England; With The Death Of Rosamond is given its first performane, premiering at the Drury Lane Theatre.",
    "December 5 – John Goldsborough arrives in Madras as the new admniistrator of the British East India Company.",
    "December 14 – Maratha Empire General Santaji Ghorpade defeats Mughal Emperor Aurangzeb's General Alimardan Khan, captures him and brings him back to fort Jinjee near Madras.",
    "December 23 – Nahum Tate is named as the new Poet Laureate of the United Kingdom and serves for 22 years until his death."
  ],
  "births": [
    "February 25 – Karl Ludwig von Pöllnitz, German adventurer and writer (d. 1775)",
    "February 29 – John Byrom, English poet (d. 1763)",
    "April 5 – Adrienne Lecouvreur, French actress (d. 1730)",
    "April 8 – Giuseppe Tartini, Italian composer and violinist was born in Piran (d. 1770)",
    "April 22 – James Stirling, Scottish mathematician (d. 1770)",
    "May 18 – (O.S) Joseph Butler, English bishop and philosopher (d. 1752)[7]",
    "June 30 – Antonio Sandini,  Italian ecclesiastical historian (d. 1751)",
    "August 3 – John Henley, English minister (d. 1756)",
    "August 18 – Louis Henri, Duke of Bourbon, Prime Minister of France (d. 1740)",
    "October 25 – Elisabeth Farnese, queen of Philip V of Spain (d. 1766)",
    "November 2 – Unico Wilhelm van Wassenaer, Dutch composer (d. 1766)",
    "November 6 – Louis Racine, French poet (d. 1763)",
    "November 15 – Eusebius Amort, German Catholic theologian (d. 1775)",
    "November 21 – Carlo Innocenzo Frugoni, Italian poet (d. 1768)"
  ],
  "deaths": [
    "January 23 – John Page, American politician (b. 1628)",
    "January 25 – Shubael Dummer, American Congregational church minister (b. 1636)",
    "February 6 – George Durant, attorney in the Province of Carolina (b. 1632)",
    "February 7 – Fernando de Valenzuela, 1st Marquis of Villasierra, Spanish noble (b. 1630)",
    "February 14 – Thomas Rosewell, English minister (b. 1630)",
    "March 3 – Countess Palatine Eleonora Catherine of Zweibrücken, sister of King Charles X of Sweden (b. 1626)",
    "April 22 – Tomás de la Cerda, 3rd Marquis of la Laguna, Spanish nobleman (b. 1638)",
    "April 23 – Edward Howard, 2nd Earl of Carlisle, English politician (b. 1646)",
    "May 3 – Edward Evelyn, British politician (b. 1626)",
    "May 9 – Albrecht of Saxe-Weissenfels, German prince (b. 1659)",
    "May 12 – Princess Luisa Cristina of Savoy, Princess of Savoy (b. 1629)",
    "May 14 – Robert Kirk, Scottish folklorist, Bible translator, Gaelic scholar (b. 1644)",
    "May 18 – Elias Ashmole, English antiquarian (b. 1617)",
    "May 31\nNicholas Dennys, English politician (b. 1616)\nThomas Jones, English politician and judge (b. 1614)",
    "Nicholas Dennys, English politician (b. 1616)",
    "Thomas Jones, English politician and judge (b. 1614)",
    "June 3 – Marie de Bourbon, Countess of Soissons, wife of Thomas Francis (b. 1606)",
    "June 7 – Pierre Bailloquet, Jesuit missionary to the Canadian Indians (b. 1612)",
    "June 9 – Rebecca Rawson, Massachusetts heroine of the 1849 book Leaves from Margaret Smith's Journal (b. 1656)",
    "June 21 – Christian Louis I, Duke of Mecklenburg-Schwerin (1658–1692) (b. 1623)",
    "June 23 – Gerard Langbaine, English dramatic biographer and critic (b. 1656)",
    "July 19 – Rebecca Nurse, accused Massachusetts witch (b. 1621)",
    "July 23 – Gilles Ménage, French scholar (b. 1613)",
    "July 31 – William Harbord, British politician (b. 1635)",
    "August 1 – Sir John Carew, 3rd Baronet, English Member of Parliament (b. 1635)",
    "August 3 – James Douglas, Earl of Angus, Scottish nobleman and soldier (b. 1671)",
    "August 4 – Jean-Michel-d'Astorg Aubarède, Vicar Capitular of Pamiers (b. 1639)",
    "August 14 – Nicolas Chorier, French historian, lawyer and writer (b. 1612)",
    "August 19 – John Proctor, accused Massachusetts wizard (b. 1632)",
    "September 3 – David Ancillon, French Huguenot pastor and author (b. 1617)",
    "September 19 – Giles Corey, Massachusetts farmer and accused wizard (b. c. 1612)",
    "September 21 – Ermes di Colorêt, Italian poet, political figure (b. 1622)",
    "September 22 – Mary Eastey, accused American witch (b. 1634)",
    "October 12 – Giovanni Battista Vitali, Italian composer (b. 1632)",
    "October 23 – Alexander von Spaen, German general (b. 1619)",
    "November 6 – Gédéon Tallemant des Réaux, French writer (b. 1619)",
    "November 19\nThomas Shadwell, English poet and playwright (b. c. 1642)\nPrince Georg Friedrich of Waldeck, Dutch general and German field marshal (b. 1620)",
    "Thomas Shadwell, English poet and playwright (b. c. 1642)",
    "Prince Georg Friedrich of Waldeck, Dutch general and German field marshal (b. 1620)",
    "November 21 – Henry Powle, English politician (b. 1630)",
    "December 3 – Henry Mildmay, English politician (b. 1619)",
    "December 9 – William Mountfort, English actor and dramatist (b. c. 1664)",
    "December 18 – Veit Ludwig von Seckendorff, German statesman (b. 1626)"
  ]
}