{
  "events": [
    "January 7 (December 28, 1694 old style) – The United Kingdom's last joint monarchy, the reign of husband-and-wife King William III and Queen Mary II comes to an end with the death, from smallpox, of Queen Mary, at the age of 32.  Princess Mary, the daughter of King James II, had been installed as the monarch along with her husband and cousin, Willem Hendrik von Oranje, Stadtholder of the Dutch Republic, in 1689 after James was deposed by Willem during the \"Glorious Revolution\".",
    "January 14 (January 4 old style) – The Royal Navy warship HMS Nonsuch, with 36 cannons and a special fast-sailing design, is captured near England's Isles of Scilly by the 48-gun French privateer Le Francois.  Nonsuch is then sold to the French Navy and renamed Le Sans Pareil.[1][2]",
    "January 24 – Milan's Court Theater is destroyed in a fire.",
    "January 27 – A flotilla of six Royal Navy warships under the command of Commodore James Killegrew aboard HMS Plymouth captures two French warships, the Content and the Trident, the day after the French ships had mistaken the English fleet to be a group of merchant ships to attack.",
    "February 6 – Mustafa II (1664 – 1703) succeeds his uncle, Ahmed II as Sultan of the Ottoman Empire.",
    "March 10 – Almost all French Army soldiers in a column of 1,300 troops, commanded by Brigadier General Urbain Le Clerc de Juigné, are killed or captured in the Battle of Sant Esteve d'en Bas against a smaller Spanish Empire force led by Ramon de Sala i Saçala.  The battle, taking place during the War of the Grand Alliance in what is now Catalonia sees 260 of de Juigne's troops killed and 826 becoming prisoners of war.  The Spanish side suffers only seven deaths.",
    "March 7 – John Trevor, Speaker of the English House of Commons, is expelled from the House by vote of the members, after being found guilty of accepting a bribe of 1000 pounds sterling from the City of London Corporation.",
    "March 14 – Paul Foley is elected as the new Speaker of the House after the expulsion of John Trevor.",
    "March 26 – John Hungerford is expelled from the English House of Commons when members vote to find him guilty of accepting a bribe in return for using his committee chairmanship to promote the pending Orphans Bill.",
    "April 17 – The House of Commons of England decides not to renew the Licensing Order of 1643, and states its reasoning, beginning with \"Because it revives, and re-enacts, a Law which in no-wise answered the End for which it was made\" [3]   The lifting of censorship creates a more open society, and an explosion of print results.  Within 30 years, the number of printing houses in England increases from 20 to 103.[4][5]",
    "April 22 – Sürmeli Ali Pasha is fired from his position as Grand Vizier of the Ottoman Empire, after coming into a disagreement with the new Sultan, Mustafa II.  Sürmeli is initially sent into exile, but executed on the Sultan's orders on May 29.",
    "April 27 – Russo-Turkish War (1686–1700): Russia begins the Azov campaigns (1695–96) against the Ottoman Empire, with 31,000 troops departing to the Ottoman fortress at Azov on the Don River.[6]  Tsar Peter the Great marches with the troops but grants himself the rank of a bombardier sergeant within the Preobrazhenskii Regiment, with an \"unwillingness to accept high rank in either army or navy until he felt he had earned it by training and experience.\"[7]  The Russian forces begin their siege on July 15 (July 5 O.S.)  but after more than three months, the siege is discontinued and a new campaign begins on May 3, 1696, ending with the Turkish surrender on July 29.[8]",
    "May 18 – The 7.8 magnitude Linfen earthquake in Shanxi Province, Qing Dynasty kills over 50,000 people.[9]",
    "June 24 – The Commission of Enquiry into the Massacre of Glencoe in Scotland in 1692 reports to the Parliament of England, blaming Sir John Dalrymple, Secretary of State over Scotland, and declares that a soldier should refuse to obey a \"command against the law of nature\".",
    "July 12 – The Siege of Namur begins in the Spanish Netherlands (now Belgium) [10]",
    "July 15 – The siege of the Ottoman fortress at Azaq by the Russian Army begins  but is unsuccessful and is discontinued after October 2 (September 22 O.S.) [11][8]",
    "July 17 – The Bank of Scotland is founded.",
    "August 8 – The Wren Building is started in Williamsburg, Virginia (completed in 1700).",
    "August 13–15 – Nine Years' War: Brussels is bombarded by French troops.",
    "September 1 – Nine Years' War: France surrenders Namur, Spanish Netherlands to forces of the Grand Alliance, led by King William III of England, Stadtholder of the Dutch Republic, following the 2-month Siege of Namur.[10]",
    "September 7 – English pirate Henry Every perpetrates one of the most profitable raids in history, with the capture of the Grand Mughal ship Ganj-i-Sawai. In response, Emperor Aurangzeb threatens to put an end to all English trading in India.",
    "September 24 – All but eight of the remaining 305 crew of the Royal Navy ship HMS Winchester (1693) are killed when the ship founders in the Florida Keys.  According to the ship's logbook, an epidemic of yellow fever began on August 1 and had killed 45 people before the hurricane struck, and left all but seven crew members too ill to walk.[12][13][14]",
    "October 11 – King William III of England dissolves Parliament in the wake of a scandal involving former Speaker of the House of Commons John Trevor and other Tory MPs.",
    "October 25 – The 48-gun English Navy ship HMS Berkeley Castle is captured by the French Navy.",
    "November 22 – The new Parliament, with 513 members of the House of Commons is opened by King William III.  Commons is composed of 257 Whigs (who hold a majority of one), 203 Tories and 53 members of other parties or independents.",
    "December 31 – A window tax is imposed in England.[10] Some windows are bricked up to avoid it.",
    "English manufacturers call for an embargo on Indian cloth, and silk weavers picket the House of Commons of England.",
    "A £2 fine is imposed for swearing in England.",
    "After 23 years of construction, Spain completes Castillo de San Marcos to protect St. Augustine, Florida, from foreign threats.",
    "After many years of construction, the Potala Palace in Lhasa is completed.",
    "Gold is discovered in Brazil.",
    "Johanne Nielsdatter is executed for witchcraft, the last such confirmed execution in Norway.",
    "In Amsterdam, the bank Wed. Jean Deutz & Sn. floats the first sovereign bonds on the local market. The scheme is designed to fund a 1.5 million guilder loan to the Holy Roman Emperor. From this date on, European leaders commonly take advantage of the low interest rates available in the Dutch Republic, and borrow several hundred millions on the Dutch capital market.[15]",
    "The Great Famine of 1695–1697 begins as the Great Famine of Estonia (1695–97) in Swedish Estonia and spreads across Finland, Latvia, Norway and Sweden, while the \"seven ill years\" of famine in Scotland are ongoing."
  ],
  "births": [
    "February 2 – William Borlase, English naturalist (d. 1772)",
    "February 6 – Nicolaus II Bernoulli, Swiss mathematician (d. 1726)",
    "March 9 – Martín Sarmiento, Spanish scholar and writer (d. 1772)",
    "March 15 – Alexander Joseph Sulkowski, Polish and Saxon general (d. 1762)",
    "April 8 – Johann Christian Günther, German poet (d. 1723)",
    "May 2 – Giovanni Niccolò Servandoni, French architect and painter (d. 1766)",
    "May 3 – Henri Pitot, French engineer (d. 1771)",
    "June 6 – Adriaan Valckenier, Dutch Governor-General of the Dutch East Indies (1737-1741) (d. 1751)",
    "July 17 – Alexandre de Gusmão, Portuguese diplomat (d. 1753)",
    "September 3 – Pietro Locatelli, Italian composer (d. 1764)",
    "September 5 – Carl Gustaf Tessin, Swedish politician (d. 1770)",
    "October 5 – John Glas, Scottish minister (d. 1773)",
    "November 10 – John Bevis, English physician and astronomer (d. 1771)",
    "date unknown – Hedvig Catharina De la Gardie, Swedish salonnière  (d. 1745)\nCai Wan, politically influential Chinese poet (d. 1755)",
    "Cai Wan, politically influential Chinese poet (d. 1755)"
  ],
  "deaths": [
    "January 4 – François-Henri de Montmorency, duc de Luxembourg, Marshal of France (b. 1628)",
    "January 16 – Hans Adam Weissenkircher, Austrian painter (b. 1646)",
    "January 29 – Paul Hermann, German botanist (b. 1646)",
    "February 6 – Ahmed II of Turkey (b. 1643)",
    "February 14 – Georg von Derfflinger, field marshal in the army of Brandenburg-Prussia (b. 1606)",
    "February 18 – Sir William Phips, governor of Massachusetts (b. 1650)",
    "March 5 – Henry Wharton, English writer (b. 1664)",
    "April 3 – Melchior d'Hondecoeter, Dutch painter (b. c. 1636)",
    "April 5 – George Savile, 1st Marquess of Halifax, English writer and statesman (b. 1633)",
    "April 6 – Richard Busby, English clergyman (b. 1606)",
    "April 13 – Jean de La Fontaine, French writer (b. 1621)",
    "April 17 – Juana Inés de la Cruz, Mexican nun, writer and poet (b. 1651)",
    "April 27 – John Trenchard, English statesman (b. 1640)",
    "April 28 – Henry Vaughan, Welsh poet (b. 1621)",
    "May 9 – Lambert van Haven, Danish architect (b. 1630)",
    "May 17 – Cornelis de Heem, Dutch painter (b. 1631)",
    "May 30 – Pierre Mignard, French painter (b. 1612)",
    "June 11 – André Félibien, French architect (b. 1619)",
    "July 8 – Christiaan Huygens, Dutch mathematician and physicist who developed the wave theory of light (b. 1629)",
    "July 18 – Johannes Camphuys, Governor-General of the Dutch East Indies (b. 1634)",
    "August 2 – Mattia de Rossi, Italian painter (b. 1637)",
    "August 6\nFrançois de Harlay de Champvallon, Archbishop of Paris (b. 1625)\nThomas Moore, English politician (b. 1618)",
    "François de Harlay de Champvallon, Archbishop of Paris (b. 1625)",
    "Thomas Moore, English politician (b. 1618)",
    "August 12 – Huang Zongxi, Chinese political theorist, philosopher, writer, and soldier (b. 1610)",
    "August 19 – Christopher Merret, English physician and scientist (b. 1614)",
    "August 20 – Giuseppe Francesco Borri, Italian alchemist (b. 1627)",
    "September – Thomas Tew, English pirate",
    "October 6 – Gustav Adolph, Duke of Mecklenburg-Güstrow and last Administrator of Ratzeburg (b. 1633)",
    "October 16 – William Wentworth, 2nd Earl of Strafford, member of England's House of Lords (b. 1626)",
    "October 17 – Arthur Rawdon, English Member of Parliament (b. 1662)",
    "October 19 – Johann Wilhelm Baier, German theologian (b. 1647)",
    "October 21 – Johann Arnold Nering, German architect (b. 1659)",
    "November 16 – Pierre Nicole, French Jansensist (b. 1625)",
    "November 20 – Zumbi, Brazilian leader of a runaway slave colony (b. 1655)",
    "November 21 – Henry Purcell, English composer (b. 1659)",
    "November 22 – Francis Nurse, husband of Rebecca Nurse (accused during the Salem Witch Trials of 1692), (b. 1618)",
    "November 28 – Anthony Wood, English antiquarian (b. 1632)",
    "November 29 – James Dalrymple, 1st Viscount Stair, Scottish lawyer and statesman (b. 1619)",
    "December 8 – Barthélemy d'Herbelot de Molainville, French orientalist (b. 1625)",
    "December 12 – Jacob Abendana, British rabbi (b. 1630)",
    "December 15 – Richard Hampden, English politician (b. 1631)",
    "December 24 – Louis Thomassin, French bishop and theologian (b. 1619)"
  ]
}