{
  "events": [
    "January 8 – Scottish student Thomas Aikenhead is hanged outside Edinburgh, becoming the last person in Great Britain to be executed for blasphemy.",
    "January 11 – French writer Charles Perrault, through publisher Claude Barbin, releases the book Histoires ou contes du temps passé (literally \"Tales of Past Times\"), known in England as \"Mother Goose tales\") in Paris, a collection of popular fairy tales, including Cinderella, Puss in Boots, Red Riding Hood, The Sleeping Beauty and Bluebeard.  [1]",
    "February 8 – The English infantry regiment of Arthur Chichester, 3rd Earl of Donegall is disbanded four years after it was first raised.  Donegall will raise a second regiment in 1701.",
    "February 22 – Gerrit de Heere becomes the new Governor of Dutch Ceylon (primarily the coast, but not the interior of modern Sri Lanka), succeeding Thomas van Rhee and administering the colony for almost six years until his death.",
    "February 26 – Spanish conquistador Martín de Ursúa y Arizmendi and 114 soldiers arrive at Lake Petén Itzá in what is now Guatemala and begin the conquest of the Mayas with an attack on the capital of the Itza people there before moving northward to the Yucatan peninsula.",
    "March 9 – Grand Embassy of Peter the Great: Tsar Peter the Great of Russia sets out to travel in Europe incognito, as Artilleryman Pjotr Mikhailov.",
    "March 13 – The Spanish conquest of Petén, and of Yucatán, is completed with the fall of Nojpetén, capital of the Itza Maya Kingdom, the last independent Maya state.",
    "March 22 – Charles II of Spain issues a Royal Cedula extending to the indigenous nobles of the Spanish Crown colonies, as well as to their descendants, the preeminence and honors customarily attributed to the Hidalgos of Castile.",
    "March 26 – Safavid occupation of Basra: Safavid government troops take control of Basra.",
    "April 5 – Charles XII, the Swedish Meteor, becomes king of Sweden at age 14 on the death of his father, Charles XI.",
    "April 23 – As Chinese troops from the Manchu Dynasty (ruled by the Emperor Kangxi) complete their conquest of Mongolia, Galdan Boshugtu Khan, ruler of the last part of Mongolia to be conquered, the Dzungar Khanate, poisons himself, ending the resistance to conquest.  [2]",
    "May 6 – General Bernard Desjean, Baron de Pointis of France carries out an attack and pillaging on the Spanish fort of Cartagena de Indias (now the city of Cartagena in Colombia) with 1,200 soldiers and 650 pirate mercenaries and overwhelms the city over the next 18 days.  The Baron cheats the pirates and reneges on a contract to share the wealth, and the pirates come back to Cartagena a second time and makes a more violent attack.",
    "May 17 (May 7 Old Style) – The 13th century royal Tre Kronor (\"Three Crowns\") castle in Stockholm burns to the ground. A large portion of the royal library is destroyed.",
    "June 10 – The last mass execution for witchcraft in western Europe when five Paisley witches are hanged and then burned in Scotland.",
    "June 27 – Augustus II the Strong is elected King of Poland after converting to Roman Catholicism on June 2.",
    "June 30 – The earliest reported first-class cricket match takes place in Sussex in England.  The Foreign Post of July 7, 1697, notes that \"The middle of last week a great match at cricket was played in Sussex; there were eleven of a side, and they played for fifty guineas apiece\".",
    "July 4 – A Byzantine icon, the \"Weeping Madonna of Pócs, arrives in Vienna after a five-month journey following its forced removal from the Hungarian village of Pócs by order of the Holy Roman Emperor, Leopold I.  It has been housed for more than 320 years in St. Stephen's Cathedral.",
    "July 6 – A major naval battle takes place between the Republic of Venice and the Ottoman Empire with each side having 25 battleships, supplemented by smaller vessels.  The Venetian Navy, under the command of Admiral Bartolomeo Contarini, suffers 71 deaths and 163 injuries, and even worse casualties in a second engagement on September 20.  The extent of Turkish casualties is not reported. [3]",
    "July 27 – Mahmud Shah II, the Sultan of Johor and Pahang (now part of Malaysia) takes on full power upon the death of the regent, the Bendahara Paduka Raja.  Mahmud II was only 10 years old when he became the Sultan upon the assassination of his father, Ibrahim Shah in 1685.",
    "July 28 – The opera Vénus et Adonis, composed by Henri Desmarets with libretto by Jean-Baptiste Rousseau, receives its first performance, premiering at the Théâtre du Palais-Royal in Paris.  After 250 years of obscurity, it will be revived in 2006.",
    "August 10 – The Siege of Barcelona, ends in Spain after 52 days as Louis Joseph, Duke of Vendôme of France obtains the surrender of Barcelona from the Austrian General, Prince George of Hesse-Darmstadt.",
    "September 5 (August 25 old style) – During the Nine Years' War, the Battle of Hudson's Bay is fought between English and French ships in Hudson Bay near what is now the Canadian province of Manitoba; The French warship Pélican captures York Factory, a trading post of the English Hudson's Bay Company in modern-day Manitoba (Canada).",
    "September 11 – Battle of Zenta: Prince Eugene of Savoy crushes the Ottoman army of Mustafa II, and effectively ends Turkish hopes of recovering lost ground in Hungary.",
    "September 17 – Amcazade Köprülü Hüseyin Pasha becomes the new Grand Vizier of the Ottoman Empire in the wake of the disastrous Ottoman defeat at Zenta, replacing Grand Vizier Elmas Mehmed Pasha, who was killed in the battle by his own troops.",
    "September 20 – The Treaty of Ryswick is signed by France and the Grand Alliance, to end both the Nine Years' War and King William's War. The conflict having been inconclusive, the treaty is proposed because the combatants have exhausted their national treasuries. Louis XIV of France recognises William III as King of England & Scotland, and both sides return territories they have taken in battle. In North America, the treaty returns Port-Royal (Acadia) to France. In practice, the treaty is little more than a truce; it does not resolve any of the fundamental colonial problems, and the peace lasts only five years.",
    "October 7 – The opera Issé, composed by André Cardinal Destouches with libretto by Antoine Houdar de la Motte, premieres at the Palace of Fontainebleau in France.",
    "October 16 – The Norwegian Code, promulgated by King Christian V of Denmark for Norway in 1687, is amended to provide for torture of condemned criminals in certain capital offenses in Norway, with permission for burning with hot irons, or cutting off the prisoner's right hand while the prisoner is being transported for decapitation.  [4]",
    "October 19 – Misión Loreto, the first Roman Catholic mission on Mexico's Baja California Peninsula, is founded by Spanish missionary Juan María de Salvatierra.",
    "October 24 – The first opéra-ballet, combining elements of both mediums of entertainment, is performed as L'Europe galante makes its debut at the Salle du Palais-Royal in Paris. Composed by André Campra, with libretto by Antoine Houdar de la Motte, the opera and ballet is conducted by Marin Marais.",
    "October 30 – The Nine Years' War, between France and the Grand Alliance (England, Spain, Austria, and the Dutch Republic) comes to an end with the signing of the signing of the last pacts of the Peace of Ryswick in the Dutch city of Rijswijk as Leopold I of Austria accedes two days before a deadline that had been set by the other members of the Grand Alliance.  The areas of the Duchy of Lorraine (Lotharingen), Freiburg im Breisgau, and Vieux-Brisach (Breisach) are returned by France to Leopold's control.",
    "November 18 – Robert Bedingfield, a high-ranking member of the Worshipful Company of Merchant Taylors, is knighted in England by King William III.",
    "November 24 – The elaborate burial of the late King Charles XI of Sweden takes place more than seven months after his April 5 death, with interment at the Riddarholmen Church on the island of Riddarholmen near Stockholm.",
    "November 30 – Prince Eugene of Savoy, a field marshal within the Holy Roman Empire, purchases a large tract of land in Vienna for construction of the Belvedere Palace.",
    "December 2 – First service (to celebrate the Treaty of Ryswick) held in St Paul's Cathedral since rebuilding work after the Great Fire of London began.[5]",
    "December 7 – Louis, Duke of Burgundy, and Marie Adélaïde of Savoy marry in the royal chapel at the Palace of Versailles in France.",
    "December 8 – Tsangyang Gyatso is installed in Tibet as the 6th Dalai Lama in a ceremony at Lhasa, filling a vacancy that had existed since 1682. [6]",
    "December 11 – A ball in the Hall of Mirrors at the Palace of Versailles is held to celebrate the Duke of Burgundy and Marie Adélaïde's wedding.",
    "December 14 – The coronation ceremony takes place for King Charles XII of Sweden.",
    "The Manchus of the Qing dynasty conquer Outer Mongolia.",
    "The British government passes the Trade with Africa Act 1697 (An Act to settle the Trade to Africa), confirming the Royal African Company's loss of monopoly on the Atlantic slave trade.",
    "Christopher Polhem starts Sweden's first technical school.",
    "Heinrich Escher, Mayor of Zürich, introduces chocolate to Switzerland from Brussels.[7]",
    "The use of \"litters\" (wheel-less transports that carried by four servants) increases in Europe.",
    "Great Famine of 1695–1697 in Scandinavia.",
    "Great Famine of Estonia (1695–97).",
    "\"Seven ill years\" of famine in Scotland."
  ],
  "births": [
    "January 30 – Johann Joachim Quantz, German flautist and composer (d. 1773)",
    "February 24 – Bernhard Siegfried Albinus, German anatomist (d. 1770)",
    "March 8? – Anne Bonny, Irish-born pirate (d. after 1721)[8]",
    "March 9 – Friederike Caroline Neuber, German actress (d. 1760)",
    "May 10 – Jean-Marie Leclair, French violinist and composer (k. 1764)",
    "August 6 – Charles VII, Holy Roman Emperor (d. 1745)",
    "October 7 – Canaletto, Italian artist (d. 1768)",
    "October 22 – Catharina von Schlegel, German hymn writer (d. after 1768)",
    "October 26 – John Peter Zenger, German American newspaper printer (d. 1746)",
    "November 10 – William Hogarth, English artist (d. 1764)"
  ],
  "deaths": [
    "January 8 – Thomas Aikenhead, Scottish student (hanged) (b. c. 1678)",
    "January 12 – Andrzej Stech, Polish painter (b. 1635)",
    "January 26 – Georg Mohr, Danish mathematician (b. 1640)",
    "January 28 – John Fenwick, English conspirator (b. c. 1645)",
    "February 4 – Adrien de Wignacourt, French 63rd Grandmaster of the Knights Hospitaller (b. 1618)",
    "February 5 – Esaias Fleischer, Danish priest (b. 1633)",
    "February 11 – Georg Händel, German musician (b. 1622)",
    "February 17 – Francis Dane, American colonial priest (b. 1615)",
    "March 1 – Francesco Redi, Italian physician (b. 1626)",
    "March 12 – Gaspar de la Cerda, 8th Count of Galve (b. 1653)",
    "March 19 – Nicolaus Bruhns, German organist and composer (b. 1665)",
    "March 26 – Godfrey McCulloch, Scottish politician and murderer (executed) (b. 1640)",
    "March 27 – Simon Bradstreet, English colonial magistrate (b. 1603)",
    "April 4 – Andrea Carlone, Italian painter (b. 1626)",
    "April 5 – King Charles XI of Sweden (b. 1655)",
    "April 8 – Niels Juel, Danish admiral (b. 1629)",
    "May 2 – Simon Henry, Count of Lippe-Detmold (1666–1697) (b. 1649)",
    "May 8 – Sir Richard Temple, 3rd Baronet,  English Member of Parliament (b. 1634)",
    "May 24 – Johann Adolf I, Duke of Saxe-Weissenfels, German duke (b. 1649)",
    "June 3 – Silvius II Frederick, Duke of Württemberg-Oels (b. 1651)",
    "June 7 – John Aubrey, English antiquary and writer (b. 1626)",
    "June 10 – Francis Pemberton, English judge, Lord Chief Justice of the King's Bench (b. 1624)",
    "June 12 – Ann Baynard, English natural philosopher (b. 1672)",
    "June 18 – Gregorio Barbarigo, Italian Catholic saint (b. 1625)",
    "June 19 – Henry Mordaunt, 2nd Earl of Peterborough, English diplomat (b. 1621)",
    "June 21 – Joseph Anthelmi, French ecclesiastical historian (b. 1648)",
    "July 18\nThomas Dolman, English politician (b. 1622)\nAntónio Vieira, Portuguese writer (b. 1608)",
    "Thomas Dolman, English politician (b. 1622)",
    "António Vieira, Portuguese writer (b. 1608)",
    "July 30 – Lorentz Mortensen Angell, Norwegian merchant and landowner (b. 1626)",
    "August 5 – Jean-Baptiste de Santeul, French writer (b. 1630)",
    "November 8 – Samuel Enys, English politician (b. 1611)",
    "November 22 – Libéral Bruant, French architect (b. c. 1635)",
    "December 17 – Eleanor of Austria, Queen of Poland (b. 1653)",
    "December 20 – Frederick Charles, Duke of Württemberg-Winnental (b. 1652)",
    "December 31 – Lucas Faydherbe, Belgian sculptor and architect (b. 1617)",
    "date unknown –  Karin Thomasdotter, Finnish official (b. 1610)"
  ]
}