{
  "events": [
    "January 20 – The Parliament of England (under Tory dominance) limits the size of the country's standing army to 7,000 'native born' men;[1] hence, King William III's Dutch Blue Guards cannot serve in the line. By an Act of February 1, it also requires disbandment of foreign troops in Ireland.[2]",
    "January 26 – The Republic of Venice, Polish–Lithuanian Commonwealth and Holy Roman Empire sign the Treaty of Karlowitz with the Ottoman Empire, marking an end to the major phase of the Ottoman–Habsburg wars, including the Morean War between Venice and the Ottomans. The Ottoman Turks cede to Austria all their former territories in Transylvania, Slavonia, Croatia and the whole of Hungary, except for the Banat of Temeswar. The Peloponnese and Dalmatia are ceded to Venice. Large parts of the Ukraine are ceded to Poland. The treaty marks a major geopolitical shift, as the Ottoman Empire subsequently abandons its expansionism and adopts a defensive posture while the Habsburg Monarchy expands its influence.",
    "January 26 – A magnitude 9.0 earthquake strikes the Pacific Northwest of North America.[3]",
    "February 4 – 350 rebellious Streltsy are executed in Moscow.",
    "March 2 – The Edinburgh Gazette is first published in Scotland.",
    "March 4 – Jews are expelled from Lübeck, Germany.[4]",
    "April 13 – The 10th Sikh Master, Guru Gobind Singh, creates the Khalsa at Anandpur Sahib.",
    "May 1 – Pierre Le Moyne d'Iberville founds the first European settlement in the Mississippi River Valley, at Fort Maurepas (Ocean Springs, Mississippi).",
    "May 10 – Billingsgate Fish Market in London is sanctioned as a permanent institution, by an Act of Parliament, with the provision \"that after the tenth of May, 1699, Billingsgate Market should be, every day in the week except Sunday, a free and open market for all sorts of fish, and that it should be lawful for any person to buy or sell any sort of fish without disturbance.\" The Nineteenth Century (Henry S. King & Company, 1883) p. 146",
    "June 11 – England, France and the Dutch Republic agree on the terms of the Treaty of London (1700) (Second Partition Treaty) for Spain.[5]",
    "June 14 – Thomas Savery demonstrates his first steam pump to the Royal Society of London.",
    "July 6 – Pirate Captain William Kidd is arrested and imprisoned in Boston, Massachusetts.",
    "July 26 – William Dampier's expedition to New Holland (Australia), in HMS Roebuck, reaches Dirk Hartog Island, at the mouth of what he calls Shark Bay in Western Australia, and he begins producing the first known detailed record of Australian flora and fauna.[6]",
    "August 25 – Christian V, King of Denmark–Norway since 1670, dies and is succeeded by his son, Frederick IV (to 1730).",
    "September 22 – Citizens of Rotterdam, Netherlands strike over the high price of butter.",
    "October 3 – The Liverpool Merchant, the first slave ship from the port of Liverpool in England, departs to imprison captured West Africans and transport them to the British colonies, arriving in Barbados on September 18, 1700 with 220 slaves.",
    "October 11 – The opera Marthésie, première reine des Amazones (Marthesia, First Queen of the Amazons), composed by André Cardinal Destouches, is performed for the first time, premiering at Fontainebleau near Paris",
    "October – An edict by King Louis XIV establishes an office of police magistrate in almost ever village in France, with the title of lieutenant general de police created, providing for nationwide law enforcement. [7]",
    "November 22 – The Treaty of Preobrazhenskoye, negotiated by Johann Patkul, is signed at a palace of the Tsar of Russia Peter the Great, and representatives of Augustus the Strong, Elector of Saxony, King of Poland and Elector of Saxony to provide for the partition of Swedish Empire between Saxony, the Polish-Lithuanian Commonwealth, the Kingdom of Denmark and the Russia Empire.  The attack on Sweden, which takes place on February 22, starts the Great Northern War that will last for more than 21 years.",
    "December 3 – Baron Jacob Hop is appointed as the treasurer-general of The Hague.",
    "December 20 – Peter the Great orders the Russian New Year changed, from 1 September to 1 January."
  ],
  "births": [
    "March 23 – John Bartram, American botanist (d. 1777)",
    "March 25 – Johann Adolph Hasse, German composer (d. 1783)",
    "April 17 – Robert Blair, Scottish poet and cleric (d. 1746)",
    "May 13 – Marquis of Pombal, Prime Minister of Portugal (d. 1782)",
    "May 14 – Hans Joachim von Zieten, Prussian field marshal (d. 1786)",
    "June 26 – Marie Thérèse Rodet Geoffrin, French salon holder (d. 1777)",
    "October 13 – Jeanne Quinault, French actress and playwright (d. 1783)",
    "November 2 – Jean-Baptiste-Siméon Chardin, French painter (d. 1779)",
    "November 25 – Pierre Subleyras, French painter (d. 1749)",
    "November 30 – King Christian VI of Denmark (d. 1746)",
    "December 19 – William Bowyer, English printer (d. 1777)"
  ],
  "deaths": [
    "January 3 – Mattia Preti, Italian painter (b. 1613)",
    "January 14 – Federico Caccia, Cardinal Archbishop of Milan (b. 1635)",
    "January 21 – Obadiah Walker, English writer (b. 1616)",
    "January 23 – Kinoshita Jun'an, Japanese philosopher and Confucian scholar (b. 1621)",
    "January 27 – Sir William Temple, 1st Baronet, English statesman and essayist (b. 1628)",
    "February 1\nThomas Chicheley, English politician  (b. 1614)\nManuel Fernández de Santa Cruz, Spanish religious writer, Catholic prelate and bishop (b. 1637)",
    "Thomas Chicheley, English politician  (b. 1614)",
    "Manuel Fernández de Santa Cruz, Spanish religious writer, Catholic prelate and bishop (b. 1637)",
    "February 20 – Jean-Baptiste Monnoyer, French painter (b. 1636)",
    "March 12 – Peder Griffenfeld, Danish statesman (b. 1635)",
    "April 13 – Hans Rosing, Norwegian bishop (b. 1625)",
    "March 17 – Serafina of God, founder of seven Carmelite monasteries of nuns in southern Italy (b. 1621)",
    "March 20 – Erhard Weigel, German mathematician, astronomer and philosopher (b. 1625)",
    "March 27 – Edward Stillingfleet, British theologian and scholar (b. 1635)",
    "April 21 – Jean Racine, French classic dramatist (b. 1639)",
    "April 22 – Hans Erasmus Aßmann, Freiherr von Abschatz, German statesman and poet (b. 1646)",
    "May 12 – Lucas Achtschellinck, Flemish painter (b. 1626)",
    "May 15 – Sir Edward Petre, 3rd Baronet, English Jesuit, privy councillor (b. 1631)",
    "May 16 – Christine Charlotte of Württemberg, Regent of East Frisia (b. 1645)",
    "May 22 – James Bertie, 1st Earl of Abingdon, English nobleman (b. 1653)",
    "May 25 – Bussy Mansell, Welsh Member of the English Parliament (b. 1623)",
    "June 1 – George II, Duke of Württemberg-Montbéliard (1662–1699) (b. 1626)",
    "June 16 – Constantin Marselis, Danish baron (b. 1647)",
    "June 22\nJosiah Child, English Governor of the East India Company (b. 1630)\nFernando de Meneses, 2nd Count of Ericeira, Portuguese noble (b. 1614)",
    "Josiah Child, English Governor of the East India Company (b. 1630)",
    "Fernando de Meneses, 2nd Count of Ericeira, Portuguese noble (b. 1614)",
    "July 1\nLodewijck Huygens, Dutch diplomat (b. 1631)\nTokugawa Tsunanari, Japanese daimyō (b. 1652)",
    "Lodewijck Huygens, Dutch diplomat (b. 1631)",
    "Tokugawa Tsunanari, Japanese daimyō (b. 1652)",
    "July 2 – Hortense Mancini, favourite Italian niece of Cardinal Mazarin (b. 1646)",
    "July 10 – Pier Martire Armani, Italian painter (b. 1613)",
    "August 4 – Maria Sophia of Neuburg, Queen consort of Portugal (b. 1666)",
    "August 6 – Albert V, Duke of Saxe-Coburg (b. 1648)",
    "August 13 – Marco d'Aviano, Italian Capuchin friar (b. 1631)",
    "August 19 – José Saenz d'Aguirre, Spanish Catholic cardinal (b. 1630)",
    "August 24 – Lucrezia Barberini, Duchess of Modena (b. 1628)",
    "August 25 – Christian V, King of Denmark and Norway (b. 1646)",
    "September 8 – Gottfried Wilhelm Sacer, German jurist (b. 1635)",
    "September 17 – Augustus, Duke of Schleswig-Holstein-Sonderburg-Plön-Norburg (b. 1635)",
    "September 26 – Simon Arnauld de Pomponne, French diplomat and minister (b. 1618)",
    "October 4 – George Evelyn, English politician (b. 1617)",
    "October 8 – Mary Beale, British artist (b. 1633)",
    "November 2 – Anthony Ashley-Cooper, 2nd Earl of Shaftesbury, English politician (b. 1652)",
    "November 23 – Joseph Beaumont, British academic and poet (b. 1616)",
    "November 29 – Patrick Gordon, Scottish general (b. 1635)",
    "December 7 – Sigmund von Erlach, Swiss politician (b. 1614)",
    "December 17 – John Francis Desideratus, Prince of Nassau-Siegen (1652–1699) (b. 1627)",
    "Henry Every, English pirate (b. 1659)"
  ]
}