{
  "events": [
    "January 1 –  Protestant nations in Western Europe, except England, start using the Gregorian calendar.  Catholic nations had been using the Gregorian calendar since its introduction in 1582 by Pope Gregory XIII.",
    "January 1 (Julian) (January 11, Gregorian)– The Tsardom of Russia begins numbering its calendar from the birth of Christ (Anno Domini), instead of since the Creation (Anno Mundi).",
    "January 26 – At approximately 9 p.m., the Cascadia earthquake occurs, with an estimated moment magnitude of 8.7–9.2. This megathrust earthquake ruptures about 1,000 kilometers (620 miles) of the Cascadia Subduction Zone and causes a tsunami, that strikes the coast of Japan approximately 10 hours later.",
    "February 3 – The 'Lesser Great Fire' destroys a substantial part of central Edinburgh, Scotland.[1]",
    "February 12 – The Great Northern War begins with a joint invasion of Swedish territory in Germany and Latvia, by Denmark and Poland/Saxony. Sweden has control of the Baltic Sea and holds territory that includes Finland, Estonia, Latvia and parts of northern Germany. To challenge its power, an alliance is formed between Tsar Peter I of Russia, King Frederick IV of Denmark and Augustus II the Strong, King of Poland and Elector of Saxony. Sweden's ruler is the militaristic Charles XII, known as the \"Swedish Meteor\".",
    "February 27 – The island of New Britain is discovered by William Dampier, in the western Pacific.[2]",
    "March 1 (Gregorian) – Protestant Germany and Denmark–Norway adopt the Gregorian calendar.",
    "March 1 (Swedish), March 11 (Gregorian), February 29 (Julian) – The Swedish calendar is adopted.",
    "March 3 - Shivaji II accedes to the throne of the Maratha Empire as the 4th Chhatrapati after his father Rajaram I's death.",
    "March 25 – The Treaty of London is signed between France, England and Holland.[3]",
    "March – William Congreve's comedy The Way of the World is first performed in London.[4][5]  Samuel Johnson writes later that it was \"Probably produced in the first week of March, 1700, as the book of the play was published March 28th, 1700.\"[6]",
    "April 15 – The coronation of King Frederick IV of Denmark takes place at Frederiksborg Castle in Copenhagen.",
    "April 18 – Hungarian freedom activist Ferenc Rákóczi is arrested by Austrian authorities and charged with sedition.  Imprisoned near Vienna and facing a death sentence, he escapes and later leads the overthrow of the Habsburg control of Hungary.",
    "April 21 – In India, the siege of the fortress of Sajjangad (located in the Maharashtra state) is begun by an army led by Fateullahakhan.  The fortress falls on June 6.",
    "April – Fire destroys many buildings in Gondar, the capital of Ethiopia, including two in the palace complex.",
    "May 5\nWithin a few days of John Dryden's death (May 1 O.S.), his last written work (The Secular Masque) is performed as part of Vanbrugh's version of The Pilgrim.\nWilliam Penn begins monthly meetings for blacks advocating emancipation.",
    "Within a few days of John Dryden's death (May 1 O.S.), his last written work (The Secular Masque) is performed as part of Vanbrugh's version of The Pilgrim.",
    "William Penn begins monthly meetings for blacks advocating emancipation.",
    "May – In Rhode Island (American colony), Walter Clarke, three term former Governor of the Colony of Rhode Island and Providence Plantations, is elected deputy governor for the second time, serving under his brother-in-law Samuel Cranston.",
    "June 8 (May 28 O.S.) – The legislature for the Province of Massachusetts Bay (now the Commonwealth of Massachusetts in the U.S.) passes into law \"An Act against Jesuits & Popish Priests\" making a finding that Roman Catholic clerics have attempted to incite American Indians into a rebellion against the Crown, and declaring \"That all and every Jesuit, Seminary Priest, Missionary, or other Spiritual or Ecclesiastical Person made or ordained by any Authority, Power or Jurisdiction derived, challenged or pretended from the Pope or See of Rome, now residing within this Province or any part thereof, shall depart from and out of the same, at or before the tenth day of September next, in this present year, One Thousand and Seven Hundred.\"[7] The Province of New York enacts similar legislation later in the year.",
    "July 11 – The Prussian Academy of Sciences is founded, with Gottfried Leibniz as president.[8]",
    "July 24 - Charles XII of Sweden counter-attacks his enemies by invading Zealand (Denmark), assisted by an Anglo-Dutch naval squadron under Sir George Rooke, rapidly compelling the Danes to submit to peace. [9]",
    "July 30 - Eleven-year-old Prince William, Duke of Gloucester died at Windsor Castle, Windsor, Berkshire.",
    "August 18 (August 7 O.S.) – The Peace of Travendal is concluded between the Swedish Empire, Denmark–Norway and Holstein-Gottorp in Traventhal. On the same day, Augustus II, King of Poland, and Peter the Great, Tsar of Russia, enter the war against Sweden.",
    "September 6 – Edmond Halley returns to England after a voyage of almost one year on the ship Paramour and publishes his findings on terrestrial magnetism in General Chart of the Variation of the Compass.",
    "September 12 – Antioh Cantemir is deposed as the voivode of Moldavia and replaced by his predecessor Constantine Ducas.",
    "September 27 – Pope Innocent XII dies at the age of 85 after a tenure of more than nine years.  Fabrizio Spada, the Cardinal Secretary of State, assumes administration of the Roman Catholic Church in order to oversee the election of a new Pope.",
    "September – A Russian army invades Swedish Estonia, and besieges the town of Narva. [10]",
    "October 3 – The Battle of Jouami' al-Ulama takes place in Algeria with a surprise attack and ambush on the army of Murad III Bey of Tunis by two Algerian defendars, Hadj Mustapha, Dey of Algiers and Ahmed ben Ferhat, Beylik of Constantine.",
    "October 16 - Adrian, Patriarch of All Russia, dies after more than 10 years as head of the Russian Orthodox Church.  He is replaced by the hand-picked choice of the Tsar, Peter the Great with the appointment of Simeon Ivanovich Yavorsky as the Patriarch Stefan.",
    "November 1 – Charles II, the last Spanish king of the House of Habsburg, dies insane at the Royal Alcazar of Madrid (aged 38), leaving no children.",
    "November 15 – Louis XIV accepts the Spanish crown on behalf of his grandson Philip of Anjou, who becomes Philip V of Spain (to 1746), thus triggering the War of the Spanish Succession (1701-1714).",
    "November 18 – Lithuanian Civil War – Battle of Valkininkai: The anti-Sapieha coalition is victorious.",
    "November 23 – Giovanni Francesco Albani, having been ordained as a Roman Catholic priest only two months earlier, is elected by the Papal conclave to succeed Pope Innocent XII, and becomes the 243rd pope, taking the name of Clement XI.",
    "November 30 (November 19 O.S.; November 20 Swedish calendar) – Battle of Narva, Estonia: Having led his army of 8,000 on a forced march from Denmark to Estonia, Charles XII of Sweden routs the huge Russian army.",
    "December 8 – The formal coronation of Pope Clement XI takes place in Rome.",
    "December 28 – Laurence Hyde, 1st Earl of Rochester, Lord President of the Council in charge of the Privy Council, is appointed to the additional job of Lord Lieutenant of Ireland, the highest Crown official in charge of administration of Ireland, .",
    "December 30 (December 19, O.S.) – The 4th Parliament of King William III is dissolved and new elections are ordered by the King.",
    "Mission San Xavier del Bac is founded in New Spain near Tucson, as a Spanish Roman Catholic mission.  The mission's location had first been scouted by the Spanish in 1692 according to most historians.",
    "An inventory made for the House of Medici of Florence is the first documentary evidence for a piano, invented by their instrument keeper Bartolomeo Cristofori.",
    "An English translation of the novel Don Quixote, \"translated from the original by many hands and published by Peter Motteux\", begins publication in London. While popular among readers, it will eventually come to be known as one of the worst translations of the novel, totally betraying the spirit of Miguel de Cervantes's masterpiece.",
    "The value of sales of English manufactured products to the Atlantic economy is £3.9 million.",
    "Lions become extinct in Libya."
  ],
  "births": [
    "January 8 – Augustyn Mirys, Polish painter (d. 1790)",
    "January 14 – Picander (d. 1764)",
    "January 23 – John Christian, Count Palatine of Sulzbach from 1732 to 1733 (d. 1733)",
    "January 28 – John Penn, \"the American\" (d. 1746)",
    "January 29 – Konstancja Czartoryska, Polish noblewoman politician (d. 1759)",
    "February 2 – Johann Christoph Gottsched, German philosopher (d. 1766)",
    "February 8 – Daniel Bernoulli, Dutch-born Swiss mathematician (d. 1782)",
    "February 16 – Pedro Messía de la Cerda, 2nd Marquis of Vega de Armijo, Spanish naval officer and colonial official (d. 1783)",
    "February 18 – Nicolaus Schuback, lawyer from Germany (d. 1783)",
    "February 21 – Henri Hemsch, French harpsichord maker of German origin (d. 1769)",
    "February 28 – Samsam ud Daula Shah Nawaz Khan (d. 1758)",
    "March 1 – Pierre-Joseph Bourcet, French tactician (d. 1780)",
    "March 3\nWilliam Lacon Childe (d. 1757)\nCharles-Joseph Natoire, French painter in the Rococo manner (d. 1777)",
    "William Lacon Childe (d. 1757)",
    "Charles-Joseph Natoire, French painter in the Rococo manner (d. 1777)",
    "March 4 – Louis Auguste, Prince of Dombes, grandson of Louis XIV of France and of his maîtresse-en-titre Françoise-Athénaïs (d. 1755)",
    "March 8 – William Morgan, of Tredegar, elder (d. 1731)",
    "March 13\nMichel Blavet, French composer and flute virtuoso (d. 1768)\nAntonio Joli, Italian painter of vedute and capricci (d. 1777)\nJames Kent, English organist and composer (d. 1776)\nJób Viczay, Hungarian nobleman (d. 1734)",
    "Michel Blavet, French composer and flute virtuoso (d. 1768)",
    "Antonio Joli, Italian painter of vedute and capricci (d. 1777)",
    "James Kent, English organist and composer (d. 1776)",
    "Jób Viczay, Hungarian nobleman (d. 1734)",
    "March 15 – Leonor Tomásia de Távora, 3rd Marquise of Távora, Portuguese noblewoman (d. 1759)",
    "March 23 – Pieter Woortman (d. 1780)",
    "March 29 – Charles Cornwallis, 1st Earl Cornwallis (d. 1762)",
    "March 30 – Thomas Pichon (d. 1781)",
    "April 4 – Christophe Moyreau, French Baroque composer (d. 1774)",
    "April 30\nCharles Frederick, Duke of Holstein-Gottorp, Swedish nobleman (d. 1739)\nPercy Freke (d. 1728)",
    "Charles Frederick, Duke of Holstein-Gottorp, Swedish nobleman (d. 1739)",
    "Percy Freke (d. 1728)",
    "May 2 – Countess Charlotte of Hanau-Lichtenberg (d. 1726)",
    "May 6 – Giuseppe Peroni, Italian painter (d. 1776)",
    "May 7 – Gerard van Swieten, Dutch-born physician (d. 1772)",
    "May 12 – Luigi Vanvitelli, Italian architect (d. 1773)",
    "May 14 – Mary Delany, English artist (d. 1788)",
    "May 19 – José de Escandón, Spanish colonial governor (d. 1770)",
    "May 22 – Michel-François Dandré-Bardon, French history painter and etcher (d. 1785)",
    "May 26 – Nicolaus Ludwig Zinzendorf, German religious and social reformer (d. 1760)",
    "May 27 – Robert Shirley, British Tory politician (d. 1738)",
    "May 30 – Prosper Anton Josef von Sinzendorf, Austrian nobleman and courtier (d. 1756)",
    "May 31 – Stephen Bayard, 39th Mayor of New York City from 1744 to 1747 (d. 1757)",
    "June 3 – Karen Huitfeldt (d. 1778)",
    "June 8 – Georg Wilhelm von Driesen, lieutenant general in Frederick the Great's Prussian army and a county commission of Osterrode (Ostróda) (d. 1758)",
    "June 10 – Ewald Georg von Kleist, German jurist (d. 1748)",
    "June 16 – Margaret Coke, Countess of Leicester, British peer (d. 1775)",
    "June 19 – Charles, Count of Charolais, French noble (d. 1760)",
    "June 20 – Peter Faneuil, wealthy American colonial merchant (d. 1743)",
    "June 25 – William Boys, Royal Navy officer who became Commander-in-Chief (d. 1774)",
    "June 26\nRichard Dana, prominent lawyer and politician in colonial Massachusetts (d. 1772)\nJoaquín de Montserrat, 1st Marquess of Cruillas (d. 1771)",
    "Richard Dana, prominent lawyer and politician in colonial Massachusetts (d. 1772)",
    "Joaquín de Montserrat, 1st Marquess of Cruillas (d. 1771)",
    "July 11 – Charles Townshend, 3rd Viscount Townshend (d. 1764)",
    "July 12 – Claude-Antoine de Bermen de La Martinière, Quebec-born son of Claude de Bermen de la Martinière (d. 1761)",
    "July 20 – Henri-Louis Duhamel du Monceau, French physician (d. 1782)",
    "July 29 – Peter Joseph Kofler, mayor of Vienna (d. 1764)",
    "August 13 – Heinrich, count von Brühl, German statesman (d. 1763)",
    "August 17 – Clemens August of Bavaria, Archbishop-Elector of Cologne (d. 1761)",
    "August 18\nBaji Rao I, general of the Maratha Empire in India (d. 1740)\nLars Pinnerud, Norwegian farmer and woodcarver (d. 1762)",
    "Baji Rao I, general of the Maratha Empire in India (d. 1740)",
    "Lars Pinnerud, Norwegian farmer and woodcarver (d. 1762)",
    "August 23 – Hans Caspar von Krockow, Prussian major general and commander of the Cuirassier Regiment No (d. 1759)",
    "August 27\nCharles Colyear, 2nd Earl of Portmore (d. 1785)\nCarl Hårleman, Swedish architect (d. 1753)",
    "Charles Colyear, 2nd Earl of Portmore (d. 1785)",
    "Carl Hårleman, Swedish architect (d. 1753)",
    "August 30 – Christian August von Eyben, German lawyer and dean of the Bishopric of Lübeck (d. 1785)",
    "September 6 – Claude-Nicolas Le Cat, French surgeon (d. 1768)",
    "September 9 – Princess Anna Sophie of Schwarzburg-Rudolstadt, Princess of Schwarzburg-Rudolstadt (d. 1780)",
    "September 11 – James Thomson, Scottish poet (d. 1748)",
    "September 15 – Jean-Gilles du Coëtlosquet, French ecclesiastic (d. 1784)",
    "September 20\nBenedict Leonard Calvert, 15th Proprietary Governor of Maryland from 1727 through 1731 (d. 1732)\nVictor Frederick, Prince of Anhalt-Bernburg, German prince of the House of Ascania (d. 1765)",
    "Benedict Leonard Calvert, 15th Proprietary Governor of Maryland from 1727 through 1731 (d. 1732)",
    "Victor Frederick, Prince of Anhalt-Bernburg, German prince of the House of Ascania (d. 1765)",
    "September 25 – Gaetano Zompini, Italian printmaker and engraver (d. 1778)",
    "September 29 – Countess Caroline of Erbach-Fürstenau and by marriage Duchess of Saxe-Hildburghausen (d. 1758)",
    "September 30 – Stanisław Konarski, Polish writer (d. 1773)",
    "October 6 – Philip Morant (d. 1770)",
    "October 7 – Henry Moore, 4th Earl of Drogheda (d. 1727)",
    "October 9 – George Hazard (d. 1738)",
    "October 10 – Lambert-Sigisbert Adam, French sculptor born in Nancy (d. 1759)",
    "October 13 – Phanuel Bacon, English playwright (d. 1783)",
    "October 20 – Charlotte Aglaé d'Orléans (d. 1761)",
    "October 23 – Samuel Dexter, minister from Dedham (d. 1755)",
    "October 24 – Marten Schagen, Dutch Mennonite bookseller (d. 1770)",
    "October 26 – Peter Jacob Horemans, Flemish painter of genre scenes (d. 1776)",
    "October 30 – Sir Cecil Bishopp, 6th Baronet (d. 1778)",
    "November 7 – Erdmuthe Dorothea of Reuss-Ebersdorf (d. 1756)",
    "November 17 – Frederick William, Margrave of Brandenburg-Schwedt, German nobleman (d. 1771)",
    "November 19 – Jean-Antoine Nollet, French abbot and physicist (d. 1770)",
    "November 21 – Charlotta Elisabeth van der Lith, politically active Governor's wife in Surinam (d. 1753)",
    "November 24 – Johann Bernhard Bach the Younger (d. 1743)",
    "November 28\nNathaniel Bliss, English astronomer (d. 1764)\nSophie Magdalene of Brandenburg-Kulmbach (d. 1770)\nPhilip Kinsky of Wchinitz and Tettau (d. 1749)",
    "Nathaniel Bliss, English astronomer (d. 1764)",
    "Sophie Magdalene of Brandenburg-Kulmbach (d. 1770)",
    "Philip Kinsky of Wchinitz and Tettau (d. 1749)",
    "December 4 – Agnes Wilhelmine von Wuthenau, German noblewoman and the first wife of Augustus Louis (d. 1725)",
    "December 5 – Anthony Malone, Irish lawyer and politician (d. 1776)",
    "December 7 – George Heathcote, English merchant and philanthropist and Tory politician (d. 1768)",
    "December 8 – Jeremias Friedrich Reuß, German theologian (d. 1777)",
    "December 9 – Michael Ranft, Protestant Lutheran pastor (d. 1774)",
    "December 20 – Charles-Augustin de Ferriol d'Argental (d. 1788)",
    "December 25 – Leopold II, Prince of Anhalt-Dessau, Prussian general (d. 1751)",
    "date unknown\nFranciszek Salezy Potocki, Polish magnate official (d. 1772)\nIvan Ranger, Austrian painter (d. 1753)",
    "Franciszek Salezy Potocki, Polish magnate official (d. 1772)",
    "Ivan Ranger, Austrian painter (d. 1753)"
  ],
  "deaths": [
    "January 7 – Raffaello Fabretti, Italian antiquary (b. 1618)",
    "January 12 – Marguerite Bourgeoys, French founder of the Congregation of Notre Dame of Montreal, in the colony of New France (b. 1620)",
    "January 21 – Henry Somerset, 1st Duke of Beaufort, English politician (b. 1629)",
    "January 30 – Clara Elisabeth von Platen, German noblewoman (b. 1648)",
    "February 4 – John Bramston the Younger, English lawyer and MP (b. 1611)",
    "February 5 – Louis Maracci, Italian priest (b. 1612)",
    "February 12 – Aleksei Shein, Russian commander and statesman (b. 1662)",
    "February 25 – James Douglas, 2nd Marquess of Douglas (b. 1646)",
    "March 2 – Jankibai, Empress consort of the Maratha Empire as the first wife of Rajaram Chhatrapati (b. 1675)",
    "March 3\nChhatrapati Rajaram Raje Bhonsale, 3rd Maratha Emperor (b. 1670)\nGirolamo Casanata, Italian cardinal (b. 1620)",
    "Chhatrapati Rajaram Raje Bhonsale, 3rd Maratha Emperor (b. 1670)",
    "Girolamo Casanata, Italian cardinal (b. 1620)",
    "March 4 – Lorenzo Pasinelli, Italian painter (b. 1629)",
    "March 8 – William Dunlop, Covenanter (b. c. 1654)",
    "March 14 – Henry Killigrew, English clergyman and playwright (b. 1613)",
    "March 18 – Francesco Scannagatta, Roman Catholic prelate and Bishop of Avellino e Frigento (b. 1632)",
    "March 26 – Heinrich Meibom, German physician and scholar (b. 1638)",
    "May 1\nMarc-René de Voyer de Paulmy d'Argenson, French administrator, diplomat and ambassador to Venetian Republic (b. 1623)\nFrancis Winnington, Solicitor-General for England and Wales (b. 1634)",
    "Marc-René de Voyer de Paulmy d'Argenson, French administrator, diplomat and ambassador to Venetian Republic (b. 1623)",
    "Francis Winnington, Solicitor-General for England and Wales (b. 1634)",
    "May 5 – Angelo Italia, Sicilian architect (b. 1628)",
    "May 12 – John Dryden, English poet and dramatist (b. 1631)",
    "May 15\nJohn Hale, American witch hunter (b. 1636)\nJohn Hale, Puritan pastor of Beverly (b. 1636)",
    "John Hale, American witch hunter (b. 1636)",
    "John Hale, Puritan pastor of Beverly (b. 1636)",
    "May 18 – Teofil Rutka, Polish philosopher (b. 1622)",
    "May 23 – Jens Juel, Danish diplomat (b. 1631)",
    "May 28 – Jan Six, important cultural figure in the Dutch Golden Age (b. 1618)",
    "May 31 – Agostino Scilla, Italian painter and scientist (b. 1629)",
    "June 20 – Richard Gilpin, English nonconformist minister and physician (b. 1625)",
    "June 29 – Olov Svebilius, Swedish priest and professor (b. 1624)",
    "July 2\nLambert Doomer, Dutch Golden Age landscape painter (b. 1624)\nSir Thomas Grosvenor, 3rd Baronet, English politician (b. 1656)\nHoshina Masakage, Japanese daimyō of the Edo period (b. 1616)",
    "Lambert Doomer, Dutch Golden Age landscape painter (b. 1624)",
    "Sir Thomas Grosvenor, 3rd Baronet, English politician (b. 1656)",
    "Hoshina Masakage, Japanese daimyō of the Edo period (b. 1616)",
    "July 7 – Silvestro Valier, 109th Doge of Venice (b. 1630)",
    "July 10\nPieter Gerritsz van Roestraten, Dutch Golden Age painter of still lifes and genre scenes (b. 1630)\nJohn Lowther, 1st Viscount Lonsdale, English politician (b. 1655)",
    "Pieter Gerritsz van Roestraten, Dutch Golden Age painter of still lifes and genre scenes (b. 1630)",
    "John Lowther, 1st Viscount Lonsdale, English politician (b. 1655)",
    "July 19 (found dead) – Thomas Creech, English translator of classical works, headmaster of Sherborne School (b. 1659)",
    "July 22 – Alderano Cybo, Italian Catholic Cardinal (b. 1613)",
    "July 30 – Prince William, Duke of Gloucester, member of the English royal family (b. 1689)",
    "August 17 – Thomas-Claude Renart de Fuchsamberg Amblimont, French naval officer, governor general of the French Antilles (b. 1642)",
    "August 22 – Carlos de Sigüenza y Góngora, Mexican academic (b. 1645)",
    "August 30 – Sir Richard Cust, 1st Baronet, English politician (b. 1622)",
    "August 31 – William Savile, 2nd Marquess of Halifax (b. 1665)",
    "September 7 – William Russell, 1st Duke of Bedford (b. 1616)",
    "September 15 – André Le Nôtre, French landscape gardener (b. 1613)",
    "September 16 – Martyrs of Cajonos (b. c. 1660)",
    "September 23 – Nicolaus Adam Strungk, German composer and violinist (b. 1640)",
    "September 27 – Pope Innocent XII, born Antonio Pignatelli (b. 1615)",
    "September 30 – Lorenzo Trotti, Roman Catholic prelate, Archbishop of Pavia (1672–1700) (b. 1633)",
    "October 1 – Sir Samuel Grimston, 3rd Baronet (b. 1643)",
    "October 16 – Patriarch Adrian of Moscow, Russian Orthodox Church leader (b. 1627)",
    "October 17 – Eligio Caracciolo, Roman Catholic prelate, Archbishop of Cosenza (1694–1700) (b. 1654)",
    "October 23 – Anne Marie de Bourbon, daughter of the Prince of Condé and of a Bavarian princess (b. 1675)",
    "October 27 – Armand Jean le Bouthillier de Rancé, abbot of La Trappe Abbey, founder of the Trappists (b. 1626)",
    "October 31 – Sir Robert Napier, 1st Baronet, of Punknoll (b. 1642)",
    "November 1 – Charles II of Spain, King of Spain; last Habsburg ruler of the Spanish Empire (b. 1661)",
    "November 2 – Francis Turner, British bishop (b. 1637)",
    "November 4 – Sebastián de Pastrana, Roman Catholic prelate, Bishop of Paraguay (1693–1700) (b. 1633)",
    "November 11 – Sophie Angelika of Württemberg-Oels, by marriage Duchess of Saxe-Zeitz-Pegau-Neustadt (b. 1677)",
    "November 16 – Paul Rycaut, British diplomat (b. 1629)",
    "November 18 – Robert Walpole, English Whig politician, soldier and member of parliament (b. 1650)",
    "November 25 – Stephanus Van Cortlandt, first native-born mayor of New York City (b. 1643)",
    "November 26 – Tokugawa Mitsutomo, daimyō of Owari Domain during early Edo period Japan (b. 1625)",
    "December 5 – Mata Jito, first wife of the tenth Sikh Guru (b. 1673)",
    "December 13 – Inoha Seihei, bureaucrat of the Ryukyu Kingdom (b. 1648)",
    "December 15 – Juan Alfonso Valerià y Aloza, Roman Catholic prelate, Bishop of Lérida (1699–1700) (b. 1643)",
    "December 16 – Thomas Morgan, English politician (b. 1664)",
    "December 18 – Edward Harley, English politician (b. 1624)",
    "December 20 – Mary Bradbury, accused witch in Salem, Massachusetts (b. 1615)",
    "date unknown\nCaius Gabriel Cibber, Danish sculptor working in England (b. 1630)\nKamalakara, Indian astronomer and mathematician (b. 1616)\nLouis Jolliet, Canadian explorer (b. 1645)",
    "Caius Gabriel Cibber, Danish sculptor working in England (b. 1630)",
    "Kamalakara, Indian astronomer and mathematician (b. 1616)",
    "Louis Jolliet, Canadian explorer (b. 1645)"
  ]
}