{
  "events": [
    "January 17 – Tuscarora War: Colonel James Moore leads the Carolina militia out of Albemarle County, North Carolina, in a second offensive against the Tuscarora. Heavy snows force the troops to take refuge in Fort Reading, on the Pamlico River.",
    "February 1 – Skirmish at Bender, Moldova: Charles XII of Sweden is defeated by the Ottoman Empire.",
    "February 4 – Tuscarora War: The Carolina militia under Colonel James Moore leaves Fort Reading, to continue the campaign against the Tuscarora.",
    "February 25 – Frederick William I of Prussia begins his reign.",
    "March 1 – Tuscarora War: Colonel James Moore's Carolina militia lays siege to the Tuscaroran stronghold of Fort Neoheroka, located a few miles up Contentnea Creek from Fort Hancock.",
    "March 20 – Tuscarora War: Colonel James Moore's Carolina militia launches a major offensive against Fort Neoheroka.",
    "March 23 – Tuscarora War: Fort Neoheroka falls to the Carolina militia, effectively ending the Tuscarora nation's military strength. Two Tuscaroran allies, the Machapunga and Coree tribes, continue offensive actions against North Carolina.",
    "March 27 – First Treaty of Utrecht between Great Britain and Spain: Philip V is accepted by Britain and Austria as king of Spain; Spain cedes Gibraltar and Menorca to Britain.[1][2]",
    "April 11 – The Second Treaty of Utrecht between Great Britain and France ends the War of the Spanish Succession.[3] France cedes Newfoundland, Acadia, Hudson Bay and St Kitts to Great Britain.[1]",
    "April 14 – First performance, in London, of Joseph Addison's libertarian play Cato, a Tragedy, which will be influential on both sides of the Atlantic.[4]",
    "April 19 – With no living male heirs, Charles VI, Holy Roman Emperor, issues the Pragmatic Sanction of 1713, to ensure one of his daughters will inherit the Habsburg lands.",
    "May 2 – In the Great Northern War, a fleet of the Russian Navy, transporting 12,000 soldiers, sails from Kronstadt to attack the Swedish Army at Helsinki.",
    "May 6 – The Parliament of Ireland is dissolved by Queen Anne and new elections are set.",
    "May 13 – King Philip V of Spain issues an auto accordado that changes the order of succession for the Spanish throne allowing a female descendant within the House of Bourbon to rule.  The change will allow his great-great-granddaughter to ascend the throne in 1833 as Queen Isabella II.",
    "May 17 – Ottone in villa, the first opera by composer Antonio Vivaldi, is given its initial performance, debuting at the Teatro delle Grazie in Vicenza",
    "May 21 – Great Northern War: The Russian fleet lands a force of 10,000 men at Pernå on the southern coast of Finland.",
    "June 1 (approx.) – Tuscarora War: Colonel James Moore leads the Carolina militia into the Pamlico Peninsula to defeat the Machapunga and Coree tribes.",
    "June 23 – French residents of Acadia are given one year to declare allegiance to Great Britain, or leave Nova Scotia.",
    "July 13 – The Treaty of Portsmouth brings an end to Queen Anne's War.",
    "August 8 – The Parliament of Great Britain, third since the Act of Union, is dissolved",
    "August 22 – Voting begins in the 1713 British general election in various constituencies and continues to November 12",
    "September 1 – Tuscarora War: The Carolina militia, led by Colonel James Moore, returns to South Carolina, after mixed success in the campaign against the Machapunga and Coree tribes.",
    "October 6 – The Treaty of Schwedt is signed between Russia and Brandenburg-Prussia, with the latter accepting the annexation of Baltic territories and paying Russia expenses in return for the southern part of Pomerania, recently taken from Sweden in the Great Northern War.",
    "October 17 – The Battle of Pälkäne is fought in what is now Finland between Russia and Sweden, with Russia's Fyodor Arpaskin forcing Finnish troops under Carl Gustaf Armfeldt to withdraw.",
    "November 6 – The Dublin election riot breaks out during the fiercely contested Irish General Election. [5]",
    "November 12 – The 1713 British general election concludes with the conservative Tories winning 358 of the 558 available seats in the House of Commons, and the liberal Whigs having 200.",
    "December 9 – As part of the agreements made at Utrecht to end the War of the Spanish Succession, Great Britain and Spain sign a treaty of commerce and navigation.  [6]",
    "December 10 – The rebellion of against the British East India Company by Richard Raworth, Deputy Governor of Fort St. David (now abandoned and in the Indian state of Tamil Nadu near Cuddalore), comes to an end after two months when forces sent by Bridish Madras Governor Edward Harrison negotiate a settlement allowing Raworth to surrender in return for amnesty.",
    "December 21 – Victor Amadeus, Duke of Savoy is crowned King of Sicily at Palermo, and his wife Anne Marie is crowned as Queen consort. [7] The coronation follows Spain's recognition of Sicilian independence, effective September 22, as part of the Treaty of Utrecht.",
    "Ars Conjectandi, a seminal work on probability by Jacob Bernoulli, is published eight years after his death, by his nephew, Niklaus Bernoulli.",
    "Basil Matthew II becomes Syriac Orthodox Maphrian of the East.[8]"
  ],
  "births": [
    "January 2 – Marie Dumesnil, French actor (d. 1803)",
    "January 5 – Jorge Juan y Santacilia, Spanish geodesist (d. 1773)",
    "January 7 – Giovanni Battista Locatelli, Italian opera director (d. 1785)",
    "January 13 – Charlotte Charke, British actor and writer (d. 1760)",
    "January 17 – Jean Chrétien Fischer, French general (d. 1762)",
    "January 22 – Marc-Antoine Laugier, French Jesuit priest and architectural theorist (d. 1769)",
    "January 31\nAnthony Benezet, French-born American abolitionist and educator active in Philadelphia (d. 1784)\nAdam Drummond, Scottish merchant banker and politician (d. 1786)",
    "Anthony Benezet, French-born American abolitionist and educator active in Philadelphia (d. 1784)",
    "Adam Drummond, Scottish merchant banker and politician (d. 1786)",
    "February 2 – Maria Margarida de Lorena, 2nd Duchess of Abrantes, Portuguese noblewoman and courtier (d. 1780)",
    "February 11 – Diane Adélaïde de Mailly, third of the five famous French de Nesle sisters (d. 1769)",
    "February 13 – Domènec Terradellas, Spanish opera composer (d. 1751)",
    "February 20 – Anna Maria Elvia, Swedish feminist writer (d. 1784)",
    "March 5\nEdward Cornwallis, British military officer, first Governor of Nova Scotia (d. 1776)\nFrederick Cornwallis, Archbishop of Canterbury (d. 1783)",
    "Edward Cornwallis, British military officer, first Governor of Nova Scotia (d. 1776)",
    "Frederick Cornwallis, Archbishop of Canterbury (d. 1783)",
    "March 8 – Gian Carlo Passeroni, Italian writer (d. 1803)",
    "March 12 – Johann Adolph Hass, German clavichord maker (d. 1771)",
    "March 17 – Sir Charles Asgill, 1st Baronet, British politician (d. 1788)",
    "March 21 – Francis Lewis, signer of the United States Declaration of Independence (d. 1802)",
    "March 23 – Bowen Southwell, Irish politician (d. 1796)",
    "March 26 – Peter Oliver, Massachusetts loyalist colonial judge (d. 1791)",
    "March 28 – Juan Nentvig, German anthropologist (d. 1768)",
    "March 29 – John Ponsonby, Irish politician (d. 1787)",
    "April 7 – Nicola Sala, Italian opera composer (d. 1801)",
    "April 10 – John Whitehurst, English clockmaker (d. 1788)",
    "April 11 – Luise Gottsched, German poet, playwright, essayist and translator (d. 1762)",
    "April 12 – Guillaume Thomas François Raynal, French writer, man of letters during the Age of Enlightenment (d. 1796)",
    "April 13 – Pierre Jélyotte, French operatic tenor (d. 1797)",
    "April 17 – Samuel Graves, British Royal Navy admiral, known for his role early in the American War of Independence (d. 1787)",
    "April 21\nAnna Maria Hilfeling, Swedish artist (d. 1783)\nLouis de Noailles, French peer and Marshal of France (d. 1793)",
    "Anna Maria Hilfeling, Swedish artist (d. 1783)",
    "Louis de Noailles, French peer and Marshal of France (d. 1793)",
    "April 22 – Peter Du Cane, Sr., British businessman (d. 1803)",
    "May 6 – Charles Batteux, French philosopher, writer on aesthetics (d. 1780)",
    "May 7 – Charles Townley, British Officer of Arms (d. 1774)",
    "May 11 – James Drummond, 3rd Duke of Perth, British noble (d. 1746)",
    "May 13\nAlexis Clairaut, prominent French mathematician (d. 1765)\nLouis François de Monteynard, French soldier, statesman (d. 1791)",
    "Alexis Clairaut, prominent French mathematician (d. 1765)",
    "Louis François de Monteynard, French soldier, statesman (d. 1791)",
    "May 15\nJózsef Károly Hell, Hungarian mining engineer (d. 1789)\nEdward Wortley Montagu, English traveller and author (d. 1776)",
    "József Károly Hell, Hungarian mining engineer (d. 1789)",
    "Edward Wortley Montagu, English traveller and author (d. 1776)",
    "May 25\nAndrzej Mokronowski, Polish general (d. 1784)\nJohn Stuart, 3rd Earl of Bute, Prime Minister of Great Britain (1762–1763) (d. 1792)",
    "Andrzej Mokronowski, Polish general (d. 1784)",
    "John Stuart, 3rd Earl of Bute, Prime Minister of Great Britain (1762–1763) (d. 1792)",
    "May 31 – Giuseppe Maria Buonaparte, Corsican politician (d. 1763)",
    "June 3 – Robert Petre, 8th Baron Petre, British peer, renowned horticulturist (d. 1742)",
    "June 10 – Princess Caroline of Great Britain, fourth child and third daughter of George II (d. 1757)",
    "June 11\nJohn Allen, 3rd Viscount Allen, Irish politician (d. 1745)\nEdward Capell, English Shakespearian critic (d. 1781)",
    "John Allen, 3rd Viscount Allen, Irish politician (d. 1745)",
    "Edward Capell, English Shakespearian critic (d. 1781)",
    "June 16 – Meshech Weare, First Governor of New Hampshire (d. 1786)",
    "June 20 – Georg Anton Urlaub, German painter (d. 1759)",
    "June 22 – Lord John Sackville, English gentleman and cricketer, second son of Lionel Sackville (d. 1765)",
    "July 1 – Benjamin Green, Canadian merchant and judge (d. 1772)",
    "July 5\nStanhope Aspinwall, British diplomat (d. 1771)\nJean Godin des Odonais, French cartographer and naturalist (d. 1792)",
    "Stanhope Aspinwall, British diplomat (d. 1771)",
    "Jean Godin des Odonais, French cartographer and naturalist (d. 1792)",
    "July 9 – John Newbery, English publisher and bookseller (d. 1767)",
    "July 10 – Anna Rosina de Gasc, German portrait painter (d. 1783)",
    "July 18 – Gaetano Matteo Pisoni, Swiss-Italian architect (d. 1782)",
    "July 22 – Jacques-Germain Soufflot, French architect in the international circle that introduces neoclassicism (d. 1780)",
    "July 23 – Luís António Verney, Portuguese philosopher and pedagogue (d. 1792)",
    "July 27 – Margravine Sophie Charlotte of Brandenburg-Bayreuth, German noble (d. 1747)",
    "August 1 – Charles I, Duke of Brunswick-Wolfenbüttel (d. 1780)",
    "August 4\nBernardo de Miera y Pacheco, Spanish cartographer (d. 1785)\nPrincess Elisabeth Albertine of Saxe-Hildburghausen, Duchess consort of Mecklenburg-Strelitz (d. 1761)",
    "Bernardo de Miera y Pacheco, Spanish cartographer (d. 1785)",
    "Princess Elisabeth Albertine of Saxe-Hildburghausen, Duchess consort of Mecklenburg-Strelitz (d. 1761)",
    "August 6 – Marie Sophie de Courcillon, French noblewoman and Duchess of Rohan-Rohan, Princess of Soubise by marriage (d. 1756)",
    "August 11 – Lebbeus Harris, Canadian politician (d. 1792)",
    "August 17 – Antoine de Montazet, French archbishop (d. 1788)",
    "August 25 – Vijaya Raghunatha Raya Tondaiman I, Raja of Pudukkottai (d. 1769)",
    "August 27 – Anton August Beck, German engraver (d. 1787)",
    "September 3 – Jean Baptiste de La Vérendrye, eldest son of Pierre Gaultier de Varennes et de La Vérendrye and Marie-Anne Dandonneau Du Sablé (d. 1736)",
    "September 10\nGowin Knight, British physicist (d. 1772)\nJohn Needham, British biologist and priest (d. 1781)",
    "Gowin Knight, British physicist (d. 1772)",
    "John Needham, British biologist and priest (d. 1781)",
    "September 13 – Giuseppe Maria Buondelmonti, Italian philosopher (d. 1757)",
    "September 14 – Johann Kies, German astronomer and mathematician (d. 1781)",
    "September 16 – Charles Lucas, Irish apothecary and politician (d. 1771)",
    "September 23 – Ferdinand VI of Spain, King of Spain (d. 1759)",
    "October 3 – Antoine Dauvergne, French composer and violinist (d. 1797)",
    "October 5 – Denis Diderot, French philosopher (d. 1784)",
    "October 7 – Granville Elliott, Army General, British military expert, working for Britain and Palatine forces (d. 1759)",
    "October 8 – Yechezkel Landau, influential Polish authority on halakha (Jewish law) (d. 1793)",
    "October 12 – Khawaja Muhammad Zaman of Luari, Sindhi Sufi poet (d. 1775)",
    "October 13\nAllan Ramsay, Scottish portrait painter (d. 1784)\nJacques de Romas, French physicist (d. 1776)",
    "Allan Ramsay, Scottish portrait painter (d. 1784)",
    "Jacques de Romas, French physicist (d. 1776)",
    "October 20\nBenjamin Andrew, American politician (d. 1790)\nJames Cecil, 6th Earl of Salisbury, English noble (d. 1780)\nJoseph Redlhamer, Austrian physicist (d. 1761)",
    "Benjamin Andrew, American politician (d. 1790)",
    "James Cecil, 6th Earl of Salisbury, English noble (d. 1780)",
    "Joseph Redlhamer, Austrian physicist (d. 1761)",
    "October 23 – Pieter Burman the Younger, Dutch academic (d. 1788)",
    "October 24 – Marie Fel, French opera singer (d. 1794)",
    "October 30 – Giuseppe Antonio Landi, Italian painter (d. 1791)",
    "November 1 – Antonio Genovesi, Italian economist (d. 1769)",
    "November 5 – Gorges Lowther, Member of the Irish House of Commons (d. 1792)",
    "November 6 – Thomas Osborne, 4th Duke of Leeds, British politician (d. 1789)",
    "November 24\nJunípero Serra, Spanish Christian missionary (d. 1784)\nLaurence Sterne, Anglo-Irish novelist, Anglican clergyman (d. 1768)",
    "Junípero Serra, Spanish Christian missionary (d. 1784)",
    "Laurence Sterne, Anglo-Irish novelist, Anglican clergyman (d. 1768)",
    "November 30 – Johann Balthasar Bullinger, Swiss landscape painter (d. 1793)",
    "December 4 – Gasparo Gozzi, Venetian critic and dramatist (d. 1786)",
    "December 10 – Johann Nicolaus Mempel, German composer, musician (d. 1747)",
    "December 13 – John Baptist Caryll, third Jacobite Baron Caryll of Durford (d. 1788)",
    "December 14 – Martin Knutzen, German philosopher (d. 1751)",
    "December 15 – Welbore Ellis, 1st Baron Mendip, British politician (d. 1802)",
    "December 23 – Maruyama Gondazaemon, Japanese sumo wrestler (d. 1749)",
    "December 27 – Giovanni Battista Borra, Italian architect and engineer (d. 1770)",
    "December 29 – Nicolas Louis de Lacaille, French astronomer (d. 1762)"
  ],
  "deaths": [
    "January 1 – Giuseppe Maria Tomasi, Sicilian saint (b. 1649)",
    "January 5 – Jean Chardin, French jeweller, traveller (b. 1643)",
    "January 8 – Arcangelo Corelli, Italian composer (b. 1653)",
    "January 11 – Pierre Jurieu, French Protestant leader (b. 1637)",
    "January 12 – John Vaughan, 3rd Earl of Carbery, Governor of Jamaica, President of the British Royal Society (b. 1639)",
    "January 20 – Pavao Ritter Vitezović, Croatian historian (b. 1652)",
    "February 4 – Anthony Ashley-Cooper, 3rd Earl of Shaftesbury, English politician and philosopher (b. 1671)",
    "February 14 – Louis Crato, Count of Nassau-Saarbrücken (b. 1663)",
    "February 25 – King Frederick I of Prussia (b. 1657)",
    "February 26 – William Paget, 6th Baron Paget, English peer and ambassador (b. 1637)",
    "March 15 – Wolfgang William Romer, Dutch military engineer (b. 1640)",
    "March 18 – Juraj Jánošík, the Slovak Robin Hood (executed)",
    "March 24 – Toussaint de Forbin-Janson, French Catholic cardinal and Bishop of Beauvais (b. 1631)",
    "March 26\nPaul I, Prince Esterházy, Hungarian prince (b. 1635)\nCharles de Sévigné, French baron (b. 1648)",
    "Paul I, Prince Esterházy, Hungarian prince (b. 1635)",
    "Charles de Sévigné, French baron (b. 1648)",
    "March 30 – Govert Bidloo, Dutch physician, anatomist, poet and playwright (b. 1649)",
    "April 3 – Henri, Count of Brionne, French noble (b. 1661)",
    "May 20 – Thomas Sprat, English minister (b. 1635)",
    "July 7 – Henry Compton, Bishop of Oxford, privy councillor (b. 1632)",
    "August 4 – William Cave, English divine (b. 1637)",
    "August 26 (bur.) – Denis Papin, French inventor (b. 1647)",
    "October 15 – Johann Michael Feuchtmayer the Elder, German artist (b. 1666)",
    "October 18 – Tripo Kokolja, Venetian painter (b. 1661)",
    "October 20 – Archibald Pitcairne, Scottish physician (b. 1652)",
    "October 28 – Paolo Lorenzani, Italian composer (b. 1640)",
    "October 31 – Ferdinando de' Medici, Grand Prince of Tuscany (b. 1663)",
    "November 6 – Franz Karl of Auersperg, Prince of Auersperg, Duke of Münsterberg (1705-1713) (b. 1660)",
    "November 7 – Elizabeth Barry, English actress (b. 1658)",
    "November 17 – Abraham van Riebeeck, Governor-General of the Dutch East Indies (b. 1653)",
    "December 14 – Thomas Rymer, English historian (b. 1641)",
    "December 15 – Carlo Maratta, Italian painter (b. 1625)",
    "December 18 – Frederick Heinrich of Saxe-Zeitz-Pegau-Neustadt (b. 1668)",
    "December 31 – Edward Proger, Member of Parliament for Brecknockshire (b. 1621)",
    "date unknown\nBasil Lazarus III, Syriac Orthodox Maphrian of the East[8]\nThomas Ellwood, English religious writer (b. 1639)",
    "Basil Lazarus III, Syriac Orthodox Maphrian of the East[8]",
    "Thomas Ellwood, English religious writer (b. 1639)"
  ]
}