{
  "events": [
    "January 2 – Alexander Pope's poem Epistle to Dr Arbuthnot is published in London.[1]",
    "January 8 – George Frideric Handel's opera Ariodante is premièred at the Royal Opera House in Covent Garden, London.",
    "February 3 – All 256 people on board the Dutch East India Company ships Vliegenthart and Anna Catherina die when the two ships sink in a gale off of the Netherlands coast. The wreckage of Vliegenthart remains undiscovered until 1981.[2]",
    "February 14 – The Order of St. Anna is established in Russia, in honor of the daughter of Peter the Great.",
    "March 10 – The Russian Empire and Persia sign the Treaty of Ganja, with Russia ceding territories in the Caucasus mountains to Persia, and the two rivals forming a defensive alliance against the Ottoman Empire.",
    "March 11 – Abraham Patras becomes the Governor-General of the Dutch East Indies (now Indonesia) upon the death of Dirck van Cloon.",
    "April 13 – Emperor Sakuramachi accedes to the throne of Japan.",
    "April 16 – Alcina, George Frideric Handel's Italian opera, premieres at the Royal Opera House in Covent Garden, London.",
    "May 22 – George Hadley publishes the first explanation of the trade winds.[3][4][5]",
    "June 15 – Lê Thuần Tông, Emperor of Đại Việt since 1732, dies at the age of 36 and is succeeded by Lê Ý Tông.[6]",
    "June 25 – In Great Britain, the Engraving Copyright Act 1734, the first of a series of copyright protection laws, takes effect after being given royal assent by King George II.[7]",
    "July 11 – Pluto (not known at this time) enters a fourteen-year period inside the orbit of Neptune, which will not recur until 1979.",
    "August 14 – Freedom of the press: The New York Weekly Journal writer John Peter Zenger is acquitted of seditious libel against the royal governor of New York, on the basis that what he published was true.",
    "September 4 – Al-Husayn I ibn Ali, the first Bey of Tunis (now Tunisia) is defeated at the Battle of Smindja by Abu l-Hasan Ali I with the help of Ibrahim ben Ramdan, the Dey of Algiers.",
    "September 14 – The Kingdom of France approves the issue of \"card money\" in the total amount of 200,000 livres to serve as currency in its Louisiana territory in America.",
    "September 22 – Sir Robert Walpole, the Prime Minister of Great Britain, becomes the first British premier to move into London's 10 Downing Street.",
    "October 3 – An agreement between the European powers brings a ceasefire in the War of the Polish Succession, one week short of the second anniversary of the war.  With France and Spain on the side of the reigning monarch, Stanisław Leszczyński, and Prussia, Russia, and Austria supporting Augustus III, a preliminary peace is signed allowing Stanislaw to reign in Warsaw and Augustus to reign in Krakow, and is ratified in 1738.",
    "October 14 – John Wesley and his brother Charles set sail from England for Savannah in the Province of Georgia in British America; on the voyage they first encounter members of the Moravian Church.",
    "October 18 – In China, Qianlong succeeds his father, Yongzheng, as Emperor and begins a 60-year-long reign within the Qing dynasty.",
    "November 25 – The largest bell in the world, the 22 feet (6.7 m) diameter Tsar Kolokol, is successfully cast in Moscow within the Kremlin.[8]",
    "November 30 – The Netherlands becomes the first government to announce a prohibition against citizens joining the Freemasons.[9]",
    "December 6 – The second successful appendectomy is performed by naturalised British surgeon Claudius Aymand at St George's Hospital in London (the first was in 1731).[10]",
    "December 19 – At the age of 8 years old, Prince Luis of Spain becomes the youngest Roman Catholic Cardinal in history, after being named by Pope Clement XII.",
    "Russo-Turkish War, 1735-1739: Russian forces fail to occupy the Crimea, due to rasputitsa.",
    "Linnaeus publishes his Systema Naturae.",
    "A shipbuilding industry begins in Mumbai.",
    "Leonhard Euler solves the Basel problem, first posed by Pietro Mengoli in 1644, and the Seven Bridges of Königsberg problem.",
    "The King's Highway (Charleston to Boston) is completed.",
    "Quebec: Construction begins on the Chemin du roy between Quebec and Montreal.",
    "Augusta, Georgia, is founded.",
    "Cobalt is discovered and isolated by Georg Brandt."
  ],
  "births": [
    "January 1 – Paul Revere, American silversmith and patriot (d. 1818)",
    "January 8 – John Carroll first Roman Catholic Archbishop in the U.S. (d. 1815)",
    "January 9 – John Jervis, 1st Earl of St Vincent, British Royal Navy admiral (d. 1823)",
    "January 27 – Étienne Clavière, French financier and politician (d. 1793)",
    "February 13, Crown Prince Sado (d. 1762)",
    "February 28 – Alexandre-Théophile Vandermonde French musician and chemist (d. 1796)",
    "March 1 – Caroline Thielo, Danish actress (d. 1754)",
    "March 29 – Johann Karl August Musäus German author (d. 1787)",
    "April 13 – Isaac Low, New York delegate to the Continental Congress (d. 1791)",
    "May 1 – Lorenzo Hervás y Panduro Spanish Jesuit philologist (d. 1809)",
    "May 23 – Charles Joseph, Prince de Ligne, (d. 1814)",
    "June 16 – Nicolas Bernard Lépicié, French painter (d. 1784)",
    "June 26 – Joseph Ducreux, French noble, portrait painter, pastelist, miniaturist, and engraver (d. 1802)",
    "July 4 – Jacoba van den Brande, Dutch culture personality (d. 1794)",
    "July 10 – Ulrika Pasch, Swedish painter (d. 1796)",
    "September 5 – Johann Christian Bach, German composer (d. 1782)",
    "September 20 – James Keir, Scottish geologist, chemist, and industrialist (d. 1820)",
    "September 28 – Augustus FitzRoy, 3rd Duke of Grafton, Prime Minister of the United Kingdom (d. 1811)",
    "October 1 – Augustus Henry Fitzroy, 3rd Duke of Grafton (d. 1811)",
    "October 9 – Karl Wilhelm Ferdinand, Duke of Brunswick (d. 1806)",
    "October 21 – Richard Gough, English antiquary (d. 1809)",
    "October 30 – John Adams, 2nd President of the United States (d. 1826)",
    "November 10 – Granville Sharp, English abolitionist (d. 1813)",
    "December 29 – Thomas Banks, English sculptor and artist (d. 1805)",
    "December 31 – Jean de Crévecoeur, French-American writer (d.  1813)",
    "date unknown\nJohn Julius Angerstein, Russian-born English merchant, insurer and art collector (d. 1823)\nWilliam Bell, English portrait painter from Newcastle upon Tyne (d. c. 1806)\nBety of Betsimisaraka, queen regnant (d. 1805)\nMary Evans, Welsh religious leader (d. 1789)\nEdward Telfair, Scottish-born American politician and Governor of Georgia (d. 1807)\nRegina-Louise von Freedricksz, Russian industrialist  (d. 1821)",
    "John Julius Angerstein, Russian-born English merchant, insurer and art collector (d. 1823)",
    "William Bell, English portrait painter from Newcastle upon Tyne (d. c. 1806)",
    "Bety of Betsimisaraka, queen regnant (d. 1805)",
    "Mary Evans, Welsh religious leader (d. 1789)",
    "Edward Telfair, Scottish-born American politician and Governor of Georgia (d. 1807)",
    "Regina-Louise von Freedricksz, Russian industrialist  (d. 1821)"
  ],
  "deaths": [
    "January 5 – Carlo Ruzzini, Doge of Venice (b. 1653)",
    "January 12 – John Eccles, British composer (b. 1668)",
    "January 13 – Polyxena of Hesse-Rotenburg, Queen consort of Sardinia (b. 1706)",
    "January 18 – Maria Clementina Sobieska, Polish noble (b. 1702)",
    "February 27 – John Arbuthnot, British physician and author (b. 1667)",
    "March 25 – Daniel Gottlieb Messerschmidt, German scientist (b. 1685)",
    "April 5\nWilliam Derham, English minister and writer (b. 1657)\nSamuel Wesley, English poet, religious leader (b. 1662)",
    "William Derham, English minister and writer (b. 1657)",
    "Samuel Wesley, English poet, religious leader (b. 1662)",
    "April 8 – Francis II Rákóczi, Hungarian rebel against the Habsburgs (b. 1676)",
    "April 23 – Edward Hawarden, English Catholic theologian (b. 1662)",
    "June 10 – Thomas Hearne, British antiquarian (b. 1678)",
    "June 22 – Pirro Albergati, Italian composer (b. 1663)",
    "July 18 – Johann Krieger, German composer and organist (b. 1651)",
    "July 26 – Jesper Swedberg, Swedish bishop (b. 1653)",
    "July 29 – Sophia Louise of Mecklenburg-Schwerin, Prussian queen consort (b. 1685)",
    "August 30 – Edward Harley, English politician (b. 1664)",
    "September 18 – Justus van Effen, Dutch author (b. 1684)",
    "September 27 – Peter Artedi, Swedish naturalist (drowned) (b. 1705)",
    "October 8 – Yongzheng Emperor of Qing China (b. 1678)",
    "October 26 – Margareta von Ascheberg, Swedish land owner, countess and acting regiment colonel (b. 1671)",
    "November 14 – Frederick William, Prince of Hohenzollern-Hechingen (b. 1663)",
    "November 29 – Bernardo de Hoyos, Beatified Spanish priest (b. 1711)",
    "December 14 – Thomas Tanner, English bishop, antiquarian (b. 1674)"
  ]
}