{
  "events": [
    "January 6 – The Royal Navy ship Bacchus engages the Spanish Navy privateer Begona, and sinks it; 90 of the 120 Spanish sailors die, but 30 of the crew are rescued.",
    "January 24 – The Dagohoy rebellion in the Philippines begins, with the killing of Father Giuseppe Lamberti.",
    "February – Violent storms frustrate a planned French invasion of Britain.",
    "February 22–23 – Battle of Toulon: The British fleet is defeated by a joint Franco-Spanish fleet.",
    "March 1 (approximately) – The Great Comet of 1744, one of the brightest ever seen, reaches perihelion.",
    "March 13 – The British ship Betty capsizes and sinks off of the Gold Coast (modern-day Ghana) near Anomabu. More than 200 people on board die, although there are a few survivors.",
    "March 15 – France declares war on Great Britain.",
    "April – The Female Spectator (a monthly) is founded by Eliza Haywood in England, the first periodical written for women by a woman.",
    "April 2 – The first Rules of golf are drawn up at Leith, for the first golf competition.[1][2]",
    "April 27 – Siege of Villafranca (1744): A joint French and Spanish force defeats Britain and Sardinia.",
    "May 11 – Russia's treasury begins an effort to reduce the number of copper five-kopeck pieces (20 of which equal a Russian ruble) by declaring that it will buy them back at a ruble for every 20 until August 1, after which kopecks would be redeemed at a ruble for every 25; then at the rate of 33 for a ruble on October 1, and 50 for a ruble on and after August 28, 1746.[3]",
    "May 22 – The Union of Germany is proclaimed in Frankfurt Frederick II of Prussia, as articles of union are signed between Prussia, Hesse-Kassel and the Rhineland Palatinate.[4]",
    "May 24 – After receiving the news from Europe that Great Britain and France are at war, the French Army at Louisbourg attacks the British settlement at Fort William Augustus at Canso, Nova Scotia and forces its surrender.[5]",
    "June 13 – Alexey Bestuzhev-Ryumin is named as the new Chancellor of the Russian Empire by the Empress Elizabeth.[6]",
    "June 15 – Commodore George Anson's voyage around the world concludes after four years as HMS Centurion returns to England at Spithead and Anson is greeted as a hero.[7]",
    "June 28 – At the age of 15, Princess Sophie of Anhalt-Zerbst, the future Empress of Russia, is received into the Russian Orthodox Church after converting from the Lutheran faith. Upon her conversion to the Russian Orthodox religion, she is given the name Yekaterina (Catherine).  In 1762, she takes the throne as the Empress Catherine II, later known as Catherine the Great.",
    "July 8 – The Royal Navy privateer Somerset capsizes and sinks in the Bristol Channel, killing 86 of the 97 crew.",
    "July 19 – Battle of Casteldelfino: France defeats the Kingdom of Sardinia.",
    "July 29 – Nader Shah lays siege to the Ottoman citadel of Kars.",
    "August 12 – Battle of Velletri in the Kingdom of Naples: Spanish-Neapolitan forces defeat those of the Archduchy of Austria.",
    "September 30 – Battle of Madonna dell'Olmo: France and Spain defeat the Kingdom of Sardinia.",
    "October 4 – In one of the greatest disasters for the Royal Navy, HMS Victory sinks in a storm in the English Channel, killing 1,100 sailors and officers it had been bringing back from Gibraltar to England, including Admiral John Balchen.[8] The wreck will be located 264 years later, in January, 2009.[9]",
    "October 12 – The creator of binomial nomenclature for the identification of plant and animal species, Carl Linnaeus, is selected as president of the Royal Swedish Academy of Science, succeeding the late Anders Celsius, who had devised the centigrade measurement of temperature.[10]",
    "October 19 – William Shirley, the British colonial Governor of the Province of Massachusetts Bay, announces the declaration of war against the Miꞌkmaq and Maliseet Indian tribes.[11]",
    "October 25 – The Massachusetts General Court, colonial legislature for the Massachusetts Bay Province, approves an incentive for the killing of enemy Indians, authorizing the payment of 100 Massachusetts pounds for the scalping of a Mi'kmaq or Maliseet Indian, and 50 for the scalps of women or children.[12]",
    "October 25 – Spanish explorers Antonio de Ulloa and Jorge Juan y Santacilla complete their mission of exploration and depart from the Peruvian seaport of Callao for a return to Spain.[13]",
    "November 1 – Second Silesian War: The Prussian Army, under the command of Field Marshal Kurt Christoph Graf von Schwerin, begins the bombardment of  Prague. The Bohemian capital surrenders after two weeks.[14]",
    "December 18 – Queen Maria Theresa of Austria issues a proclamation to rid Bohemia of its Jewish residents, with the Jews to leave Prague over the next two weeks, and then to depart from Bohemia entirely in 1745.[15]",
    "The third French and Indian War, known as King George's War, breaks out at Annapolis Royal, Nova Scotia.",
    "Tommy Thumb's Pretty Song Book, sequel to Tommy Thumb's Song Book, containing the oldest version of many well-known and popular rhymes, is published in London."
  ],
  "births": [
    "January 10 – Thomas Mifflin, 1st Governor of Pennsylvania (d. 1800)",
    "February 6 – Pierre-Joseph Desault, French anatomist and surgeon (d. 1795)",
    "February 23 – Mayer Amschel Rothschild, German banker, founder of the Rothschild banking dynasty (d. 1812)",
    "May 13 – Captain Abraham Lincoln, American military officer in the Virginia colonial militia during the American Revolution; grandfather and namesake of the 16th U.S. president; near Exeter Township in what was then Philadelphia County, Pennsylvania (d. 1786)",
    "May 19 – Charlotte of Mecklenburg-Strelitz, queen of George III of Great Britain (d. 1818)",
    "May 21 – Samuel Ireland, British author and engraver (d. 1800)",
    "May 31 – Richard Lovell Edgeworth, Anglo-Irish politician, writer and inventor (d. 1817)",
    "July 17 – Elbridge Gerry, 5th Vice President of the United States, American politician (d. 1814)",
    "July 20 – Joshua Clayton, American politician (d. 1798)",
    "August 1 – Jean-Baptiste Lamarck, French naturalist (d. 1829)",
    "August 16 – Pierre Méchain, French astronomer (d. 1804)",
    "August 25 – Johann Gottfried Herder, German writer (d. 1803)",
    "September 25 – King Frederick William II of Prussia (d. 1797)",
    "November 11 – Abigail Adams, First Lady of the United States (d. 1818)",
    "date unknown – Marie Barch, Danish ballerina (d. 1827)"
  ],
  "deaths": [
    "January 11 – James Hamilton, 7th Earl of Abercorn (b. 1686)",
    "January 22 – Pierre Lepature, French artist (b. 1659)",
    "January 23 – Giambattista Vico, Italian philosopher and historian (b. 1668)",
    "January 26 – Ludwig Andreas von Khevenhüller, Austrian field marshal (b. 1683)",
    "February 11 – Hedvig Taube, mistress to King Frederick I of Sweden (b. 1714)",
    "February 14 – John Hadley, English mathematician (b. 1682)",
    "March 3 – Jean Barbeyrac, French jurist (b. 1674)",
    "March 4 – John Anstis, English herald (b. 1669)",
    "April 25 – Anders Celsius, Swedish astronomer (b. 1701)",
    "May 25 – Charles Edzard, Prince of East Frisia (b. 1716)",
    "May 30 – Alexander Pope, English writer (b. 1688)",
    "June 29\nAndré Campra, French composer (b. 1660)\nJohn Eames, English academic (b. 1686)",
    "André Campra, French composer (b. 1660)",
    "John Eames, English academic (b. 1686)",
    "June 30 – Januarius Maria Sarnelli, Italian Roman Catholic priest and blessed (b. 1702)",
    "July – Mihai Racoviță, Prince of Moldavia and Prince of Wallachia",
    "August 9 – James Brydges, 1st Duke of Chandos, English patron of the arts (b. 1673)",
    "August 13 – John Cruger, Dutch-born Mayor of New York (b. 1678)",
    "August 26 – William Byrd II, prominent planter from Virginia (b. 1674)",
    "September 28 – Princess Thérèse of France, daughter of Louis XV of France (b. 1736)",
    "October 10 – Johann Heinrich Schulze, German professor and polymath (b. 1687)",
    "October 18 – Sarah Churchill, Duchess of Marlborough, English friend of Anne, Queen of Great Britain (b. 1660)",
    "October 31 – Leonardo Leo, Italian composer (b. 1694)",
    "December 8 – Marie Anne de Mailly-Nesle, French mistress of King Louis XV (b. 1717)",
    "December 23 – Élisabeth Charlotte d'Orléans, duchess and regent of Lorraine (b. 1676)",
    "date unknown – Catherine Jérémie, French-Canadian botanist (b. 1644)"
  ]
}