{
  "events": [
    "January 7 – War of the Austrian Succession: The Austrian Army, under the command of Field Marshal Károly József Batthyány, makes a surprise attack at Amberg and the winter quarters of the Bavarian Army, and scatters the Bavarian defending troops, then captures the Bavarian capital at Munich[1]",
    "January 8 – The Quadruple Alliance treaty is signed at Warsaw by Great Britain, Austria, the Dutch Republic and the Duchy of Saxony.[2]",
    "January 20 – Less than two weeks after the disastrous Battle of Amberg leaves Bavaria undefended, the electorate's ruler (and Holy Roman Emperor) Karl VII Albrecht dies from gout at the age of 47, leaving the duchy without an adult to lead it. His 17-year-old son, Maximilian III Joseph, signs terms of surrender in April.",
    "February 22 – The ruling white colonial government on the island of Jamaica foils a conspiracy by about 900 black slaves, who had been plotting to seize control and to massacre the white residents.[3]",
    "February 23 – The royal wedding of the Crown Prince of France takes place at Versailles; the Dauphin Louis Ferdiand, eldest son of King Louis XV, is united in marriage to Princess Maria Teresa Rafaela of Spain, daughter of King Felipe V.[4]  The Dauphin never takes the throne, dying in 1765, eight years before the death of his father.",
    "February 27 – Pierre Bouguer appears before the French Academy of Sciences to deliver his report of the data gathered in the French Geodesic Mission, including the first precise measurement of the Earth's circumference.[5]  His determination that the circumference is 24,854.85 miles (40,000.00 km) and that the distance from the pole to equator is roughly 6,214 miles (10,000 km) eventually leads to the Academy's calculation of the metre and the metric system.",
    "March 1 – Augustus III, the King of Poland and Elector of Saxony, declares his candidacy to become the next Holy Roman Emperor, but loses in September to Francis, Duke of Tuscany.[6]",
    "April 4 – (March 24, old style); Under the command of British Army General William Pepperrell, the first 4,300 American colonists in the New England Army depart Boston to liberate the French North American colony of Nova Scotia. The flotilla of 80 military transports and 18 armed escorts is scattered by a storm, but the first troops disembark at Canso, Nova Scotia, on April 15 and begin training while waiting for the arrival of the Royal Navy squadron commanded by Admiral Peter Warren[7]",
    "April 15 – War of the Austrian Succession – Battle of Pfaffenhofen: The Austrian Army drives the French Army out of Bavaria, forcing the Electorate of Bavaria to withdraw from the war.",
    "April 22 – Having recently turned 18, Bavaria's ruler Maximilian III agrees to sign the Treaty of Füssen with Austria, withdrawing Bavaria from further participation in the War of the Austrian Succession, and agreeing to support Austria's candidate for the next Holy Roman Emperor[8]",
    "April 29 – The heavily-armed French Navy frigate Renommée approaches the French colony of Nova Scotia, after having been dispatched to warn French forces at Louisbourg of the impending attack by British American forces. However, the Massachusetts privateer HMS Shirley Galley, commanded by John Rous, attacks the Renommée and forces it to sail away. The command at Louisbourg is not warned of the impending attack [7]",
    "May 11 – War of the Austrian Succession – Battle of Fontenoy: French forces defeat an Anglo-Dutch-Hanoverian army, including the Black Watch.[9]",
    "June 4 – Battle of Hohenfriedberg: In the battle that earned him the descriptor of \"Frederick the Great\", King Frederick II of Prussia decisively defeats the Austrian and Saxon armies, effectively ending the Second Silesian War.",
    "June 16 – King George's War: The British capture Cape Breton Island in North America from the French.[9]",
    "July 9 – War of the Austrian Succession – Battle of Melle:   The French are victorious in an engagement against the Pragmatic Allies.",
    "August 6  (July 26 Old Style) – The first recorded women's cricket match takes place in Surrey, England.[10]",
    "August 19 – The Jacobite rising of 1745 begins at Glenfinnan, Scotland, where Charles Edward Stuart raises his standard.",
    "September 1 – Catherine the Great marries Peter III of Russia, in Saint Petersburg.",
    "September 11 – Jacobite rising of 1745: Jacobites enter Edinburgh; six days later, Charles Edward Stuart proclaims his father James Francis Edward Stuart, as James VIII of Scotland.[9]",
    "September 12 – Francis I, the Grand Duke of Tuscany, is elected Holy Roman Emperor by the nine prince-electors of the Empire (from Bavaria, Bohemia, Brandenburg, Cologne, Hanover, Mainz, the Palatinate, Saxony, and Trier) with the support of his wife, Maria Theresa. He is the successor of Charles VII Albert of Bavaria, an enemy of the House of Habsburg, who died on January 20 of this year.",
    "September 14 – Madame de Pompadour is officially presented, at the court of Louis XV of France.",
    "September 16 – Jacobite rising of 1745 – \"Canter of Coltbrigg\": The British 13th and 14th Dragoons flee the Jacobites, near Edinburgh.",
    "September 21 – Battle of Prestonpans: British Government forces are defeated by the Jacobites in Scotland.",
    "October 4 – Francis is crowned as the new Holy Roman Emperor [11]",
    "October 8 – The Empress Elizabeth of Russia agrees to provide the Electorate of Saxony aid in its war against Prussia, but the agreement comes too late [6]",
    "October 11 – At Köslin (now Koszalin in Poland) Prussian scientist Ewald Georg von Kleist independently invents the first electrical capacitor to store and discharge electricity.[12]  The invention, commonly called the Leyden jar is later credited to a subsequent inventor Pieter van Musschenbroek.",
    "October 14 – In Amritsar in India's Punjab region, the Sikh parliament (the Sarbat Khalsa) votes for a major reorganization of the Sikh nation's army, the Dal Khalsa, with 25 cavalry regiments and support troops under the command of General Nawab Kapur Singh[13]",
    "November 1 – Pope Benedict XIV issues the encyclical Vix pervenit, referred to in English as \"On Usury and Other Dishonest Profit\", condemning the charging of interest on loans as a sin against the Roman Catholic Church [14]",
    "November 8 – Jacobite rising of 1745: Charles Edward Stuart, known popularly as \"Bonnie Prince Charlie\", crosses from Scotland into England for the first time since beginning his quest to place his father on the English throne as the pretender King James III. Charles arrives at Longtown in Cumbria and spends the night at a nearby village, the Riddings, then leads his army south along the right bank of the River Eden the next day [15]",
    "November 28 – King George's War: A combined force of troops from the French Army and of the Wabanaki Confederacy (Mi'kmaq, Maliseet, Passamaquoddy, Abenaki, and Penobscot tribes) destroys the British American settlement at Fort Saratoga (now Schuylerville, New York), burning the fort and surrounding buildings to the ground, and killing 15 people.[16]  Another 103 survivors are taken prisoner.",
    "December 4 – Jacobite rising of 1745: The Scottish Jacobite army reaches as far south as Derby in England, causing panic in London; two days later it begins to retreat.[9]",
    "December 17 – Two days after Prussian troops rout the Saxons at the Battle of Kesselsdorf, the Saxon capital of Dresden falls to Prussia's King Frederick the Great.[6]",
    "December 18 – Jacobite rising of 1745 –  Clifton Moor Skirmish: The Jacobites are victorious,[9] in the last action between two military forces on English soil.[17]",
    "December 23 – Jacobite rising of 1745 – Battle of Inverurie: The Jacobites are victorious over British royal troops.",
    "December 25 – The Treaty of Dresden gives Prussia full possession of Silesia.",
    "December 28 – For 5 days, fire destroys buildings in Istanbul."
  ],
  "births": [
    "c. January – Isaac Titsingh, Dutch scholar, merchant-trader and ambassador (d. 1812)",
    "January 1 – Anthony Wayne, United States Army officer, statesman and member of the United States House of Representatives (d. 1796)",
    "January 6 – Jacques-Étienne Montgolfier, French inventor (d. 1799)",
    "January 9 – Caleb Strong, American politician (d. 1819)",
    "February – Samuel Hearne, English explorer, fur-trader, author, and naturalist (d. 1792)",
    "February 2 – Hannah More, English religious writer, Romantic poet and philanthropist (d. 1833)",
    "February 18 – Alessandro Volta, Italian physicist (d. 1827)",
    "February 20 – Henry James Pye, English poet (d. 1813)",
    "February 21 – Olof Tempelman, Swedish architect (d. 1816)",
    "March 4\nCharles Dibdin, English composer (d. 1814)\nKazimierz Pułaski, American Revolutionary War general (d. 1779)",
    "Charles Dibdin, English composer (d. 1814)",
    "Kazimierz Pułaski, American Revolutionary War general (d. 1779)",
    "March 10 – John Gunby, Maryland soldier in the American Revolutionary War (d. 1807)",
    "March 25 – John Barry, officer in the Continental Navy during the American Revolutionary War and later in the United States Navy (d. 1803)",
    "April 6 – Thomas Peters, Dutch supercentenarian (d. 1857)",
    "April 20 – Philippe Pinel, French physician (d. 1826)",
    "April 29 – Oliver Ellsworth, Chief Justice of the United States (d. 1807)",
    "July 8 – Sara Banzet, French educator and diarist (d. 1774)",
    "July 13 – Robert Calder, British naval officer (d. 1818)",
    "August 20 – Francis Asbury, American Methodist Bishop (d. 1816)",
    "August 30 – Johann Hieronymus Schröter, German astronomer (d. 1816)",
    "September 4 – Schneur Zalman of Liadi, Russian rabbi and founder of Chabad (d. 1812)",
    "September 16 – Mikhail Illarionovich Kutuzov, Russian field marshal (d. 1813)",
    "November 7 – Prince Henry, Duke of Cumberland and Strathearn, member of the British Royal Family (d. 1793)",
    "November 13 – Valentin Haüy, French educator, founder of the first school for the blind (d. 1822)",
    "November 23 – John Treadwell, the fourth Governor of Connecticut (d. 1823)",
    "December 2 – Queen Jeongsun, Korean regent (d. 1805)",
    "December 12 – John Jay, American politician and 1st Chief Justice of the United States (died 1829)",
    "December 15 – Johann Gottfried Koehler, German astronomer (d. 1801)",
    "December 24 – William Paterson, American politician and Associate Justice of the Supreme Court of the United States (d. 1806)",
    "date unknown\nMicaela Bastidas Puyucahua, Peruvian indigenous rebel leader (d. 1781)\nGim Hongdo (Danwon), Korean painter (d. 1806)\nRobert H. Harrison, American jurist and lieutenant colonel of the Continental Army (d. 1790)\nOlaudah Equiano (Gustavus Vassa), slave, abolitionist, author (d. 1797)",
    "Micaela Bastidas Puyucahua, Peruvian indigenous rebel leader (d. 1781)",
    "Gim Hongdo (Danwon), Korean painter (d. 1806)",
    "Robert H. Harrison, American jurist and lieutenant colonel of the Continental Army (d. 1790)",
    "Olaudah Equiano (Gustavus Vassa), slave, abolitionist, author (d. 1797)"
  ],
  "deaths": [
    "January 16 – Josiah Franklin, English-born American businessman, father of Benjamin Franklin (b. 1657)",
    "January 20 – Charles VII, Holy Roman Emperor (b. 1697)",
    "February 23 – Joseph Effner, German architect (b. 1687)",
    "February 26 – Henry Scudamore, 3rd Duke of Beaufort, English nobleman (b. 1707)",
    "March 27 – Tommaso Crudeli, Florentine free thinker imprisoned by the Roman Inquisition (b. 1702)",
    "March 18 – Robert Walpole, first Prime Minister of Great Britain (b. 1676)[18]",
    "May 9 – Tomaso Antonio Vitali, Italian violinist and composer (b. 1663)",
    "May 22 – François-Marie, 1st duc de Broglie, French military leader (b. 1671)",
    "September 30 – Sir John Baird, 2nd Baronet, British politician (b. 1686)",
    "October 19 – Jonathan Swift, Anglo-Irish writer (b. 1667)",
    "October 22 – Isaac Greenwood, American mathematician (b. 1702)",
    "November 16 – James Butler, 2nd Duke of Ormonde, exiled Irish statesman and soldier (b. 1665)",
    "December 8 – Étienne Fourmont, French orientalist (b. 1683)",
    "December 19 – Jean-Baptiste van Loo, French painter (b. 1684)",
    "December 23 – Jan Dismas Zelenka, Bohemian composer (b. 1679)",
    "date unknown – Hedvig Catharina De la Gardie, Swedish-born salonnière (b. 1695)"
  ]
}