{
  "events": [
    "January 3 – The third Treaty of Hopewell is signed, between the United States of America and the Choctaw.",
    "January 6 – The outward bound East Indiaman Halsewell is wrecked on the south coast of England in a storm, with only 74 of more than 240 on board surviving.[1]",
    "February 2 – In a speech before The Asiatic Society in Calcutta, Sir William Jones notes the formal resemblances between Latin, Greek, and Sanskrit, laying the foundation for comparative linguistics and Indo-European studies.",
    "March 1 – The Ohio Company of Associates is organized by five businessman at a meeting at the Bunch-of-Grapes Tavern in Boston, to purchase land from the United States government to form settlements in what is now the U.S. state of Ohio.[2][3]",
    "March 13 – Construction begins in Dublin on the Four Courts Building, with the first stone laid down by the United Kingdom's Viceroy for Ireland, the Duke of Rutland.[4]",
    "April 2 – The Creek Nation declares war on the U.S. State of Georgia over the matter of white settlers on land not ceded by the Creek nation.   A truce is negotiated on April 17 between Creek Chief Alexander McGillivray (Hoboi-Hili-Miko) and U.S. Army General Lachlan McIntosh but is soon repudiated.[5]",
    "April 11 – Columbia College (now Columbia University) holds its first graduation, with eight students, including DeWitt Clinton.[6]",
    "April 25 – The United States and the Kingdom of Portugal sign their first commercial treaty, but it is never ratified.[7]",
    "April 27 – British astronomer William Herschel publishes his first list of his discoveries, Catalogue of One Thousand New Nebulae and Clusters of Stars; two additional books are published in 1789 and 1802.[8]",
    "May 1 – Mozart's opera The Marriage of Figaro premieres in Vienna.",
    "May 21 – The trial in the Affair of the Diamond Necklace ends in Paris.",
    "June 2 – The Tignon law is enacted by Spanish Governor of Louisiana Esteban Rodríguez Miró, to force black women to wear a tignon headscarf.[9]",
    "June 6 – Nathaniel Gorham is chosen as the new President of the U.S. Confederation Congress to substitute for John Hancock, who cannot take office because of illness.[10]",
    "June 10 – An earthquake-caused landslide dam on the Dadu River gives way, killing 100,000 in the Sichuan province of China.",
    "June 25 – Gavriil Pribylov discovers St. George Island of the Pribilof Islands in the Bering Sea.",
    "July 14 – Convention of London between the Kingdom of Great Britain and the Kingdom of Spain: British settlements on the Mosquito Coast of Central America are to be evacuated; Spain expands the territory available to the British in Belize on the Yucatán Peninsula, for cutting mahogany.",
    "July 31 – The Kilmarnock volume of Robert Burns' Poems, Chiefly in the Scottish Dialect is published in Scotland.",
    "August\nJames Rumsey tests his first steamboat on the Potomac River, at Shepherdstown, Virginia.\nThe Cabinet of Great Britain approves the establishment of a penal colony, at Botany Bay in Australia.",
    "James Rumsey tests his first steamboat on the Potomac River, at Shepherdstown, Virginia.",
    "The Cabinet of Great Britain approves the establishment of a penal colony, at Botany Bay in Australia.",
    "August 1 – Caroline Herschel discovers a comet (the first discovered by a woman).",
    "August 8 – Mont Blanc is climbed for the first time, by Dr. Michel-Gabriel Paccard and Jacques Balmat.",
    "August 11 – Captain Francis Light acquires the island of Penang from the Sultan of Kedah on behalf of the British East India Company, renaming it Prince of Wales Island in honour of the heir to the British throne,[11] the first colony of the British Empire in Southeast Asia.",
    "August 17 – The paternal nephew of Frederick the Great, Frederick William, becomes King of Prussia, as Frederick William II.",
    "August 18 – The Kingdom of Denmark (including Norway) charters six settlements in Iceland to trade with it, thus ending the Danish–Icelandic Trade Monopoly, and founding Reykjavík.",
    "August 29 – Shays' Rebellion begins in Massachusetts.",
    "September–December – Goethe undertook his Italian Journey (published in 1817).",
    "September 2 – A hurricane strikes Barbados.",
    "September 11–14 – The Annapolis Convention is held by delegates from six of the 13 states (Maryland, Virginia, Pennsylvania, Delaware, New Jersey and New York) resulting in the scheduling of the Philadelphia Convention to draft a national constitution.[10]",
    "September 14 – Connecticut cedes to the United States all of its claims to lands between the 41st and 42nd parallels north and west of the Connecticut Western Reserve.[10]",
    "September 26 – Eden Agreement: A commercial treaty is signed between the Kingdoms of Great Britain and France.[12]",
    "October 6 – HMS Bellerophon begins service with the Royal Navy.[13]",
    "October 10 – The Confederation Congress of the United States directs backpay for seven months for Virginia officers who have been waiting since 1782.[14]",
    "October 12 – King George III of the United Kingdom appoints Captain Arthur Phillip as the first Governor of New Holland, which comprises the area of modern Australia from the 135th meridian east to the east coast and all adjacent islands in the Pacific Ocean.[15]",
    "October 16 – The Confederation Congress establishes the United States Mint to make common coinage and currency for the U.S., to replace individual state coins.[10]",
    "October 23\nThe 13th century AH begins on the Islamic calendar on the 1st of Muharram 1201 AH\nThe settlement of Östersund is established in Sweden.[16]",
    "The 13th century AH begins on the Islamic calendar on the 1st of Muharram 1201 AH",
    "The settlement of Östersund is established in Sweden.[16]",
    "October 24 – General David Cobb of the Massachusetts militia defeats a body of rebel insurgents at Taunton, Massachusetts in one of the battles of Shays' Rebellion.[17]",
    "November 7 – The oldest musical organization in the United States, the Stoughton Musical Society, is founded.",
    "November 30 – Peter Leopold Joseph of Habsburg-Lorraine, Grand Duke of Tuscany, promulgates a penal reform, making his country the first state to abolish the death penalty. November 30 is therefore commemorated by 300 cities around the world, as Cities for Life Day.",
    "December 4 – Mission Santa Barbara is founded by Padre Fermín Lasuén as the tenth of the Spanish missions in California.  December 4: Mission Santa Barbara is founded.",
    "December 20 – Robert Burns's Address to a Haggis is first published, in Edinburgh.",
    "The town of Martinsborough, North Carolina, named for Royal Governor Josiah Martin in 1771, is renamed \"Greenesville\" in honor of United States General Nathanael Greene by the North Carolina General Assembly (the name \"Greenesville\" is later shortened, to become Greenville).",
    "The last reliably recorded wolf in Ireland is hunted down and killed near Mount Leinster, County Carlow, for killing sheep.[18]"
  ],
  "births": [
    "January 7 – John Catron, Associate Justice of the Supreme Court of the United States (d. 1865)",
    "January 8 – Nicholas Biddle, President of the Second Bank of the United States (d. 1844)",
    "January 11 – Joseph Jackson Lister, English opticist, physician (d. 1869)",
    "January 12 – Sir Robert Inglis, Bt, English politician (d. 1855)",
    "January 23 – Auguste de Montferrand, French architect (d. 1858)",
    "February 16 – Maria Pavlovna of Russia, Grand Duchess of Saxe-Weimar Eisenach (d. 1859)",
    "February 24 – Martin W. Bates, U.S. Senator from Delaware (d. 1869)",
    "February 26 – François Arago, French astronomer, physicist and politician (d. 1853)",
    "February 24 –  Wilhelm Grimm, German philologist, folklorist (d. 1859)",
    "March 4 – Agustina de Aragón, Spanish heroine (d. 1857)",
    "March 22 – Joachim Lelewel, Polish historian (d. 1861)",
    "March 25 –  Giovanni Battista Amici, Italian astronomer, microscopist and botanist (d. 1863)",
    "April 7 – William R. King, 13th Vice President of the United States (d. 1853)",
    "April 16 – John Franklin, British naval officer and explorer (d. 1847)",
    "April 28 – Elizabeth Andrew Warren, Cornish botanist, marine algolologist (d. 1864)",
    "May 12 – Jean-François Barrière, French historian (d. 1868)",
    "May 29 – Alexander Bryan Johnson, American philosopher (d. 1867)",
    "June 13 – Winfield Scott, American general, Presidential candidate (d. 1866)",
    "August 17\nDavy Crockett, American frontiersman (d. 1836)\nPrincess Victoria of Saxe-Coburg-Saalfeld, mother of Queen Victoria (d. 1861)",
    "Davy Crockett, American frontiersman (d. 1836)",
    "Princess Victoria of Saxe-Coburg-Saalfeld, mother of Queen Victoria (d. 1861)",
    "August 25 – King Ludwig I of Bavaria (d. 1868)",
    "August 31 – Michel Eugène Chevreul, French chemist (d. 1889)",
    "September 10\nNicolás Bravo, 3-time President of Mexico (d. 1854)\nWilliam Mason, American politician (d. 1860)",
    "Nicolás Bravo, 3-time President of Mexico (d. 1854)",
    "William Mason, American politician (d. 1860)",
    "September 11 – Friedrich Kuhlau, German composer (d. 1832)",
    "September 18\nKing Christian VIII of Denmark (d. 1848)\nJustinus Kerner, German physician (d. 1862)",
    "King Christian VIII of Denmark (d. 1848)",
    "Justinus Kerner, German physician (d. 1862)",
    "September 24 – Charles Bianconi, Italian-Irish entrepreneur (d. 1875)",
    "September 29 – Guadalupe Victoria, 1st President of Mexico (d. 1843)",
    "November 18\nHenry Bishop, English composer (d. 1855)\nCarl Maria von Weber, German composer (d. 1826)",
    "Henry Bishop, English composer (d. 1855)",
    "Carl Maria von Weber, German composer (d. 1826)",
    "December 12 – William L. Marcy, American statesman (d. 1857)",
    "Moulvi Abdul Ali, Bengali landlord and philanthropist (d. 1866)[19]",
    "Caroline Cornwallis, English writer (d. 1858)",
    "Kim Jeong-hui, Korean epigrapher (d. 1856)",
    "probable – Moshoeshoe I of Lesotho (d. 1870)"
  ],
  "deaths": [
    "January 4 – Moses Mendelssohn, Jewish philosopher (b. 1729)",
    "January 7 – Jean-Étienne Guettard, French physician, scientist (b. 1715)",
    "January 14 – Meshech Weare, Governor of New Hampshire (b. 1713)",
    "January 26 – Hans Joachim von Zieten, Prussian field marshal (b. 1699)",
    "February 25 – Thomas Wright, British astronomer (b. 1711)",
    "February 28 – John Gwynn, English architect and engineer (b. 1713)",
    "March 11 – Charles Humphreys, American delegate to the Continental Congress (b. 1714)",
    "April 10 – John Byron, British naval officer (b. 1723)",
    "April 20 – John Goodricke, English astronomer (b. 1764)",
    "May 1 – Benjamin Waller, American politician (b. 1716)",
    "May 2 – Petronella Johanna de Timmerman, Dutch poet, scientist (b. 1723)",
    "May 15 – Eva Ekeblad, Swedish scientist and agronomist, first female member of the Royal Swedish Academy of Sciences (b. 1724)",
    "May 19 – John Stanley, English composer (b. 1712)",
    "May 21 – Carl Wilhelm Scheele, Swedish chemist (b. 1742)",
    "May 22 – Carl Fredrik Mennander, Swedish bishop (b. 1712)",
    "May 25 – Peter III of Portugal, consort of Queen Maria I of Portugal (b. 1717)",
    "June 17 – Adam Drummond, British politician (b. 1713)",
    "June 19 – Nathanael Greene, major general in the Continental Army, 3rd Quartermaster General (b. 1742)",
    "July 28 – Carlo Marchionni, Italian architect (b. 1702)",
    "August 17 – King Frederick II of Prussia (\"Frederick the Great\") (b. 1712)",
    "August 27 – Carl Fredrik Scheffer, Swedish politician (b. 1715)",
    "September 5 – Jonas Hanway, English merchant, traveler, and philanthropist (b. 1712)",
    "September 17 – Tokugawa Ieharu, Japanese shōgun (b. 1737)",
    "September 18 – Giovanni Battista Guadagnini, Italian luthier (b. 1711)",
    "October 2 – Augustus Keppel, 1st Viscount Keppel, British admiral (b. 1725)",
    "October 5 – Johann Gottlieb Gleditsch, German botanist (b. 1714)",
    "October 17 – Johann Ludwig Aberli, Swiss artist (b. 1723)",
    "October 20 – Humphrey Sturt, British architect (b. 1725)",
    "October 31 – Princess Amelia of Great Britain, Second daughter of George II of Great Britain (b. 1711)",
    "November 30 – Bernardo de Gálvez, Spanish military leader who aided the United States in its quest for independence, in the American Revolutionary War (b. 1746)",
    "December 26 – Gasparo Gozzi, Italian critic, dramatist (b. 1713)"
  ]
}