{
  "events": [
    "January 16 – The first Dutch (and general) elections are held for the National Assembly of the Batavian Republic. (The next Dutch general elections are held in 1888.)",
    "February 1 – The capital of Upper Canada is moved from Newark to York.",
    "February 9 – The Qianlong Emperor of China abdicates at age 84 to make way for his son, the Jiaqing Emperor.",
    "February 15 – French Revolutionary Wars: The Invasion of Ceylon (1795) ends when Johan van Angelbeek, the Batavian governor of Ceylon, surrenders Colombo peacefully to British forces.",
    "February 16 – The Kingdom of Great Britain is granted control of Ceylon by the Dutch.[1]",
    "February 29 – Ratifications of the Jay Treaty between Great Britain and the United States are officially exchanged, bringing it into effect.[2]",
    "March 9 – Widow Joséphine de Beauharnais marries General Napoléon Bonaparte.",
    "March 20 – The U.S. House of Representatives demands that the U.S. State Department supply it with documents relating to the negotiation of the Jay Treaty; President Washington declines the request, citing that only the U.S. Senate has jurisdiction over treaties.[2]",
    "March 26 – Napoleon Bonaparte arrives at Nice to take command of the Army of Italy (37,000 men and 60 guns), which is scattered in detachments as far as Genoa.[3]",
    "March 30 – Carl Gauss obtains conditions for the constructibility by ruler and compass of regular polygons, and is able to announce that the regular 17-gon is constructible by ruler and compasses.",
    "April 2 – The only night of the supposed Shakespearean play Vortigern and Rowena (actually written by William Henry Ireland) ends in the audience's laughter.",
    "April 12 – War of the First Coalition – Battle of Montenotte: Napoleon Bonaparte gains his first victory as an army commander.",
    "April 26 – The French proclaim the Republic of Alba on the occupied territories. Two days later, King Victor Amadeus III of Sardinia signs the Armistice of Cherasco, in the headquarters of Napoleon. The fortresses of Coni, Tortoni and Alessandria, with all their guns, are given up.[4]",
    "April 27 – Case of the Lyons Mail: During the night, five highwaymen attack the mail between Paris and Lyon, kill the postmen and steal the funds sent to the armies in Italy.",
    "April 28 – In an impassioned speech, U.S. Representative Fisher Ames of Massachusetts persuades his fellow members of the House to support the Jay Treaty. [2]",
    "May 6 – Napoleon Bonaparte forms an advanced guard (3,500 infantry and 1,500 cavalry) under General Claude Dallemagne. He sends this force along the south bank of the Po River, to cross it with boats at Piacenza.[5]",
    "May 10\nWar of the First Coalition – Battle of Lodi: General Napoleon Bonaparte defeats the Austrian rearguard, in forcing a crossing of the bridge over the Adda River in Italy. The Austrians lose some 2,000 men, 14 guns, and 30 ammunition wagons.\nPersian Expedition of 1796: Russian troops storm Derbent.",
    "War of the First Coalition – Battle of Lodi: General Napoleon Bonaparte defeats the Austrian rearguard, in forcing a crossing of the bridge over the Adda River in Italy. The Austrians lose some 2,000 men, 14 guns, and 30 ammunition wagons.",
    "Persian Expedition of 1796: Russian troops storm Derbent.",
    "May 14 – Edward Jenner administers the first smallpox vaccination, in England.",
    "May 15 – Napoleon's troops take Milan.",
    "May 20 – The last mock Garrat Elections are held in Surrey, England.",
    "June 1\nThe French-Republican army divisions of the Army of Italy invade the territories of the Serenissima Repubblica di San Marco.\nTennessee is admitted as the 16th U.S. state.  [2]",
    "The French-Republican army divisions of the Army of Italy invade the territories of the Serenissima Repubblica di San Marco.",
    "Tennessee is admitted as the 16th U.S. state.  [2]",
    "June 6–7 – Ragunda lake in Sweden bursts and drains completely leaving the Döda fallet dry.",
    "June 21 – British explorer Mungo Park becomes the first European to reach the Niger River.[1]",
    "June 23 – Napoleon Bonaparte seizes the Papal States, which become part of the revolutionary Cisalpine Republic. Pope Pius VI signs the Armistice of Bologna, and is forced to pay a contribution (34 million francs).",
    "July 10 – Carl Friedrich Gauss discovers that every positive integer is representable as a sum of at most 3 triangular numbers.",
    "July 11 – The United States takes possession of Detroit from Great Britain, under the terms of the Jay Treaty.",
    "July 21 – Mungo Park reaches Ségou, the capital of the Bamana Empire.",
    "July 22 – Surveyors of the Connecticut Land Company name an area in Ohio Cleveland, after Gen. Moses Cleaveland, the superintendent of the surveying party.",
    "July 29 – The Habsburg army under Marshal Wurmser advances from the Alps, and captures Rivoli and Verona. The French abandon the east bank of the Mincio River, the outnumbered division (15,000 men) of Masséna retreats towards Lake Garda.",
    "August 4 – French Revolutionary Wars: Battle of Lonato – The French Army of Italy under Napoleon crushes an Austrian brigade.",
    "August 5 – French Revolutionary Wars: Battle of Castiglione – The French Army of Italy under Napoleon defeats the Habsburg army (25,000 men) under Marshal Wurmser, who thus fails to break the Siege of Mantua (1796–97), and is forced to retreat north up the Adige Valley.",
    "August 9 – The Wearmouth Bridge in England, designed by Thomas Paine in cast iron, opens to traffic. Its span of 72 m (236 ft) makes it the world's longest single-span vehicular bridge extant at this date.[6][7][8]",
    "August 10 – A mob of peasants overtakes the Convent of St. Peter (Bludenz, Austria) and murders Ignaz Anton von Indermauer.",
    "August 19 – Second Treaty of San Ildefonso: Spain and France form an alliance against Great Britain.",
    "September 2 – Jewish emancipation in the Batavian Republic (Netherlands).",
    "September 8 – French Revolutionary Wars: Battle of Bassano – French forces (20,000 men) under André Masséna defeat the Austrians in Veneto. Wurmser retreats towards Vicenza with just 3,500 men of his originally 11,000 left to him.",
    "September 15 – Siege of Mantua: Napoleon Bonaparte fights a pitched battle at La Favorita on the east side of the Mincio River. The Austrians withdraw into the fortress of Mantua, which is crowded nearly with 30,000 men. Within six weeks, 4,000 die from wounds or sickness.[9]",
    "September 17 – U.S. President George Washington issues his Farewell Address, which warns against partisan politics and foreign entanglements.  In addition, he sets a precedent by declining to run for a third term.  [2]",
    "September 28 – Empress Catherine the Great signs an agreement with Great Britain, formally joining Russia to the coalition.",
    "October 19 – French Revolutionary Wars: Battle of Emmendingen – Austrian forces force the French to retreat, but commanding generals on both sides are killed.",
    "October – Jane Austen begins writing her first draft of Pride and Prejudice, under the title First Impressions (the book will not be published until 1813).",
    "November 3 – John Adams defeats Thomas Jefferson, in the U.S. presidential election.",
    "November 4 – The Treaty of Tripoli (between the United States and Tripoli) is signed at Tripoli (see also 1797).",
    "November 6\nCatherine the Great dies, and is succeeded by her son Paul I of Russia. His wife Sophie Marie Dorothea of Württemberg becomes Empress consort.\nFrench forces (9,500 men) under Masséna attack the Austrian army at Fontaniva. After a desperate assault he is outnumbered, and forced to retreat to Verona.",
    "Catherine the Great dies, and is succeeded by her son Paul I of Russia. His wife Sophie Marie Dorothea of Württemberg becomes Empress consort.",
    "French forces (9,500 men) under Masséna attack the Austrian army at Fontaniva. After a desperate assault he is outnumbered, and forced to retreat to Verona.",
    "November 12\nBattle of Caldiero: French forces are defeated by the Austrians at Caldiero, and pushed back to Verona. This marks Napoleon's first defeat, losing nearly 2,000 men and 2 guns.[10]\nGroton, New Hampshire is incorporated as a town.",
    "Battle of Caldiero: French forces are defeated by the Austrians at Caldiero, and pushed back to Verona. This marks Napoleon's first defeat, losing nearly 2,000 men and 2 guns.[10]",
    "Groton, New Hampshire is incorporated as a town.",
    "November 17 – Battle of Arcole: French forces under General Napoleon defeat the Austrians at Arcole. After a bold maneuver, he outflanks the Austrian army (24,000 men) under Freiherr József Alvinczi, and cuts off its line of retreat. Alvinczi is forced to take up a defensive position behind the Brenta River.[10]",
    "December – The British government begins work on a 40-acre (162,000 m²) site at Norman Cross, for the world's first purpose-built prisoner-of-war camp.[11]",
    "December 7 – The U.S. Electoral College meets to elect John Adams president of the United States.",
    "December 18 – British Royal Navy ship HMS Courageux is wrecked on the Barbary Coast with the loss of 464 of the 593 onboard.",
    "The Spanish government lifts the restrictions against neutrals trading with the colonies, thus acknowledging Spain's inability to supply the colonies with needed goods and markets.",
    "Robert Burns's version of the Scots poem Auld Lang Syne is first published, in this year's volume of The Scots Musical Museum.[12]",
    "Annual British iron production reaches 125,000 tons.",
    "Rizla rolling papers established.",
    "Shinyukan School, predecessor of Keio Gijyuku University, founded in Nakatsu, Kyushu Island, Japan.[citation needed]"
  ],
  "births": [
    "January 7 – Princess Charlotte Augusta of Wales, daughter and only child of future King George IV (d. 1817)",
    "January 23 – Karl Ernst Claus, Baltic-German chemist, naturalist (d. 1864)",
    "January 25 – William MacGillivray, Scottish naturalist, ornithologist (d. 1852)",
    "February 17\nFrederick William Beechey, English naval officer, geographer (d. 1856)\nPhilipp Franz von Siebold, German physician, botanist and explorer (d. 1866)",
    "Frederick William Beechey, English naval officer, geographer (d. 1856)",
    "Philipp Franz von Siebold, German physician, botanist and explorer (d. 1866)",
    "February 22 – Adolphe Quetelet, Belgian mathematician (d. 1874)",
    "March 18 – Jakob Steiner, Swiss mathematician (d. 1863)",
    "April 30 – Adolphe Crémieux, French-Jewish politician, abolitionist (d. 1880)",
    "May 1 – Junius Brutus Booth, English stage actor, father of Edwin Booth and John Wilkes Booth (d. 1852)",
    "May 2  – Colm de Bhailís, Irish poet and songwriter (d. 1906)",
    "May 4 – Horace Mann, American educator, abolitionist (d. 1859)",
    "May 7 – Frances Catherine Barnard, English author (d. 1869)",
    "June 1 – Nicolas Léonard Sadi Carnot, French military engineer and physicist; father of thermodynamics (d. 1832)",
    "June 12 – George Bush (biblical scholar), American professor of Asian languages (d. 1859)",
    "June 14 – Nikolai Brashman, Russian mathematician of Czech origin (d. 1866)",
    "June 28 – Caroline Amalie of Augustenburg, queen consort of Denmark (d. 1881)",
    "July 6 – Emperor Nicholas I of Russia, Russian officer (d. 1855)",
    "July 15 – Gustav Seyffarth, German-American Egyptologist (d. 1885)",
    "July 16 – Jean-Baptiste-Camille Corot, French painter (d. 1875)",
    "July 22 – Carlo Pepoli, Italian politician, journalist (d. 1881)",
    "July 23 – Franz Berwald, Swedish composer (d. 1868)",
    "August 15 – John Torrey, American botanist (d. 1873)",
    "August 25 – James Lick, American land speculator (d. 1876)",
    "September 4 – Karl Eberhard Herwarth von Bittenfeld, Prussian field marshal (d. 1884)",
    "September 10 – Eugénie Niboyet, French author, feminist (d. 1883)",
    "September 19 – Hartley Coleridge, British poet (d. 1849)",
    "September 22 – David Canabarro, Brazilian Gaúcho revolutionary (d. 1867)",
    "September 25 – Antoine-Louis Barye, French sculptor (d. 1875)",
    "October 23 – Stefano Franscini, member of the Swiss Federal Council (d. 1857)",
    "November 25 – Andreas von Ettingshausen, German mathematician, physicist (d. 1878)",
    "November 30 – Carl Loewe, German composer (d. 1869)",
    "December 17 – Thomas Chandler Haliburton, Canadian author (d. 1865)",
    "December 19 – Manuel Bretón de los Herreros, Spanish playwright (d. 1873)",
    "December 27\nMirza Ghalib, Persian poet of Urdu (d. 1869)\nKarl Friedrich von Steinmetz, Prussian field marshal (d. 1877)",
    "Mirza Ghalib, Persian poet of Urdu (d. 1869)",
    "Karl Friedrich von Steinmetz, Prussian field marshal (d. 1877)",
    "Du Bois Agett, early settler of Western Australia (d. 1866)",
    "Edwin Beard Budding, English engineer and inventor of the lawnmower (d. 1846)",
    "Mirza Shafi Vazeh, Azeri poet (d. 1852)"
  ],
  "deaths": [
    "January 1\nAlexandre-Théophile Vandermonde French musician and chemist (b. 1735)\nGiambattista Vasco, Italian economist (b. 1733)",
    "Alexandre-Théophile Vandermonde French musician and chemist (b. 1735)",
    "Giambattista Vasco, Italian economist (b. 1733)",
    "January 5 – Samuel Huntington, Connecticut jurist (b. 1731)",
    "January 5 – Anna Barbara Reinhart, Swiss mathematician (b. 1730)",
    "January 13 – John Anderson, Scottish scientist and inventor (b. 1726)",
    "February 7 – Sir Francis Geary, 1st Baronet, officer of the British Royal Navy (b. 1709)",
    "February 14 – Samuel Pegge, English antiquary (b. 1704)",
    "February 15 – John Caesar Australian bushranger of African descent (b. 1763)",
    "February 17 – James Macpherson, Scottish writer (b. 1736)",
    "February 25 – Jean-Nicolas Stofflet, French royalist general (executed) (b. 1751)",
    "February 28 – Friedrich Wilhelm Rust, German violinist (b. 1739)",
    "March 1 – Carl Fredrik Adelcrantz, Swedish architect and civil servant (b. 1716)",
    "March 3 – Pierre-René Rogue, French Catholic priest, member of the Congregation of the Mission (b. 1758)",
    "March 6 – Guillaume Thomas François Raynal, French writer, man of letters during the Age of Enlightenment (b. 1713)",
    "March 10\nWilliam Chambers, Scottish-Swedish architect (b. 1723)\nJohn Forbes, British Royal Navy officer (b. 1714)",
    "William Chambers, Scottish-Swedish architect (b. 1723)",
    "John Forbes, British Royal Navy officer (b. 1714)",
    "March 12 – Franz Töpsl, Augustinian Canon Regular (b. 1711)",
    "March 16 – Joseph Gerrald, Scottish political reformer (b. 1763)",
    "March 19 – Hugh Palliser, British naval officer, administrator (b. 1722)",
    "March 26 – François de Charette, French Royalist soldier, politician (b. 1763)",
    "March 30 – Princess Augusta Wilhelmine of Hesse-Darmstadt (b. 1765)",
    "April 2 – Ulrika Pasch, Swedish rococo painter and miniaturist (b. 1735)",
    "April 6 – George Campbell, Scottish minister (b. 1719)",
    "April 9 – Frederick Albert, Prince of Anhalt-Bernburg, German prince of the House of Ascania (b. 1735)",
    "April 11 – François-Antoine Devaux, French writer (b. 1712)",
    "April 16 – Molly Brant Mohawk United Empire Loyalist (d. c.1736)",
    "April 17 – Raja Chamaraja Wodeyar IX of Mysore (b. 1774)",
    "April 30 – Franciszka Corvin-Krasińska, Polish noblewoman, morganatic wife of Charles of Saxony (b. 1742)",
    "May 1 – Alexandre Guy Pingré, Catholic priest and scientist (b. 1711)",
    "May 2 – Juan García Ruiz, bishop of Nueva Segovia (1784–1796) (b. 1728)",
    "May 6 – Adolph Freiherr Knigge, German writer, Freemason (b. 1752)",
    "May 12 – Johann Uz, German poet (b. 1720)",
    "May 13 – John Butler, Loyalist who led an irregular militia unit during the American Revolutionary War (b. 1728)",
    "May 17 – Gotthard Friedrich Stender, Baltic-German Lutheran priest who played an outstanding role in Latvia's history of culture (b. 1714)",
    "May 28 – Caroline of Stolberg-Gedern, Princess of Stolberg-Gerdern by birth and by marriage a princess of Hohenlohe-Langenburg (b. 1732)",
    "May 29 – Carl Fredrik Pechlin, Swedish politician and demagogue (b. 1720)",
    "June 7 – Elisabetta Caminèr Turra, Venetian writer (b. 1751)",
    "June 8\nJean-Marie Collot d'Herbois, French revolutionary (b. 1749)\nFelice Giardini, Italian composer, violinist (b. 1716)",
    "Jean-Marie Collot d'Herbois, French revolutionary (b. 1749)",
    "Felice Giardini, Italian composer, violinist (b. 1716)",
    "June 9 – José Álvarez de Toledo, Duke of Alba, patron of the artist Francisco Goya (b. 1756)",
    "June 11\nNathaniel Gorham, Massachusetts politician, merchant (b. 1738)\nSamuel Whitbread, English brewer, politician (b. 1720)",
    "Nathaniel Gorham, Massachusetts politician, merchant (b. 1738)",
    "Samuel Whitbread, English brewer, politician (b. 1720)",
    "June 14\nCharles Albert II, Prince of Hohenlohe-Waldenburg-Schillingsfürst, 3rd Prince of Hohenlohe-Waldenburg-Schillingsfürst from 1793 to 1796 (b. 1742)\nJohn Laforey, British naval officer (b. 1729)",
    "Charles Albert II, Prince of Hohenlohe-Waldenburg-Schillingsfürst, 3rd Prince of Hohenlohe-Waldenburg-Schillingsfürst from 1793 to 1796 (b. 1742)",
    "John Laforey, British naval officer (b. 1729)",
    "June 16\nCharles of Saxony, Duke of Courland, German prince from the House of Wettin and Duke of Courland (b. 1733)\nWalter Stewart, Irish-born American general during the American Revolutionary War (b. 1756)",
    "Charles of Saxony, Duke of Courland, German prince from the House of Wettin and Duke of Courland (b. 1733)",
    "Walter Stewart, Irish-born American general during the American Revolutionary War (b. 1756)",
    "June 19 – Consider Tiffany, British loyalist (b. 1732)",
    "June 21 – Richard Gridley, American Revolutionary soldier (b. 1710)",
    "June 25 – Johann Philipp Siebenkees, German philosopher (b. 1759)",
    "June 26 – David Rittenhouse, American astronomer, inventor, mathematician, surveyor, scientific instrument craftsman and public official (b. 1732)",
    "June 28 – Antonio Maria Lorgna, Italian mathematician (b. 1735)",
    "June 30 – Abraham Yates Jr., American lawyer, civil servant from Albany (b. 1724)",
    "July 8\nJohn Mills, American soldier, officer (b. 1754)\nAdam Naruszewicz, Polish-Lithuanian nobleman (b. 1733)",
    "John Mills, American soldier, officer (b. 1754)",
    "Adam Naruszewicz, Polish-Lithuanian nobleman (b. 1733)",
    "July 16\nWilliam Gerard Hamilton, English statesman  (b. 1729)\nGeorge Howard, British field marshal (b. 1718)",
    "William Gerard Hamilton, English statesman  (b. 1729)",
    "George Howard, British field marshal (b. 1718)",
    "July 17 – John Christopher Hartwick, Lutheran minister in Colonial America, founder of Hartwick College (b. 1714)",
    "July 20 – John Houstoun, American lawyer, statesman from Savannah (b. 1744)",
    "July 21\nRobert Burns, Scottish poet (b. 1759)\nPhilip Carteret, British naval officer, explorer in two circumnavigation expeditions (b. 1733)",
    "Robert Burns, Scottish poet (b. 1759)",
    "Philip Carteret, British naval officer, explorer in two circumnavigation expeditions (b. 1733)",
    "August 1\nRobert Pigot, 2nd Baronet, British Army officer during the American Revolutionary War (b. 1720)\nSir Robert Pigot, 2nd Baronet, British army officer (b. 1720)",
    "Robert Pigot, 2nd Baronet, British Army officer during the American Revolutionary War (b. 1720)",
    "Sir Robert Pigot, 2nd Baronet, British army officer (b. 1720)",
    "August 2 – Sarah Osborn, American writer (b. 1714)",
    "August 10 – Ignaz Anton von Indermauer, Austrian nobleman from Tyrol, Landvögte and Kreishauptmann of Vorarlberg (b. 1759)",
    "August 12 – Mary Ann Wrighten, English singer, actress (b. 1751)",
    "August 25 – Isaac Parsons, American planter (b. 1752)",
    "August 31 – John McKinly, American physician, politician from Wilmington (b. 1721)",
    "September 1 – David Murray, 2nd Earl of Mansfield (b. 1727)",
    "September 7 – Henri François Lambert, brigadier general of the French revolutionary army (b. 1760)",
    "September 11 – Anna Barbara Gignoux, German industrialist (b. 1725)",
    "September 20\nJuan José Elhuyar, Spanish chemist, mineralogist (b. 1754)\nChristian Febiger, American Revolutionary War commander (b. 1749)",
    "Juan José Elhuyar, Spanish chemist, mineralogist (b. 1754)",
    "Christian Febiger, American Revolutionary War commander (b. 1749)",
    "September 21 – François Séverin Marceau-Desgraviers, French revolutionary general (killed in battle) (b. 1769)",
    "September 27 – Jonathan Sewall, last British attorney general of Massachusetts (b. 1729)",
    "September 29 – Henry Hamilton, Anglo-Irish soldier, government official of the British Empire (b. c. 1734)",
    "October 7 – Thomas Reid, religiously trained Scottish philosopher (b. 1710)",
    "October 10 – Juliana Maria of Brunswick-Wolfenbüttel (b. 1729)",
    "October 16\nAntoine-Joseph Pernety, French writer (b. 1716)\nVictor Amadeus III of Sardinia (b. 1726)",
    "Antoine-Joseph Pernety, French writer (b. 1716)",
    "Victor Amadeus III of Sardinia (b. 1726)",
    "October 30 – Archibald Montgomerie, 11th Earl of Eglinton, Scottish general (b. 1726)",
    "November 8 – King Ang Eng of Cambodia (b. 1773)",
    "November 17 – Empress Catherine II of Russia (b. 1729)[13]",
    "November 19 – Thomas Thynne, 1st Marquess of Bath (b. 1734)",
    "December 2 – Jean Charles Abbatucci, French general during the War of the First Coalition (b. 1771)",
    "December 5 – George Mason V, American planter, businessman (b. 1753)",
    "December 10 – Israel Jacobs, colonial Pennsylvania Legislator and United States Representative from Pennsylvania (b. 1726)",
    "December 12 – William Buller, English clergyman (b. 1735)",
    "December 15 – Anthony Wayne, United States Army officer, statesman, and member of the United States House of Representatives (b. 1745)",
    "December 16 – Johann Daniel Titius, German astronomer, professor at Wittenberg (b. 1729)",
    "December 18 – Lord John Cavendish, British nobleman, statesman (b. 1732)",
    "December 19 – Pyotr Rumyantsev, Russian general (b. 1725)",
    "December 25\nBengt Anders Euphrasén, Swedish botanist (b. 1756)\nVelu Nachiyar, Indian queen of Sivaganga estate (1760–1790) (b. 1730)",
    "Bengt Anders Euphrasén, Swedish botanist (b. 1756)",
    "Velu Nachiyar, Indian queen of Sivaganga estate (1760–1790) (b. 1730)",
    "December 28 – Prince Louis Charles of Prussia, son of Frederick William II of Prussia and Frederika Louisa of Hesse-Darmstadt (b. 1773)"
  ]
}