{
  "events": [
    "December 25 1815–January 6 – Tsar Alexander I of Russia signs an order, expelling the Jesuits from St. Petersburg and Moscow.[2]",
    "January 9 – Sir Humphry Davy's Davy lamp is first tested underground as a coal mining safety lamp, at Hebburn Colliery in northeast England.[3]",
    "January 17 – Fire nearly destroys the city of St. John's, Newfoundland.",
    "February 10 – Friedrich Karl Ludwig, Duke of Schleswig-Holstein-Sonderburg-Beck, dies and is succeeded by Friedrich Wilhelm, his son and founder of the House of Glücksburg.",
    "February 20 – Gioachino Rossini's opera buffa The Barber of Seville premières at the Teatro Argentina in Rome.",
    "March 1 – The Gorkha War between the United Kingdom and Nepal is ended after more than a year by the ratification of the Treaty of Sugauli, with Nepal ceding about one-third of its territory to British Indian control.[4]",
    "March 16 – U.S. Secretary of State James Monroe is nominated by a caucus of Democratic-Republican Party members of Congress, to be its party's representative in the U.S. presidential election; Monroe receives 65 votes, and Secretary of War William H. Crawford receives 54 votes.[5]",
    "March 21 – The Institut de France is reorganized by King Louis XVIII of France into four academies: a revived Académie française; the Royal Academy of Inscriptions and Belles Lettres; the Royal Academy of Sciences; and the Royal Academy of Beaux Arts.[6]",
    "March 22 – The United States signs a treaty with the Cherokee Nation, acknowledging that it will return land in Alabama and Georgia that had been illegally ceded to the U.S. in 1814 by the Creek Nation; General Andrew Jackson refuses to honor the treaty, and uses the controversy as a justification for removing Indians from the southeastern United States.[7]",
    "March 29–April 10 – The Second Bank of the United States obtains its charter.",
    "March 30–April 11 – In Philadelphia, the African Methodist Episcopal Church is established by Richard Allen and other African-American Methodists, the first such denomination in the U.S. completely independent of White churches.",
    "April 28 – The French Caisse des dépôts et consignations, a public investment body, is created by Louis XVIII.[8]",
    "May 2 – Leopold of Saxe-Coburg (later King of the Belgians) marries Charlotte Augusta, but she dies the next year.",
    "May 8 – Divorce is abolished in France by the Chambre introuvable, after having been permitted following the French Revolution.[9]",
    "June 4 (N.S.) (May 23 O.S.) – The Governorate of Estonia of the Russian Empire emancipates its peasants from serfdom.",
    "June 16 – The Society for the Promotion of Permanent and Universal Peace is founded in London.[10]",
    "June 19 – Battle of Seven Oaks: The Hudson's Bay Company is defeated by the North West Company, near Winnipeg, Canada.",
    "July – Lord Byron, Mary Wollstonecraft Godwin, Percy Bysshe Shelley and John Polidori, gathered at the Villa Diodati by Lake Geneva in a rainy Switzerland, tell each other tales. This gives rise to two classic Gothic narratives: Mary Shelley's Frankenstein, and Polidori's The Vampyre.",
    "July 2 – The French passenger ship Medusa runs aground off the coast of Senegal, with 140 lives lost in the botched rescue that takes weeks, leading to a scandal in the French government.",
    "July 9 – The United Provinces of South America (today Argentina, Uruguay, Bolivia and southern Brazil) declares independence from Spain.",
    "August 14 – The United Kingdom formally annexes the Tristan da Cunha archipelago in the southern Atlantic Ocean, ruling it from the Cape Colony.",
    "August 12–24 – The Treaty of St. Louis, between the United States and the Council of Three Fires tribes, is signed in St. Louis.",
    "August 27 – Bombardment of Algiers: Various European allied ships force Omar Agha, Dey of Algiers to free Christian slaves.",
    "September 3 – Pope Pius VII sends a directive to Stanisław Bohusz Siestrzeńcewicz, the Roman Catholic Archbishop of Mohilev, advising Siestrzeńcewicz not to continue the Russian Bible Society's plans to circulate the Scriptures written in the Russian language, commenting that \"if the Sacred Scriptures were allowed in the vulgar tongue, more detriment than benefit would arise.\"[11]",
    "September 6 – King Louis XVIII dissolves the Chambre introuvable, the legislature that had been elected, after the Second Bourbon Restoration re-established the old monarchy.[12]",
    "October 21 – Penang Free School is founded by Rev. Sparke Hutchings, on the island of Penang (in modern-day Malaysia).",
    "October 25–November 6 – 1816 United States presidential election: James Monroe defeats Rufus King.",
    "November 10 – The British troop transport Harpooner, returning from Quebec to Britain, is wrecked at Cape Pine on Newfoundland (island) with the loss of 208 of the 385 people on board.[13]",
    "November 19 – The University of Warsaw is established.",
    "November 30–December 11 – Indiana is admitted as the 19th U.S. state.",
    "December 12 – The thrones of Sicily and Naples are merged into the Kingdom of the Two Sicilies, under King Ferdinand I.",
    "December 9–21 – The American Colonization Society is established, to support the emigration of free African Americans to Africa.",
    "Shaka starts to rule the Zulu Kingdom at about this date.",
    "Banjul, capital of the Gambia, is founded as a trading post named Bathurst.",
    "René Laennec invents the stethoscope.",
    "E. Remington and Sons (the famous firearm and later typewriter manufacturing company) is founded in the United States.",
    "Robert Stirling patents his Stirling engine, at this time known as Stirling's air engine.",
    "A rail capable of supporting a heavy locomotive is developed."
  ],
  "births": [
    "January 3 – Samuel C. Pomeroy, American politician, railroad executive (d. 1891)",
    "January 30 – Nathaniel P. Banks, American politician, general (d. 1894)",
    "March 14 – William Marsh Rice, American university founder (d. 1900)",
    "March 21 – Most Rev. Pelagio Antonio de Labastida y Dávalos, Roman Catholic archbishop and Mexican politician who served as regent during the Second Mexican Empire, 1863-1864 (d. 1891)[14]",
    "March 29 – Tsultrim Gyatso, 10th Dalai Lama of Tibet (d. 1837)",
    "April 5 – Samuel Freeman Miller, Associate Justice of the Supreme Court of the United States (d. 1890)",
    "April 21 – Charlotte Brontë, English novelist, poet (d. 1855)[15]",
    "April 22 – Charles-Denis Bourbaki, French general (d. 1897)",
    "April 25 – Eliza Daniel Stewart, American temperance movement leader (d. 1908)",
    "May 15 – Jean-Joseph Farre, French general and statesman (d. 1887)",
    "May 24 – Emanuel Leutze, German-American painter (d. 1868)",
    "May 31 – Dimitrie Ghica, 10th Prime Minister of Romania (d. 1897)",
    "June 14 – Priscilla Cooper Tyler, de facto First Lady of the United States (d. 1889)",
    "June 19 – William Henry Webb, American industrialist, philanthropist (d. 1899)",
    "June 30 – Richard Lindon, English inventor of the rugby ball (d. 1887)",
    "July 14 – Arthur de Gobineau, French diplomat, author (d. 1882)",
    "July 21 – Paul Reuter, German entrepreneur (d. 1899)",
    "July 23 – Charlotte Cushman, American actress (d. 1876)",
    "July 31 – George Henry Thomas, American general (d. 1870)",
    "August 4 – William Julian Albert, U.S. Congressman from Maryland (d. 1879)",
    "August 12 – Ion Ghica, 3-time Prime Minister of Romania (d. 1897)",
    "August 14 – Félix Douay, French general (d. 1879)",
    "August 16 – Charles John Vaughan, English scholar (d. 1897)",
    "August 21 – Jeanette Berglind, Swedish sign language pedagogue (d. 1903)",
    "September 6 – Henri Jules Bataille, French general (d. 1882)",
    "September 11 – Carl Zeiss, German maker of optical instruments (d. 1888)",
    "October 11 – William B. Renshaw, United States Navy officer (d. 1863)",
    "October 22 – Prince Yamashina Akira of Japan (d. 1891)",
    "November 3 – Jubal Early, American Confederate general (d. 1894)",
    "November 4 – Stephen Johnson Field, Associate Justice of the Supreme Court of the United States (d. 1899)",
    "November 17 – August Wilhelm Ambros, Austrian composer (d. 1876)",
    "November 29 – Morrison Waite, American politician and Chief Justice of the United States (d. 1888)",
    "December 10 – August Karl von Goeben, Prussian general (d. 1880)",
    "December 13 – Werner von Siemens, German inventor, industrialist (d. 1892)",
    "December 14 – Abraham Hochmuth,  Hungarian rabbi (d. 1889)",
    "December 29 – Carl Ludwig, German physician, physiologist (d. 1895)",
    "Wazir Akbar Khan, Afghan prince, general (d. 1845)"
  ],
  "deaths": [
    "January 2 – Louis-Bernard Guyton de Morveau, French chemist, politician (b. 1737)",
    "January 5 – George Prévost, British general, colonial administrator (b. 1767)",
    "January 27 – Samuel Hood, 1st Viscount Hood, British admiral (b. 1724)",
    "February 6 – Maria Ludwika Rzewuska, Polish szlachcianka (b. 1744)",
    "February 22 – Adam Ferguson, Scottish philosopher, historian (b. 1723)",
    "March 3 – Johann August von Starck, German pastor (b. 1741)",
    "March 19 – Philip Mazzei, Italian physician, friend of Thomas Jefferson (b. 1730)",
    "March 20 – Queen Maria I of Portugal (b. 1734)",
    "March 31 – Francis Asbury, American Methodist bishop (b. 1745)",
    "May 4 – Samuel Dexter, American lawyer, politician, 4th United States Secretary of War, 3rd United States Secretary of the Treasury (b. 1761)",
    "June 5 – Giovanni Paisiello, Italian composer (b. 1751)",
    "June 12 – Pierre Augereau, Marshal of France, duc de Castiglione (b. 1757)",
    "July 5 – Dorothea Jordan, Irish-born actress, mistress of King William IV of the United Kingdom (b. 1761)",
    "July 7 – Richard Brinsley Sheridan, Irish-born playwright, politician (b. 1751)",
    "July 14 – Francisco de Miranda, Venezuelan revolutionary (b. 1750)",
    "July 27 – Olof Tempelman, Swedish architect (b. 1745)",
    "August 9 – Johann August Apel, German writer, jurist (b. 1771)",
    "August 12 – John Smith, American politician (b. 1752)",
    "August 29 – Johann Hieronymus Schröter, German astronomer (b. 1745)",
    "September 20 – Harry Innes, United States federal judge (b. 1752)",
    "September 22 – Sir Robert Gunning, 1st Baronet, British diplomat (b. 1731)",
    "September 27 – Edward Charles Howard, English chemist, chemical engineer (b. 1774)",
    "November 6 – Charles II, Grand Duke of Mecklenburg-Strelitz (b. 1741)",
    "November 8 – Gouverneur Morris, American statesman (b. 1752)",
    "November 14 – Angélique Victoire, Comtesse de Chastellux, French comtesse (b. 1752)",
    "November 16 – Pierre-Louis Ginguené, French author (b. 1748)",
    "December 15 – Charles Stanhope, 3rd Earl Stanhope, English statesman, scientist (b. 1753)",
    "December 30 – Louis Henri Loison, French general (b. 1771)",
    "Bénédict Chastanier, French surgeon (b. 1739)",
    "Nafisa al-Bayda, Egyptian investor and diplomat"
  ]
}