{
  "events": [
    "January 21 – Peter I Island in the Antarctic is first sighted, by Fabian Gottlieb von Bellingshausen.",
    "January 28 – Alexander Island, the largest in Antarctica, is first discovered by Fabian Gottlieb von Bellingshausen.",
    "February 9 – Columbian College in the District of Columbia is chartered by President James Monroe (it becomes George Washington University).",
    "March 4 – James Monroe begins his second term, as President of the United States",
    "March 5 – President James Monroe is sworn in, for his second term.",
    "March 25 (O.S.)/April 6 (N.S.) – Metropolitan bishop Germanos of Patras raises the revolutionary flag of Greece at the Monastery of Agia Lavra (according to oral tradition, not historical record), symbolically marking the beginning of the Greek War of Independence against the Ottoman Empire; later celebrated as Greece's traditional Independence Day.",
    "April 10 (O.S.)/April 22 (N.S.) – Ecumenical Patriarch Gregory V of Constantinople is blamed by the Ottoman government for being unable to suppress Greek independence, and is hanged outside the main gate of the Patriarchal Cathedral immediately after the celebration of Pascha.",
    "May 5\nEmperor Napoleon dies in exile on Saint Helena of stomach cancer.\nThe first edition of the Manchester Guardian newspaper (from 1959 simply The Guardian) is published in England.[1]",
    "Emperor Napoleon dies in exile on Saint Helena of stomach cancer.",
    "The first edition of the Manchester Guardian newspaper (from 1959 simply The Guardian) is published in England.[1]",
    "May 8 – Greek War of Independence: At the Battle of Gravia Inn, a 120-man Greek force led by Odysseas Androutsos repulses an Ottoman army of 8,000.",
    "May 26 (O.S.)/June 7 (N.S.) – The Peloponnesian Senate is established by the Greek rebels.",
    "June 14 – Egyptian conquest of Sudan (1820–1824): King Badi VII of Sennar surrenders his throne and realm without a fight to Ismail Pasha, general of the Ottoman Empire, ending the existence of the Funj Sultanate in Sudan.",
    "June 7 (O.S.)/June 19 (N.S.) – Battle of Drăgășani, Wallachia: The Filiki Eteria are decisively defeated by the Ottomans.",
    "June 24 – Battle of Carabobo: Simón Bolívar wins Venezuela's independence from Spain.",
    " Return of John VI from Brazil who approves on that day the Bases da Constituição",
    " The United States takes possession of its newly bought territory of Florida from Spain.",
    " George IV is crowned king of the United Kingdom of Great Britain and Ireland.",
    " Argentine general José de San Martín declares the independence of Peru from the Spanish Empire.",
    " The Saturday Evening Post is published for the first time, as a weekly newspaper in the United States.",
    " Missouri is admitted as the 24th U.S. state (see History of Missouri).",
    " Navarino massacre: Greek rebels massacre 3,000 inhabitants of the city of Navarino.",
    " Jarvis Island is discovered in the Pacific by the crew of the Eliza Frances.",
    " The Treaty of Córdoba is signed in Córdoba, Veracruz, Mexico, ratifying the Plan of Iguala of February 24 for Mexico's independence from Spain and, although not recognised by the latter, effectively concludes the Mexican War of Independence.",
    " Chilean general José Miguel Carrera is executed by an Argentinian military tribunal, in the city of Mendoza.",
    " The Republic of Gran Colombia (a federation covering much of present-day Venezuela, Colombia, Panama, and Ecuador) is established, with Simón Bolívar as the founding President, and Francisco de Paula Santander as vice president.",
    " Guatemala, El Salvador, Honduras, Nicaragua and Costa Rica gain independence from Spain by the Act of Independence of Central America. On October 29, the newly independent First Mexican Empire proposes that Guatemala should merge with it.",
    " Ukase of 1821: Russia proclaims territorial sovereignty over Northwestern North America, modern-day Alaska.",
    " Amherst College is founded in Massachusetts.",
    " The Army of the Three Guarantees enters Mexico City, and the following day the Declaration of Independence of the Mexican Empire from Spain is proclaimed, following the Mexican War of Independence.",
    "September 23 (O.S.)/October 5 (N.S.) – The Siege of Tripolitsa ends when Greek rebels capture the city of Tripoli, Greece; the massacre of 8,000 civilians follows. (Greek forces under the command of General Theodoros Kolokotronis have besieged the city for several months during the Greek War of Independence from Turkey and the Ottoman Empire.)[2][3]",
    "October 8 (O.S.)/October 20 (N.S.) – Tsar Alexander I of Russia issues an imperial ukase guaranteeing freedom of commerce in Russia by merchants from Persia.[4]",
    "November 16 – American Old West: The Santa Fe Trail is first used by William Becknell.",
    "November 28 – Panama declares independence from Spain, joining Gran Colombia.",
    "December 1 – History of the Dominican Republic: On the Caribbean island of Hispaniola, General José Núñez de Cáceres ends the España Boba era of Spanish rule in the Captaincy General of Santo Domingo by establishing the Republic of Spanish Haiti. It will last for three months before being invaded by Haiti.",
    "December 6 – The South Orkney Islands are discovered by seal hunters George Powell and Nathaniel Palmer.[5][6]",
    "December 15 – The world's first geographical society, the Société de géographie, is established in Paris.",
    "December 19 – The Eyjafjallajökull volcano in Iceland begins to erupt.",
    "The town of Al-Ubayyid, Sudan is established.",
    "High-quality cotton is introduced in Egypt.",
    "Widener University is founded in Wilmington, Delaware."
  ],
  "births": [
    "January 2 – Catherine Huggins, British actor, singer, director and manager (d. 1887)",
    "January 8\nJames Longstreet, American Confederate general (d. 1904)\nW. H. L. Wallace, American Civil War general (d. 1862)",
    "James Longstreet, American Confederate general (d. 1904)",
    "W. H. L. Wallace, American Civil War general (d. 1862)",
    "January 16 – John C. Breckinridge, the 14th Vice President of the United States (1857-1861) and Confederate Secretary of State in 1865 (d. 1875)",
    "February 3 – Elizabeth Blackwell, first American female physician (d. 1910)",
    "February 11 – Auguste Edouard Mariette, French Egyptologist (d. 1881)",
    "February 17 – Lola Montez, Irish-Spanish dancer, royal mistress (d. 1861)",
    "February 19\nFrancis Preston Blair Jr., American politician, American Civil War officer (d. 1875)\nAugust Schleicher, German linguist (d. 1868)",
    "Francis Preston Blair Jr., American politician, American Civil War officer (d. 1875)",
    "August Schleicher, German linguist (d. 1868)",
    "February 22 – Athalia Schwartz, Danish writer, journalist and educator (d. 1871)",
    "March 1 – Joseph Hubert Reinkens, German Old Catholic bishop (d. 1896)",
    "March 9 – John Watts de Peyster, American author, philanthropist, and soldier (d. 1907)",
    "March 12 – Sir John Abbott, 3rd Prime Minister of Canada (d. 1893)",
    "March 15 – William Milligan, Scottish theologian (d. 1893)",
    "March 20 – Ned Buntline (Edward Zane Carroll Judson Sr.), American publisher, dime novelist and publicist (d. 1886)",
    "March 29 – Melvin Amos Halsted, American settlement founder (d. 1915)",
    "March 31 – Henry Dunning Macleod, Scottish economist (d. 1902)",
    "April 1 – Princess Anka Obrenović, Serbian princess (d. 1868)",
    "April 3 – Fr. Thomas Pelham Dale, English mystic (d. 1892)",
    "April 9 – Charles Baudelaire, French poet, writer (d. 1867)",
    "April 12 – Beauchamp Seymour, British admiral (d. 1895)",
    "May 6\nEdmund Colhoun, American admiral (d. 1897)\nEmilie Hammarskjöld, Swedish-American musician (d. 1854)",
    "Edmund Colhoun, American admiral (d. 1897)",
    "Emilie Hammarskjöld, Swedish-American musician (d. 1854)",
    "May 8 – William Henry Vanderbilt, American entrepreneur (d. 1885)",
    "May 16 – Pafnuty Chebyshev, Russian mathematician (d. 1894)",
    "May 17 – Sebastian Kneipp, German naturopath (d. 1897)",
    "May 18 – Eduard von Pestel, Prussian military officer and German general (d. 1908)",
    "May 24 – Juan Bautista Topete, Spanish admiral and politician (d. 1885)",
    "June 2 – Ion C. Brătianu, 2-Time Prime Minister of Romania (d. 1891)",
    "June 16 – Old Tom Morris, Scottish golfer (d. 1908)",
    "June 26 – Bartolomé Mitre, Argentine statesman, military figure, and author, 6th President of Argentina (d. 1906)",
    "July 1 – Anatole Jean-Baptiste Antoine de Barthélemy, French archaeologist (d. 1904)",
    "July 2 – Sir Charles Tupper, 6th Prime Minister of Canada (d. 1915)",
    "July 6 – Edmund Pettus, American politician (d. 1907)",
    "July 9\nGeorge Cavendish-Bentinck, British Conservative politician (d. 1891)\nAdolphus Frederick Alexander Woodford, British parson (d. 1887)",
    "George Cavendish-Bentinck, British Conservative politician (d. 1891)",
    "Adolphus Frederick Alexander Woodford, British parson (d. 1887)",
    "July 13 – Nathan Bedford Forrest, American Confederate Civil War General, first Grand Wizard of the Ku Klux Klan (d. 1877)",
    "July 16 – Mary Baker Eddy, American founder of Christian Science (d. 1910)",
    "July 17 – Friedrich Engelhorn, German industrialist and founder of BASF (d. 1902)",
    "July 18 – Lucy Smith Millikin, early Latter Day Saint and sister of Joseph Smith (d. 1882)",
    "July 18 – Pauline Viardot, French mezzo-soprano, composer (d. 1910)",
    "July 24 – William Poole, infamous member of New York City's Bowery Boys gang (d. 1855)",
    "July 27 – George H. Cooper, United States Navy admiral (d. 1891)",
    "August 10 – Jay Cooke, American financier (d. 1905)",
    "August 16 – Arthur Cayley, English mathematician (d. 1895)",
    "August 21 – Louis Vuitton, French fashion designer (d. 1892)",
    "August 31 – Hermann von Helmholtz, German physician and physicist  (d. 1894)",
    "September 21 – Andrei Alexandrovich Popov, Russian admiral (d. 1898)",
    "September 28 – Jonathan Clarkson Gibbs, African-American minister, politician (d. 1874)",
    "October 13 – Rudolf Virchow, German physician, pathologist, biologist, and politician (d. 1902)",
    "November 7 – Andrea Debono, Maltese trader and explorer (d. 1871)[7]",
    "November 11 – Fyodor Dostoyevsky, Russian writer (d. 1881)",
    "November 30 –  Frederick Temple, Archbishop of Canterbury (d. 1902)",
    "December 1 – John M. B. Clitz, American admiral (d. 1897)",
    "December 12 – Gustave Flaubert, French writer (d. 1880)",
    "December 22 – Junius Brutus Booth, Jr., American actor, theatre manager (d. 1883)",
    "December 24 – Gabriel García Moreno, former President of Ecuador (d. 1875)",
    "December 25 – Clara Barton, first president of American Red Cross (d. 1912)",
    "Giuseppe Bonavia, Maltese architect (d. 1885)",
    "Mazhar Nanautawi, Indian freedom struggle activist (d. 1885)"
  ],
  "deaths": [
    "January 4 – Elizabeth Ann Seton, American saint (b. 1774)",
    "January 5 – Carlo Porta, Milanese poet (b. 1775)",
    "January 19 – Alexandru Suţu, prince of Moldavia (b. 1758)",
    "February 23 – John Keats, British poet (b. 1795)[8]",
    "February 26 – Joseph de Maistre, French-Savoyard philosopher (b. 1753)",
    "March 4 – Princess Elizabeth of Clarence, daughter of William, Duke of Clarence (later King William IV) (b. 1820)",
    "March 13 – John Hunter, second Governor of New South Wales (b. 1737)",
    "April 10 – Patriarch Gregory V of Constantinople (b. 1746)",
    "April 14 – Susan Carnegie, writer and founder of the first public asylum in Scotland (b. 1743)",
    "April 20 – Franz Karl Achard, German chemist, physicist and biologist (b. 1753)",
    "April 23 – Pierre de Ruel, marquis de Beurnonville, French general (b. 1752)",
    "May 2 – Hester Thrale, Welsh diarist (b. 1741)",
    "May 5 – Napoleon Bonaparte, French Emperor and general (b. 1769)[9]",
    "May 19 –  Camille Jordan, French politician (b. 1771)",
    "June 7 – Tudor Vladimirescu, Wallachian rebel leader (b. c. 1780)",
    "June 17 – Martín Miguel de Güemes, Argentine military leader (b. 1785)",
    "June 19 – Peter Ochs, Swiss politician (b. 1752)",
    "June 23 – Louise Marie Adélaïde de Bourbon-Penthièvre, Duchess of Orléans, heiress, wife of Philippe Égalité (b. 1753)",
    "June 30 – José Fernando de Abascal y Sousa, viceroy of Peru (b. 1743)",
    "July 4 – Richard Cosway, English artist (b. 1742)",
    "July 14 - Pedro Juan Caballero, Paraguayan captain (b. 1786) (suicide)",
    "July 17 - Fulgencio Yegros, Paraguayan general and politician (b. 1780)",
    "August – Dorothea von Medem, Latvian diploma, duchess of Courland (b. 1761)",
    "August 24 – John William Polidori, English physician, writer (b. 1795) (suicide)",
    "September 4 – José Miguel Carrera, Chilean general, founding father (b. 1785)",
    "September 10 – Johann Dominicus Fiorillo, German painter, art historian (b. 1748)",
    "September 14 – Heinrich Kuhl, German naturalist, zoologist (b. 1797)",
    "October 4 – Marie-Louise Lachapelle, French obstetrician (b. 1769)",
    "October 6 – Anders Jahan Retzius, Swedish chemist, botanist (b. 1742)",
    "October 8 – Juan O'Donojú, viceroy of New Spain (b. 1762)",
    "October 11 – John Ross Key, American judge, lawyer, father of songwriter Francis Scott Key (b. 1754)",
    "October 21 – Dorothea Ackermann, German actress (b. 1752)",
    "November 8 – Jean Rapp, French general (b. 1771)",
    "December 4 – John Henniker-Major, 2nd Baron Henniker, British politician (b. 1752)",
    "December 7 – King Pōmare II of Tahiti (b. 1782)",
    "December 12 – Phoebe Hessel, British female soldier (b. 1713)",
    "1821 in Popular Culture[edit]",
    "January 3, 1821 is the end date for grand strategy video game Europa Universalis IV by Paradox Development Studio.",
    "In episode 13 of season 2 of NCIS: New Orleans, the name of a gang is 1821, which is stated to be the year of the Honduran revolution."
  ]
}