{
  "events": [
    "January\nMichael Alexander takes office, as the first appointee to the Anglican-German Bishopric in Jerusalem.\nAmerican medical student William E. Clarke of Berkshire Medical College becomes the first person to administer an inhaled anesthetic, to facilitate a surgical procedure (dental extraction).[1]",
    "Michael Alexander takes office, as the first appointee to the Anglican-German Bishopric in Jerusalem.",
    "American medical student William E. Clarke of Berkshire Medical College becomes the first person to administer an inhaled anesthetic, to facilitate a surgical procedure (dental extraction).[1]",
    "January 6–13 – First Anglo-Afghan War – Massacre of Elphinstone's army (Battle of Gandamak): British East India Company troops are destroyed by Afghan forces on the road from Kabul to Jalalabad, Afghanistan, by Akbar Khan, son of Dost Mohammad Khan.",
    "January 8 – Delft University of Technology is established by William II of the Netherlands, as a 'Royal Academy for the education of civilian engineers'.[2]",
    "January 23 – Antarctic explorer James Clark Ross, charting the eastern side of James Ross Island, reaches a Farthest South of 78°09'30\"S.[3]",
    "February 1 – Willamette University is established in Salem, Oregon.",
    "February 7 – Battle of Debre Tabor: Ras Ali Alula, Regent of the Emperor of Ethiopia, defeats warlord Wube Haile Maryam of Semien.",
    "March – Commonwealth v. Hunt: The Massachusetts Supreme Court makes strikes and unions legal in the United States.",
    "March 2 – Gaylad, ridden by Tom Olliver, wins the Grand National at Aintree Racecourse in England.",
    "March 5 – Mexican troops led by Ráfael Vásquez invade Texas, briefly occupy San Antonio, and then head back to the Rio Grande. This is the first such invasion since the Texas Revolution.",
    "March 9 – Giuseppe Verdi's third opera Nabucco premieres at La Scala in Milan; its success establishes Verdi as one of Italy's foremost operatic composers.",
    "March 17 – The Relief Society, a philanthropic and educational women's organization of The Church of Jesus Christ of Latter-day Saints (LDS Church) is founded.",
    "March 28 – The Vienna Philharmonic Orchestra, founded by Otto Nicolai, performs its first concert.[4]",
    "March 30 – American physician and pharmacist Crawford Long administers an inhaled anesthetic (diethyl ether) to facilitate a surgical procedure (removal of a neck tumor).[5][6]",
    "March 31 – The Middleton Junction and Oldham Branch Railway line is opened up to Werneth in North West England.",
    "April 13 – First Anglo-Afghan War – Battle of Jellalabad: British troops are victorious.",
    "May 8 – Versailles rail accident: A train traveling between Versailles and Paris, France derails, due to a broken locomotive axle, and catches fire, killing at least 55 passengers in the locked carriages.",
    "May 11 – The Income Tax Act establishes the first peacetime income tax in the United Kingdom; 7 pence in the pound, for incomes over 150 pounds.[7]",
    "May 19 – Dorr Rebellion: Militiamen supporting Thomas Wilson Dorr attack the arsenal in Providence, Rhode Island, but are repulsed.",
    "June 4 – In South Africa, hunter Dick King rides into a British military base in Grahamstown, to warn that the Boers have besieged Durban (he had left 11 days earlier). The British army dispatches a relief force.",
    "June 13 – Queen Victoria becomes the first reigning British monarch to travel by train, on the Great Western Railway between Slough and London Paddington station.[8]",
    "June 18 – A primary school system is established in Sweden.[9]",
    "June – James Nasmyth patents the steam hammer in the United Kingdom.[10]",
    "July 8 – A total solar eclipse occurs in Asia.",
    "July 13 – The Tri-Kap fraternity is founded at Dartmouth College (the oldest local fraternity in the United States).",
    "August 4 – The Armed Occupation Act is signed, providing for the armed occupation and settlement of the unsettled part, of the Peninsula of East Florida.",
    "August 9 – The Webster–Ashburton Treaty is signed, establishing the United States–Canada border east of the Rocky Mountains.",
    "August 10 – The Mines Act 1842 becomes law, prohibiting underground work for all women and boys under 10 years old in the United Kingdom.",
    "August 14 – American Indian Wars: United States general William J. Worth declares the Second Seminole War to be over.",
    "August 29 – The Treaty of Nanking, an unequal treaty between Britain and Qing dynasty China, ends the First Opium War, and establishes Hong Kong as a British colony until 1997.",
    "September – Wesleyan University is established in Ohio.",
    "September 16–17 – The Treaty of Chushul ends the Sino-Sikh War.",
    "October 5 – Josef Groll brews the first pilsner beer in the city of Pilsen, Bohemia (now the Czech Republic).",
    "October 29 – The Iberian Peninsula is struck by a category 2 hurricane.",
    "November 26 – The University of Notre Dame in South Bend, Indiana (United States) is established by Father Edward Sorin, of the Roman Catholic Congregation of Holy Cross.",
    "December 7 – The New York Philharmonic, founded by Ureli Corelli Hill, performs its first concert.[11]",
    "December 20 – The Citadel, The Military College of South Carolina, is established.",
    "The Polynesian islands of Tahiti and Tahuata are declared a protectorate of France.",
    "The New Zealand seat of government moves from Russell to Auckland.",
    "Dzogchen Monastery, in Sichuan, China, is almost completely destroyed by an earthquake.",
    "English palaeontologist Richard Owen coins the name Dinosauria, hence the Anglicized dinosaur.[12]",
    "Julius von Mayer proposes that work and heat are equivalent.[13]",
    "Pentonville Prison in London begins to function.",
    "Pickelhaube helmet introduced in the Prussian Army.[14]",
    "The Sons of Temperance is founded in New York City.",
    "Beecham's Pills, as predecessor of Glaxo Smith Kline (GSK) founded in Lancashire, England.[page needed]",
    "Founding of:\nCumberland University (in Lebanon, Tennessee).\nHollins University (in Roanoke, Virginia by Charles Cocke).\nVillanova University (in Villanova, Pennsylvania by the Augustinian order).\nIndiana University Maurer School of Law at Indiana University Bloomington.\nDelft University of Technology (in Delft, Netherlands).",
    "Cumberland University (in Lebanon, Tennessee).",
    "Hollins University (in Roanoke, Virginia by Charles Cocke).",
    "Villanova University (in Villanova, Pennsylvania by the Augustinian order).",
    "Indiana University Maurer School of Law at Indiana University Bloomington.",
    "Delft University of Technology (in Delft, Netherlands)."
  ],
  "births": [
    "January 11 – William James, American psychologist, philosopher (d. 1910)",
    "January 15 – Mary MacKillop, first Australian saint (d. 1909)",
    "February 3 – Sidney Lanier, American writer (d. 1881)",
    "February 7 – Alexandre Ribot, 46th Prime Minister of France (d. 1923)",
    "February 11\nErik Gustaf Boström, 2-Time Prime Minister of Sweden (d. 1907)\nMaria Louise Eve, American author (d. 1900)",
    "Erik Gustaf Boström, 2-Time Prime Minister of Sweden (d. 1907)",
    "Maria Louise Eve, American author (d. 1900)",
    "February 23 – Karl Robert Eduard von Hartmann, German philosopher (d. 1906)",
    "February 24 – Arrigo Boito, Italian poet, composer (d. 1918)",
    "February 25 – Karl May, German writer (d. 1912)",
    "March 2 – Carl Jacobsen, Danish brewer, patron of the arts after whom the Carlsberg brewery was named (d. 1914)",
    "March 5 – A. Viola Neblett, American activist, suffragist, women's rights pioneer (d. 1897)",
    "March 10 – Mykola Lysenko, Ukrainian composer (d. 1912)",
    "March 18 – Stéphane Mallarmé, French poet (d. 1898)",
    "March 25 – Susan Augusta Pike Sanders, American teacher, clubwoman, author; national president of the Woman's Relief Corps (d. 1931)",
    "March 26 – Alexandre Saint-Yves d'Alveydre, French occultist (d. 1909)",
    "March 30 – John Fiske, American philosopher (d. 1901)",
    "April 2 – Dominic Savio, Italian adolescent student of John Bosco (d. 1857)",
    "April 17 – Maurice Rouvier, Prime Minister of France (d. 1911)",
    "May 4 – Marietta Bones, American suffragist, social reformer, philanthropist (d. 1901)",
    "May 7 – Isala Van Diest, Belgian physician (d. 1916)",
    "May 8 – Emil Christian Hansen, Danish fermentation physiologist (d. 1909)",
    "May 13 – Sir Arthur Sullivan, English composer (d. 1900)",
    "June 11 – Carl von Linde, German scientist, engineer (d. 1934)",
    "June 12 – Rikard Nordraak, Norwegian composer (d. 1866)",
    "June 16 – David Herold, accomplice of John Wilkes Booth (d. 1865)",
    "June 24 – Ambrose Bierce, American writer, satirist (d. ca. 1914)",
    "June 25 – Eloy Alfaro, 15th President of Ecuador (d. 1912)",
    "July 2 – Albert Ladenburg, German chemist (d. 1911)",
    "July 4 – Hermann Cohen, German-Jewish philosopher (d. 1918)",
    "July 14 – Christian Lundeberg, 10th Prime Minister of Sweden (d. 1911)",
    "July 19 – Lydia Hoyt Farmer, American author, women's rights activist (d. 1903)",
    "July 30 – Thomas J. O'Brien, American politician, diplomat (d. 1933)",
    "August 21 – Harriet Earhart Monroe, American lecturer, educator, writer, producer (d. 1927)",
    "August 23 – Osborne Reynolds, Irish engineer, physicist (d. 1912)",
    "September 3 – John Devoy, Irish rebel leader, exile (d. 1928)",
    "September 13 – John H. Bankhead, American senator (d. 1920)",
    "September 20 – Sir James Dewar, Scottish chemist, physicist (d. 1923)",
    "September 22 – Abdul Hamid II, Ottoman Sultan (d. 1918)",
    "September 29 – Sir Joseph Palmer Abbott, Australian politician and solicitor (d. 1901)",
    "October 3 – Frederick Rodgers, American admiral (d. 1917)",
    "October 14 – Joe Start, American baseball player (d. 1927)",
    "October 17 – Gustaf Retzius, Swedish physician, anatomist (d. 1919)",
    "October 27 – Giovanni Giolitti, 5-time Prime Minister of Italy (d. 1928)",
    "October 28 – Anna Elizabeth Dickinson, American orator (d. 1932), younger sister of journalist Susan E. Dickinson[15]",
    "November 12\nŌyama Iwao, Japanese field marshal, a founder of the Imperial Japanese Army (d. 1916)\nJohn Strutt, 3rd Baron Rayleigh, English physicist, Nobel Prize laureate (d. 1919)",
    "Ōyama Iwao, Japanese field marshal, a founder of the Imperial Japanese Army (d. 1916)",
    "John Strutt, 3rd Baron Rayleigh, English physicist, Nobel Prize laureate (d. 1919)",
    "November 26 – Madeleine Brès, French physician (d. 1921)",
    "December 2 – C. W. Alcock, English footballer, football official (d. 1907)",
    "December 3 – Ellen Swallow Richards, American chemist (d. 1911)",
    "December 9 – Peter Kropotkin, Russian anarchist (d. 1921)",
    "December 12 – Alfred Parland, Russian architect (d. 1919)"
  ],
  "deaths": [
    "January 12 – Johanna Stegen, German heroine (b. 1793)",
    "January 19 – Comte Siméon Joseph Jérôme, French jurist and politician (b. 1749)",
    "February 15 – Carlo Andrea Pozzo di Borgo, Corsican politician, Russian diplomat (b. 1764)",
    "March 4 – James Forten, African American abolitionist",
    "March 6 – Constanze Mozart, German-born wife of Wolfgang Amadeus Mozart (b.1762)",
    "March 13\nSamuel Eells, American founder of Alpha Delta Phi fraternity (b. 1810)\nHenry Shrapnel, English army officer, inventor (b. 1761)",
    "Samuel Eells, American founder of Alpha Delta Phi fraternity (b. 1810)",
    "Henry Shrapnel, English army officer, inventor (b. 1761)",
    "March 15 – Luigi Cherubini, Italian composer (b. 1760)",
    "March 23 – Stendhal, French novelist (b. 1783)",
    "March 30 – Louise Élisabeth Vigée Le Brun, French painter (b. 1755)",
    "May 8 – Jules Dumont d'Urville, French explorer (b. 1790)",
    "May 12 – Walenty Wańkowicz, Polish painter (b. 1799)",
    "June 9 – Maria Dalle Donne, Bolognese physician (b. 1778)",
    "June 18 – François-André Baudin, French admiral (b. 1774)",
    "July 13 – Prince Ferdinand Philippe, Duke of Orléans, French prince (b. 1810)",
    "July 21 – Laura M. Hawley Thurston, American poet and educator (b. 1812)",
    "July 25 – Dominique Jean Larrey, French surgeon (b. 1766)",
    "July 28 – Clemens Brentano, German poet (b. 1778)",
    "August 24 – Leona Vicario, leader of Mexican War of Independence and wife of Andrés Quintana Roo (b. 1789)[16]",
    "September 10\nWilliam Hobson, Irish-born officer in the British Royal Navy, first Governor-General of New Zealand and co-author of Treaty of Waitangi (b. 1792)\nLetitia Christian Tyler, First Lady of the United States 1841-1842 (b. 1790)[17]",
    "William Hobson, Irish-born officer in the British Royal Navy, first Governor-General of New Zealand and co-author of Treaty of Waitangi (b. 1792)",
    "Letitia Christian Tyler, First Lady of the United States 1841-1842 (b. 1790)[17]",
    "September 15 – Francisco Morazán, Honduran-born politician, President of Federal Republic of Central America (b. 1792)",
    "October 2 – William Ellery Channing, American Unitarian theologian, minister (b. 1780)",
    "October 20 – Grace Darling, English heroine (b. 1815)",
    "October 24 – Bernardo O'Higgins, first Chilean head of state after independence (b.1778)",
    "October 25 – Sampson Salter Blowers, American lawyer, jurist (b. 1742)",
    "December 1 – Philip Spencer, American founder of Chi Psi fraternity, midshipman aboard the USS Somers, hanged for mutiny.[18]",
    "December 12 – Robert Haldane, British theologian (b. 1764)",
    "December 24 – Adam Gillies, Lord Gillies, Scottish judge (b. 1760)",
    "Nodira, Uzbek poet, stateswoman (b. 1792)"
  ]
}