{
  "events": [
    "January 15 – The University of Notre Dame, based in the city of the same name, receives its charter from Indiana.",
    "February 27 – The Dominican Republic gains independence from Haiti.",
    "February 28 – A gun on the USS Princeton explodes while the boat is on a Potomac River cruise, killing two United States Cabinet members and several others.",
    "March 8\nKing Oscar I ascends to the throne of Sweden–Norway upon the death of his father, Charles XIV/III John.\nThe Althing, the parliament of Iceland, was reopened after 45 years of closure.[1]",
    "King Oscar I ascends to the throne of Sweden–Norway upon the death of his father, Charles XIV/III John.",
    "The Althing, the parliament of Iceland, was reopened after 45 years of closure.[1]",
    "March 12 – The Columbus and Xenia Railroad, the first railroad planned to be built in Ohio, is chartered.",
    "March 13 – The dictator Carlos Antonio López becomes first President of Paraguay.",
    "March 21 – The Baháʼí calendar begins.",
    "March 23 – The Edict of Toleration is passed in the Ottoman Empire.",
    "April 2 – The Fleet Prison for debtors in London is closed, marking a significant milestone in the country's human rights record.[2]",
    "May 1 – The Hong Kong Police Force, the world's second and Asia's first modern, police force is established.",
    "May 23 – Persian Prophet The Báb privately announces his revelation to Mullá Husayn, just after sunset, founding the Bábí faith (later evolving into the Baháʼí Faith as the Báb intended) in Shiraz, Persia (modern-day Iran). Contemporaneously, on this day in nearby Tehran, is the birth of `Abdu'l-Bahá; the eldest Son of Bahá'u'lláh, Prophet-Founder of the Baháʼí Faith, the inception of which, the Báb's proclaims His own mission is to herald.  `Abdu'l-Bahá Himself is later proclaimed by Bahá'u'lláh to be His own successor, thus being the third \"central figure\" of the Baháʼí Faith.",
    "May 24 – The first electrical telegram is sent by Samuel Morse from the U.S. Capitol in Washington, D.C. to the B&O Railroad \"outer depot\" in Baltimore, saying \"What hath God wrought\".",
    "June–July – The Great Flood of 1844 hits the Missouri River and Mississippi River.",
    "June 3 – The last definitely recorded pair of great auks are killed on the Icelandic island of Eldey.",
    "June 6 – George Williams sets up (in London) what is often cited as the first youth organisation in the world[3] – \"The Young Men's Christian Association\", commonly known as YMCA. It will grow to a worldwide organisation based in Geneva, Switzerland, with more than 57 million beneficiaries from 125 national associations. George Williams aims to put Christian principles into practice by developing a healthy \"body, mind, and spirit.\" These three angles are reflected by the different sides of the (red) triangle—part of all YMCA logos.",
    "June 15 – Charles Goodyear receives a patent for vulcanization, a process to strengthen rubber.",
    "June 22 – The Delta Kappa Epsilon fraternity is founded. ΔΚΕ will be home to many well known VIPs, such as U.S. Presidents George W. Bush, George H. W. Bush, Gerald Ford, and Theodore Roosevelt.",
    "June 27 – Joseph Smith, founder of the Latter-Day Saint movement, and his brother Hyrum, are murdered in Carthage Jail, Carthage, Illinois by an armed mob, leading to a Succession crisis. John Taylor, future president of The Church of Jesus Christ of Latter-day Saints, is severely injured but survives, while the fourth man inside the upper room, then-apostle Willard Richards, escapes with only a graze to his upper ear.[4]",
    "July 3 – The United States signs the Treaty of Wanghia with the Chinese Government, the first ever diplomatic agreement between China and the United States.",
    "August 8 – During a meeting held in Nauvoo, Illinois, the Quorum of the Twelve, headed by Brigham Young, is chosen as the leading body of The Church of Jesus Christ of Latter-day Saints.",
    "August 14 – Abdelkader El Djezairi is defeated at the Battle of Isly in Morocco; sultan Abd al-Rahman of Morocco soon repudiates his ally.",
    "August 16 – Narciso Claveria, Governor-General of the Philippines, makes a decree announcing that Monday, December 30, 1844, will be immediately followed by Wednesday, January 1, 1845. (Tuesday, December 31, 1844, is removed from the Philippine calendar because since 1521 the country has been one day behind its Asian neighbors).",
    "August 28 – Friedrich Engels and Karl Marx meet in Paris, France.",
    "September 25–27 – The first ever international cricket match is played in New York City, United States v Canadian Provinces.",
    "October 22 – This second date, predicted by the Millerites for the Second Coming of Jesus (and said to be 6,000 years from creation, relating them to the 6 days of creation, using a day-for-a-year bible principle, with which they proved that the 1,000 years of rest in heaven with God would total to 7,000 years, indicating the completion of creation in the beginning, which make 7 days, but the 7th day is for rest, same as the 7,000th year is for rest in heaven), leads to the Great Disappointment. The Seventh-day Adventist Church believes this date to be the starting point of the Investigative judgment, just prior to the Second Coming of Jesus, as declared in the 26th of 28 fundamental doctrines of Seventh-day Adventists.[5]",
    "October 23 – The Báb is publicly proclaimed to be the promised one of Islam (the Qá'im, or Mahdi). He is also considered to be simultaneously the return of Elijah, John the Baptist, and the \"Ushídar-Máh\" referred to in the Zoroastrian scriptures.[6] He announces to the world the coming of \"He whom God shall make manifest\". He is considered the forerunner of Bahá'u'lláh – the founder of the Baháʼí Faith – whose claims include being the return of Jesus.",
    "November 3 – Giuseppe Verdi's I due Foscari debuts at Teatro Argentina, Rome.",
    "November 6 – The Dominican Republic drafts its first Constitution.",
    "December 4 – U.S. presidential election, 1844: James K. Polk defeats Henry Clay.",
    "November 13 – Hungarian becomes the official language of Hungary.[7]",
    "December 21 – The Rochdale Pioneers commence business at their cooperative in Rochdale, England.",
    "Swedish chemistry professor Gustaf Erik Pasch invents a safety match.",
    "The anonymously written Vestiges of the Natural History of Creation is published, and paves the way for the acceptance of Darwin's book On the Origin of Species.",
    "The Free Church Institution is established by Reverend Alexander Duff in Calcutta, India. This is later merged with the General Assembly's Institution to form the Scottish Church College, one of the pioneering institutions that ushers in the Bengali Renaissance.",
    "In Munich the Feldherrnhalle is completed.",
    "In Tibet the Temple of Guardians burns down"
  ],
  "births": [
    "January 7 – Bernadette Soubirous, French visionary from Lourdes (d. 1879)",
    "January 9 – Julián Gayarre, Spanish opera singer (d. 1890)",
    "January 11 – Franz Schrader, French mountaineer, geographer, cartographer, and landscape painter (d. 1924)",
    "February 14 – Robert Themptander, 4th Prime Minister of Sweden (d. 1897)",
    "February 20\nJoshua Slocum, Canadian-born American seaman and adventurer (d. 1909)\nLudwig Boltzmann, Austrian physicist (d. 1906)",
    "Joshua Slocum, Canadian-born American seaman and adventurer (d. 1909)",
    "Ludwig Boltzmann, Austrian physicist (d. 1906)",
    "February 21 – Charles-Marie Widor, French organist, composer (d. 1937)",
    "February 26 – Horace Harmon Lurton, Associate Justice of the Supreme Court of the United States (d. 1914)",
    "February 28 – French Ensor Chadwick, American admiral (d. 1919)",
    "March 10 – Pablo de Sarasate, Spanish violinist (d. 1908)",
    "March 14 - King Umberto I of Italy (d. 1900)",
    "March 18 – Nikolai Rimsky-Korsakov, Russian composer (d. 1908)",
    "March 19 – Minna Canth, Finnish writer and social activist (d. 1897)[8]",
    "March 25 – Adolf Engler, German botanist (d. 1930)",
    "March 30 – Paul Verlaine, French poet (d. 1896)",
    "April 1 – Nikolai Skrydlov, Russian admiral (d. 1918)",
    "April 13 – John Surratt, suspect in the Abraham Lincoln assassination, son of Mary Surratt (d. 1916)",
    "April 16 – Anatole France, French writer, Nobel Prize laureate (d. 1924)",
    "April 22 – Lewis Powell, attempted assassin of United States Secretary of State William H. Seward, conspirator with John Wilkes Booth (d. 1865)",
    "April 26 – Lizardo García, 17th President of Ecuador (d. 1937)",
    "April 28 – Katarina Milovuk, Serbian educator, women's rights activist (d. 1909)",
    "May 3\nSarah Warren Keeler, American educator of the deaf-mute (d. 1899)\nKuroki Tamemoto, Japanese general (d. 1923)",
    "Sarah Warren Keeler, American educator of the deaf-mute (d. 1899)",
    "Kuroki Tamemoto, Japanese general (d. 1923)",
    "May 14 – Alexander Kaulbars, Russian general, explorer (d. 1925)",
    "May 19 – William M. Folger, American admiral (d. 1928)",
    "May 21 – Henri Rousseau, French artist (d. 1910)",
    "May 22 – Mary Cassatt, American painter and printmaker (d. 1926)",
    "May 23 – `Abdu'l-Bahá, Persian Baháʼí religious leader (d. 1921)",
    "June 3 – Garret Hobart, 24th Vice President of the United States (d. 1899)",
    "June 6 – Konstantin Savitsky, Russian painter (d. 1905)",
    "June 28 – John Boyle O'Reilly, Irish-born poet, journalist and fiction writer (d. 1890)",
    "June 30 – George Bengescu-Dabija, Wallachian-born Romanian poet, playwright, and general (d. 1916)",
    "July 11 – King Peter I of Serbia (d. 1921)",
    "July 22 – William Archibald Spooner, British scholar, Anglican priest (d. 1930)",
    "July 25 – Thomas Eakins, American painter, sculptor (d. 1916)",
    "July 26 – Deodato Arellano, Filipino Propagandist (d. 1899)",
    "July 28 – Gerard Manley Hopkins, English poet (d. 1889)",
    "July 30 – Robert Jones Burdette, American minister, sentimental humorist (d. 1914)",
    "August 5\nIlya Repin, Russian painter, sculptor (d. 1930)\nPhilip H. Cooper, American admiral (d. 1912)",
    "Ilya Repin, Russian painter, sculptor (d. 1930)",
    "Philip H. Cooper, American admiral (d. 1912)",
    "August 6 – Alfred, Duke of Saxe-Coburg and Gotha (d. 1900)[9]",
    "August 17 – Menelik II, Emperor of Ethiopia (d. 1913)",
    "August 20 – Mutsu Munemitsu, Japanese statesman, diplomat (d. 1897)",
    "August 22 – George W. De Long, American naval officer, explorer (d. 1881)",
    "August 23 – Hamilton Disston, American land developer (d. 1896)",
    "August 25 – Ramón Auñón y Villalón, Spanish admiral and politician (d. 1925)",
    "August 29 – Edward Carpenter, English socialist poet (d. 1929)",
    "August 30 – Emily Ruete, Princess of Zanzibar (d. 1924)",
    "September 7 – Charles Romley Alder Wright, British chemist (d. 1894)",
    "September 13 – Ludwig von Falkenhausen, German general (d. 1936)",
    "September 16 – Claude-Paul Taffanel, French flutist, composer (d. 1908)",
    "September 20 – William H. Illingworth, English photographer (d. 1893)",
    "September 24 – Max Noether, German mathematician (d. 1921)",
    "September 28 – Sir Robert Stout, 2-time Prime Minister of New Zealand (d. 1930)",
    "September 29 – Miguel Ángel Juárez Celman, 10th President of Argentina (d. 1909)",
    "October 5 – Francis William Reitz, 5th State President of the Orange Free State (d. 1934)",
    "October 11 – Henry J. Heinz, American businessman (d. 1919)",
    "October 15 – Friedrich Nietzsche, German philosopher (d. 1900)",
    "October 16 – Ismail Qemali, Albanian civil servant, politician, 1st Prime Minister of Albania (d. 1919)",
    "October 22 – Louis Riel, Canadian-American leader (d. 1885)",
    "October 23\nRobert Bridges, English poet (d. 1930)\nSarah Bernhardt,  French actress (d. 1923)",
    "Robert Bridges, English poet (d. 1930)",
    "Sarah Bernhardt,  French actress (d. 1923)",
    "October 24 – Karl Lueger, Austrian politician, Mayor of Vienna (d. 1910)",
    "October 27 – Klas Pontus Arnoldson, Swedish writer, pacifist, recipient of the Nobel Peace Prize (d. 1916)",
    "November 2 – Mehmed V, Ottoman Sultan (d. 1918)",
    "November 10 – Henry Eyster Jacobs, American Lutheran theologian (d. 1932)",
    "November 11 – Marcelino Crisologo, Filipino politician, playwright, writer and poet (d. 1927)",
    "November 13 – Andrew Harper, Scottish-Australian biblical scholar, teacher (d. 1936)",
    "November 25 – Karl Benz, German automotive pioneer (d. 1929)",
    "December 1 – Alexandra of Denmark, Queen of Edward VII of the United Kingdom (d. 1925)",
    "December 8 – Charles-Émile Reynaud, French science teacher, animation pioneer (d. 1918)",
    "December 18 – Takashima Tomonosuke, Japanese general (d. 1916)",
    "probable – Abdur Rahman Khan, Emir of Kabul, Emir of Kandahar, Emir of Afghanistan (d. 1901)"
  ],
  "deaths": [
    "January 25 – Jean-Baptiste Drouet, Comte d'Erlon, French marshal (b. 1765)",
    "January 27 – Charles Nodier, French writer (b. 1780)",
    "January 29 – Ernest I, Duke of Saxe-Coburg and Gotha (b. 1784)",
    "February 3 – Frederick Ponsonby, 3rd Earl of Bessborough (b. 1758)",
    "February 15 – Henry Addington, 1st Viscount Sidmouth, Prime Minister of the United Kingdom (b. 1757)",
    "February 27 – Nicholas Biddle, president of the Second Bank of the United States (b. 1786)",
    "March – Carlota, Cuban slave rebel leader",
    "March 6 – Gabriel Duvall, American politician and Associate Justice of the Supreme Court of the United States (b. 1752)",
    "March 8 – King Charles XIV John of Sweden, Jean-Baptiste Bernadotte, French Napoleonic general (b. 1763)",
    "March 20 – Claude Pierre Pajol, French military leader (b. 1772)",
    "April 3 – Edward Bigge, English cleric, 1st Archdeacon of Lindisfarne (b. 1807)",
    "April 13 – Mamiya Rinzō, Japanese explorer of Sakhalin (b. 1775)",
    "April 17 – James Scarlett Abinger, English judge (b. 1769)",
    "May 18 – Richard McCarty, American politician (b. 1780)",
    "June 13 – Thomas Charles Hope, Scottish chemist, discoverer of strontium (b. 1766)",
    "June 15 – Thomas Campbell, Scottish poet (b. 1777)",
    "June 27\nHyrum Smith, American Latter Day Saint leader (b. 1800)\nJoseph Smith, American founder of the Latter Day Saint movement (b. 1805)",
    "Hyrum Smith, American Latter Day Saint leader (b. 1800)",
    "Joseph Smith, American founder of the Latter Day Saint movement (b. 1805)",
    "July 11 – Yevgeny Baratynsky, Russian poet, philosopher (b. 1800)",
    "July 27 – John Dalton, English chemist, physicist (b. 1766)",
    "July 28 – Joseph Bonaparte, brother of Napoleon I, King of Naples and Spain (b. 1768)[10]",
    "July 29 – Franz Xaver Wolfgang Mozart, Austrian composer (b. 1791)",
    "November 14 – Flora Tristan, French feminist (b. 1803)",
    "November 29 – Princess Sophia of Gloucester (b. 1773)",
    "December 2 – Eustachy Erazm Sanguszko, Polish military leader (b. 1768)",
    "December 14 – Melchor Múzquiz, 5th President of Mexico (b. 1790)",
    "December 24 – Friedrich Bernhard Westphal, Danish-German painter (b. 1803)",
    "Ching Shih, Chinese pirate (b. 1775)",
    "Robert Taylor, British Radical writer, freethought advocate (b. 1784)"
  ]
}