{
  "events": [
    "January 2 – The discovery of a hypothetical planet Vulcan is announced at a meeting of the French Academy of Sciences in Paris, France.",
    "January 10 – The Pemberton Mill in Lawrence, Massachusetts collapses, killing 146 workers.",
    "January 13 – Battle of Tétouan, Morocco: Spanish troops under General Leopoldo O'Donnell, 1st Duke of Tetuan defeat the Moroccan Army.",
    "January 20 – Camillo Benso, Count of Cavour is recalled as Prime Minister of Piedmont-Sardinia.",
    "January 31 – Kukis raid the Chhagalnaiya plains in eastern Bengal, murdering and kidnapping hundreds of people, partiularly women.[1]",
    "February 20 – Canadian Royal Mail steamer SS Hungarian (1859) is wrecked on Cape Sable Island, Nova Scotia, on passage from the British Isles to the United States with all 205 onboard lost.[2]",
    "February 22 – Shoe-making workers of Lynn, Massachusetts, strike successfully for higher wages. The strike spreads throughout New England, and eventually involves 20,000 workers.",
    "February 26 – White settlers massacre a band of Wiyot Indians on Indian Island, near Eureka, California. At least 60 women, children and elders are killed. Bret Harte, newspaper reporter in Arcata, reports the news to newspapers in San Francisco.",
    "February 28 – The Artists Rifles is established, as the 38th Middlesex (Artists) Rifle Volunteer Corps, with headquarters at Burlington House in London.[3]",
    "March 6 – While campaigning for the presidency, Abraham Lincoln makes a speech defending the right to strike.",
    "March 9 – The first Japanese ambassadors to the United States arrive in San Francisco.",
    "March 17 – The First Taranaki War begins at Waitara, New Zealand, when Māori refuse to sell land to British settlers.",
    "March 22 – The Grand Duchy of Tuscany is annexed to the newly formed Kingdom of Italy.",
    "March 24 – Sakuradamon Incident: Rōnin samurai of the Mito Domain in Japan assassinate tairō (Chief Minister) Ii Naosuke outside the Sakurada Gate of Edo Castle, disaffected with his role in the opening of Japan to foreign powers.",
    "March–August – The second rout of the Jiangnan Daying destroys the Qing dynasty's army of 180,000.",
    "April 2 – The first Italian Parliament meets at Turin.",
    "April 3 – The Pony Express begins its first run from St. Joseph, Missouri to Sacramento, California, with riders carrying a small Bible.",
    "April 4 – A new uprising erupts in Palermo.",
    "April 9 – French typesetter Édouard-Léon Scott de Martinville sings the French folk song Au clair de la lune to his phonautograph, producing the world's earliest known sound recording (however, it is not rediscovered until 2008).",
    "May 1 – A Chondrite-type meteorite falls to earth in Muskingum County, Ohio, near the town of New Concord.",
    "May 6 – Expedition of the Thousand: Giuseppe Garibaldi and his troops depart from Quarto.",
    "May 8 – In New Granada (modern-day Colombia) the southern state of Cauca secedes from the central government, in protest at the suggestion of increase of presidential powers; Magdalena and Bolívar join it; civil war erupts.",
    "May 9 – The U.S. Constitutional Union Party holds its convention, and nominates John Bell for President of the United States.",
    "May 15 – Expedition of the Thousand – Battle of Calatafimi: Troops under Giuseppe Garibaldi defeat the army of Naples in Sicily.",
    "May 17 – The German association football club TSV 1860 München is founded.",
    "May 18 – Abraham Lincoln is selected as the U.S. presidential candidate for the Republican Party, in Chicago, Illinois.",
    "May 27 – Garibaldi's forces take Palermo, the capital of Sicily.",
    "May 28 – One of the worst storms ever experienced in the region hits the east coast of England, sinking more than 100 ships and killing at least 40 people.[4]",
    "12 June [O.S. 31 May] 1860 – The State Bank of the Russian Empire is established.",
    "June 30 – A historic debate about evolution is held, at the Oxford University Museum.",
    "July 2 – Vladivostok is founded in Russia.",
    "July 9 – The Nightingale Training School and Home for Nurses, the first nursing school based on the ideas of Florence Nightingale, is opened at St Thomas' Hospital in London.",
    "July 11 – Mutsuhito (the future Emperor Meiji) becomes Crown Prince of Japan.",
    "July 20 – Battle of Milazzo: The forces of Giuseppe Garibaldi defeat royal Neapolitan forces near Messina, bringing nearly all of Sicily under Garibaldi's control.  July 20: Garibaldi.",
    "August 13 – José Ignacio Pavón (1791-1866) becomes unconstitutional interim President of Mexico, replacing Miguel Miramón. Two days later Miramón becomes president again.[5]",
    "August 22 – Assisted by the British Navy, the troops of Giuseppe Garibaldi cross from Sicily to the Italian mainland.",
    "September 3–5 – The First International Chemistry Congress is held in Karlsruhe, Baden.",
    "September 7\nThe PS Lady Elgin is accidentally rammed and sunk in Lake Michigan; hundreds drown.\nGiuseppe Garibaldi's forces capture Naples.",
    "The PS Lady Elgin is accidentally rammed and sunk in Lake Michigan; hundreds drown.",
    "Giuseppe Garibaldi's forces capture Naples.",
    "September 10 – Piedmontese forces invade the Papal States, hoping to link up with Garibaldi in Naples.",
    "September 18 – Battle of Castelfidardo: The Piedmontese decisively defeat the Papal forces, allowing them to continue their march into Neapolitan territory, and effectively reducing the Papal States to the territory around Rome.",
    "September 24 – Battle of Guayaquil: Ecuadorian forces, led by Juan José Flores and Gabriel García Moreno, take the port of Guayaquil from Supreme Chief Guillermo Franco, who is backed by Peruvian forces.",
    "October – John Hanning Speke and James Augustus Grant leave Zanzibar, to search for the source of the Nile River.",
    "October 1 – Battle of Volturnus: Garibaldi defeats the last organized army of the Kingdom of the Two Sicilies.",
    "October 5 – Austria, Britain, France, Prussia and the Ottoman Empire form a commission to investigate the causes of the massacres of Maronite Christians, committed by Druzes in Lebanon earlier in the year.",
    "October 6 – Section 377 of the British Indian penal code was enacted in British India.",
    "October 17 – The Open Championship, also known as the British Open, is played for the first time at Prestwick Golf Club in Ayrshire, Scotland. The event is won by Willie Park Sr",
    "October 18 – The first Convention of Peking formally ends the Second Opium War.",
    "October 18–21 – Beijing's Old Summer Palace is burned to the ground by orders of British general Lord Elgin, in retaliation for mistreatment of several prisoners of war, during the Second Opium War.",
    "October 19 – A new Māori revolt begins in New Zealand.",
    "October 26\nGaribaldi again defeats the Neapolitan forces, advancing on Gaeta, the last remaining Neapolitan strong-point.\nMeeting at Teano: Giuseppe Garibaldi gives Naples to King Victor Emmanuel II, recognizing him as King of Italy.",
    "Garibaldi again defeats the Neapolitan forces, advancing on Gaeta, the last remaining Neapolitan strong-point.",
    "Meeting at Teano: Giuseppe Garibaldi gives Naples to King Victor Emmanuel II, recognizing him as King of Italy.",
    "November 3 – The combined forces of Giuseppe Garibaldi and King Victor Emmanuel II besiege King Francis II of the Two Sicilies in Gaeta, his last remaining stronghold.",
    "November 6 – U.S. presidential election: Abraham Lincoln beats John C. Breckinridge, Stephen A. Douglas, and John Bell, and is elected as the 16th President of the United States, the first Republican to hold that office.",
    "December 1 – Charles Dickens publishes the first installment of Great Expectations in his magazine All the Year Round.",
    "December 7 – After a fiercely contested campaign, Monier Monier-Williams is elected as the new Boden Professor of Sanskrit, at Oxford University.",
    "December 20 – American Civil War: South Carolina becomes the first state to secede from the United States.",
    "December 24 – Mexico's interim president Miguel Miramón flees the country after being defeated in battle.[6]",
    "December 26 – First Rules derby is held between Sheffield F.C. and Hallam F.C., the oldest football fixture in the world.",
    "December 29 – The world's first ocean-going (all) iron-hulled and armoured battleship, the (British) HMS Warrior, is launched.",
    "Christians and Druzes clash in Damascus, Syria.",
    "In Buenos Aires, leader Bartolomé Mitre subverts the Argentine Confederation and begins to establish a new centralist government, with the help of Uruguayan Colorado party leader Venancio Flores.",
    "China agrees, in an unequal treaty (the Convention of Peking) imposed on it, to allow missionaries to proselytize throughout the country.",
    "Discovery of the chemical elements: Robert Bunsen discovers caesium and rubidium.",
    "German chemist Albert Niemann makes a detailed analysis of the coca leaf, isolating and purifying the alkaloid, which he calls cocaine.[7]",
    "Napoleon III, Emperor of the French, and Empress Eugénie visit Algiers and stay at the Casbah of Algiers.[8]",
    "Augustana College is founded in Chicago, Illinois by Scandinavian immigrants.[9]",
    "TAG Heuer watchmaker founded in Bern Canton, Switzerland.[10]",
    "Britain produces 20% of the entire world's output of industrial goods.",
    "The Russian Empire has c. 1,250 miles (2,010 km) of railroads.",
    "The American South has c. 4 million slaves.",
    "1860–1900 – 14 million immigrants come to the United States.",
    "Approximate date – First recorded fish and chip shops in the United Kingdom, Joseph Malin's in London[11] and John Lees' in Mossley near Oldham, Lancashire.[12]"
  ],
  "births": [
    "January 3 – Kato Takaaki, 24th Prime Minister of Japan (d. 1926)",
    "January 8 – Emma Booth, fourth child of William and Catherine Booth (d. 1903)",
    "January 17 – Douglas Hyde, 1st President of Ireland (d. 1949)",
    "January 21 – Karl Staaff, Swedish lawyer, politician, 11th Prime Minister of Sweden (d. 1915)",
    "January 25 – Charles Curtis, 31st Vice President of the United States (d. 1936)",
    "January 28 – W. G. Read Mullan, American Jesuit, academic (d. 1910)",
    "January 29\nWilliam Jacob Baer, American painter (d. 1941)\nAnton Chekhov, Russian writer (d. 1904)",
    "William Jacob Baer, American painter (d. 1941)",
    "Anton Chekhov, Russian writer (d. 1904)",
    "February 11 – Rachilde, French author (d. 1953)",
    "February 14 – Eugen Schiffer, German politician (d. 1954)",
    "February 18 – Anders Zorn, Swedish artist (d. 1920)",
    "February 25 – Sir William Ashley, English economic historian (d. 1927)",
    "February 28 – Carl Georg Barth, American mathematician, mechanical engineer (d. 1939)",
    "February 29 – Herman Hollerith, American businessman, inventor (d. 1929)",
    "March 2 – Susanna M. Salter, first woman mayor in the United States (d. 1961)",
    "March 5 – Sam Thompson, American baseball player (d. 1922)",
    "March 13 – Hugo Wolf, Austrian composer (d. 1903)",
    "March 19 – William Jennings Bryan, American politician (d. 1925)",
    "April 2 – Zheng Xiaoxu, Chinese statesman, diplomat and calligrapher, first Prime Minister of Manchukuo (d. 1938)",
    "April 7 – Will Keith Kellogg, American industrialist, founder of the Kellogg Company (d. 1951)",
    "May 2 – Theodor Herzl, Austrian founder of modern political Zionism (d. 1904)",
    "May 7 – Tom Norman, English freak showman (d. 1930)",
    "May 9 – J. M. Barrie, Scottish author (d. 1937)",
    "May 15 – Ellen Axson Wilson, First Lady of the United States (d. 1914)",
    "May 20 – Eduard Buchner, German chemist, Nobel Prize laureate (d. 1917)",
    "May 21 – Willem Einthoven, Dutch inventor, recipient of the Nobel Prize in Physiology or Medicine (d. 1927)",
    "May 25 – James McKeen Cattell, American psychologist (d. 1944)",
    "May 27 – Manuel Teixeira Gomes, 7th President of Portugal (d. 1941)",
    "May 29 – Isaac Albéniz, Spanish composer (d. 1909)",
    "June 20 – Jack Worrall, Australian cricketer, footballer, and coach (d. 1937)",
    "June 25 – Gustave Charpentier, French composer (d. 1956)",
    "July 3 – Charlotte Perkins Gilman, American feminist (d. 1935)",
    "July 7 – Gustav Mahler, Austrian composer (d. 1911)",
    "July 16 – Otto Jespersen, Danish linguist, creator of Ido and Novial languages (d.1943)",
    "July 19 – Lizzie Borden, American murder suspect (d. 1927)",
    "July 31 – Sir George Warrender, 7th Baronet, British admiral (d. 1917)",
    "August 1 – Bazil Assan, Romanian engineer and explorer (d. 1918)",
    "August 3 – William Kennedy Dickson, Scottish inventor, cinema pioneer, and film director (d. 1935)",
    "August 5 – Louis Wain, English artist (d. 1939)",
    "August 7 – Alan Leo, British astrologer (d. 1917)",
    "August 10 – Vishnu Narayan Bhatkhande, Indian musician (d. 1936)",
    "August 13 – Annie Oakley, American Wild West show performer (d. 1926)",
    "August 15\nHenrietta Vinton Davis, American elocutionist, dramatist, and impersonator (d. 1941)\nFlorence Harding, First Lady of the United States (d. 1924)",
    "Henrietta Vinton Davis, American elocutionist, dramatist, and impersonator (d. 1941)",
    "Florence Harding, First Lady of the United States (d. 1924)",
    "August 16 – Jules Laforgue, French poet (d. 1887)",
    "August 20 – Raymond Poincaré, French president (d. 1934)",
    "August 22 – Alfred Ploetz, German physician, biologist, and eugenicist (d. 1940)",
    "August 25 – George Fawcett, American actor (d. 1939)",
    "August 26 – Eudora Stone Bumstead, American poet and hymnwriter (d. 1892)",
    "September 1 – Mary E. C. Bancker, American author (d. 1921)",
    "September 5 – Andrew Volstead, American politician (d. 1947)",
    "September 6 – Jane Addams, American social worker, recipient of the Nobel Peace Prize (d. 1935)",
    "September 7 – Anna Mary Robertson Moses (aka Grandma Moses), American painter, centenarian (d. 1961)",
    "September 13 – John J. Pershing, American general (d. 1948)",
    "September 15 – M. Visvesvaraya, Indian engineer, statesman (d. 1962)",
    "September 16 – Hermann Kusmanek von Burgneustädten, Austro-Hungarian general (d. 1934)",
    "October 31 – Juliette Gordon Low, American founder of the Girl Scouts (d. 1927)",
    "November 1 – Boies Penrose, United States Senator from Pennsylvania (d. 1921)",
    "November 2 – Soapy Smith, American con artist and gangster (d. 1898)",
    "November 6 – Ignacy Jan Paderewski, Polish pianist and composer, 3rd Prime Minister of Poland (d. 1941)",
    "November 16 – John Henry Kirby, Texas legislator, American businessman (d. 1940)",
    "November 23 – Hjalmar Branting, Prime Minister of Sweden, recipient of the Nobel Peace Prize (d. 1925)",
    "November 27 – Yui Mitsue, Japanese general (d. 1925)",
    "December 4 – Charles de Broqueville, Prime Minister of Belgium (d. 1940)",
    "December 7 – Joseph Cook, 6th Prime Minister of Australia (d. 1947)",
    "December 15 – Niels Ryberg Finsen, Danish physician, recipient of the Nobel Prize in Physiology or Medicine (d. 1904)",
    "December 16 – Ion Dragalina, Romanian general (d. 1916)",
    "December 25 – Manuel Dimech, Maltese philosopher, social reformer (d. 1921)",
    "December 31\nJoseph S. Cullinan, American oil industrialist, founder of Texaco (d. 1937)\nJohn T. Thompson, United States Army officer, inventor of the Tommy gun (d. 1940)",
    "Joseph S. Cullinan, American oil industrialist, founder of Texaco (d. 1937)",
    "John T. Thompson, United States Army officer, inventor of the Tommy gun (d. 1940)"
  ],
  "deaths": [
    "January 1 – Thomas Hobbes Scott, English clergyman (b. 1783)",
    "January 5 – John Neumann, Saint and Roman Catholic Bishop of Philadelphia (b. 1811)",
    "January 10 – Ezequiel Zamora, leader of the Federalist Army in Venezuela (b. 1817)",
    "January 13 – William Mason, American politician (b. 1786)",
    "January 18 – John Nelson (lawyer), American lawyer (b. 1791)",
    "January 26 – Eliza Lee Cabot Follen, American writer (b. 1787)",
    "January 27\nJános Bolyai, Hungarian mathematician (b. 1802)\nThomas Brisbane, Scottish astronomer (b. 1773)",
    "János Bolyai, Hungarian mathematician (b. 1802)",
    "Thomas Brisbane, Scottish astronomer (b. 1773)",
    "January 29 –\nErnst Moritz Arndt, German writer, poet (b. 1769)\nStéphanie de Beauharnais, Grand Duchess of Baden (b. 1789)",
    "Ernst Moritz Arndt, German writer, poet (b. 1769)",
    "Stéphanie de Beauharnais, Grand Duchess of Baden (b. 1789)",
    "February 29 – George Bridgetower, Afro-Polish violinist (b. 1778)",
    "March 6 – Justus Johann Friedrich Dotzauer, German cellist, composer (b. 1783)",
    "March 14 – Carl Ritter von Ghega, Albanian-born Venetian road engineer (b. 1802)",
    "March 17 – Anna Brownell Jameson, British author (b. 1794)",
    "March 25 – James Braid, Scottish surgeon (b. 1795)",
    "May 1 – Anders Sandøe Ørsted, 3rd Prime Minister of Denmark (b. 1778)",
    "May 10 – Theodore Parker, American preacher, Transcendentalist, and abolitionist (b. 1810)",
    "May 12 – Sir Charles Barry, English architect (b. 1795)[13]",
    "May 21 – Phineas Gage, improbable American head injury survivor (b. 1823)",
    "June 18 – Friedrich Wilhelm von Bismarck, German army officer, writer (b. 1783)",
    "June 30 – Gotthilf Heinrich von Schubert, German naturalist (b. 1780)",
    "July 1 – Charles Goodyear, American inventor (b. 1800)",
    "August 25 – Johan Ludvig Heiberg, Danish poet and critic (born 1791)[14]",
    "September 12 – William Walker, American filibuster who was briefly President of Nicaragua (executed) (b. 1824)",
    "September 21 – Arthur Schopenhauer, German philosopher (b. 1788)[15]",
    "October 12 – Sir Harry Smith, English soldier, military commander (b. 1787)",
    "October 25 – Alexander Maconchie, Scottish penal reformer (b. 1787)",
    "October 31 – Thomas Cochrane, 10th Earl of Dundonald, British admiral (b. 1775)",
    "November 1 – Alexandra Feodorovna (Charlotte of Prussia), Empress Consort of Russian Emperor Nicholas I (b. 1798)",
    "December 2 – Ferdinand Christian Baur, German theologian (b. 1792)[16]",
    "December 14 – George Hamilton-Gordon, 4th Earl of Aberdeen, Prime Minister of the United Kingdom (b. 1784)",
    "Dai Xi, Chinese painter (b. 1801)"
  ]
}