{
  "events": [
    "January 1\nThe first edition of The Northern Echo newspaper is published in Priestgate, Darlington, England.\nPlans for the Brooklyn Bridge are completed.",
    "The first edition of The Northern Echo newspaper is published in Priestgate, Darlington, England.",
    "Plans for the Brooklyn Bridge are completed.",
    "January 3 – Construction of the Brooklyn Bridge begins in New York City.",
    "January 6 – The Musikverein, Vienna, is inaugurated in Austria-Hungary.",
    "January 10 – John D. Rockefeller incorporates Standard Oil.",
    "January 15 – A political cartoon for the first time symbolizes the United States Democratic Party with a donkey (A Live Jackass Kicking a Dead Lion by Thomas Nast for Harper's Weekly).",
    "January 23 – Marias Massacre: U.S soldiers attack a peaceful camp of Piegan Blackfeet Indians, led by chief Heavy Runner.",
    "January 26 – Reconstruction Era (United States): Virginia rejoins the Union. This year it adopts a new Constitution, drawn up by John Curtiss Underwood, expanding suffrage to all male citizens over 21, including freedmen.",
    "January 28 – British SS City of Boston departs Halifax, Nova Scotia, on a transatlantic passage on which it will be lost with all 191 aboard.",
    "February – Denis Vrain-Lucas is sentenced to 2 years in prison for multiple forgery, in Paris.",
    "February 1 – Goodna State School in Goodna, Queensland, Australia is founded.",
    "February 2\nIt is revealed that the famed Cardiff Giant in the U.S. is just carved gypsum and not the petrified remains of a human.\nThe Seven Brothers (Seitsemän veljestä), a novel by Finnish author Aleksis Kivi, is published first time in several thin booklets.[1]",
    "It is revealed that the famed Cardiff Giant in the U.S. is just carved gypsum and not the petrified remains of a human.",
    "The Seven Brothers (Seitsemän veljestä), a novel by Finnish author Aleksis Kivi, is published first time in several thin booklets.[1]",
    "February 3 – The 15th Amendment to the United States Constitution, guaranteeing African American men the right to vote, is passed.",
    "February 9 – The U.S. Army Weather Bureau is created within the Army Signal Corps.",
    "February 10\nAnaheim, California is incorporated.\nThe YWCA is founded in New York City.",
    "Anaheim, California is incorporated.",
    "The YWCA is founded in New York City.",
    "February 12 – Women's suffrage: Women gain the right to vote in Utah Territory.",
    "February 23 – Military control of Mississippi ends and it is readmitted to the Union.",
    "February 25 – Hiram Rhodes Revels, a Republican from Mississippi, is sworn into the United States Senate, becoming the first African American to sit in the U.S. Congress.",
    "February 26\nIn New York City, the first pneumatic subway is opened, Beach Pneumatic Transit.\nThe German Commerzbank is founded in Hamburg.",
    "In New York City, the first pneumatic subway is opened, Beach Pneumatic Transit.",
    "The German Commerzbank is founded in Hamburg.",
    "February 27 – The 'circle of the sun' flag of Japan is adopted as the national flag for Japanese merchant ships, by proclamation of the Daijō-kan.",
    "February 28 – The Bulgarian Exarchate is established, by decree of Sultan Abdülaziz of the Ottoman Empire.",
    "March – The Mitsubishi Company is established in Japan as a shipping firm, by Iwasaki Yatarō with Thomas Blake Glover.",
    "March 1 – Battle of Cerro Corá, Paraguay: Marshal Francisco Solano López's last troops are cornered by those of the Triple Alliance. López refuses to surrender and is killed, ending the Paraguayan War.",
    "March 4 – Red River Rebellion: Thomas Scott is executed by Louis Riel's provisional government, in modern-day Manitoba, Canada.",
    "March 5 – The first ever international Association football match, England v Scotland, takes place under the auspices of the Football Association at The Oval, London.",
    "March 10 – Deutsche Bank is founded in Berlin.",
    "March 18 – Female Infanticide Prevention Act, 1870, passed in British India.",
    "March 19 – The Ohio Legislature passes the Cannon Act, thereby establishing the Ohio Agriculture and Mechanical College, later Ohio State University.",
    "March 24 – Syracuse University is established in New York (state) and officially opens.",
    "March 30\nThe 15th Amendment to the United States Constitution, giving African American men the right to vote, is ratified.\nReconstruction: Texas is readmitted to the Union.",
    "The 15th Amendment to the United States Constitution, giving African American men the right to vote, is ratified.",
    "Reconstruction: Texas is readmitted to the Union.",
    "March 31 – Thomas Mundy Peterson is the first African American to vote in an election.",
    "April 13 – The Metropolitan Museum of Art was established.",
    "April 27 – Antonio Guzmán Blanco begins his first term as President of Venezuela.",
    "April 29 – The Chicago Base Ball Club, later to be known as the Chicago White Stockings and ultimately the Chicago Cubs, play their first game against the St. Louis Unions of the National Association of Base Ball Players, an amateur league.",
    "May 8 – German colonial army attacked the Baster people in South West Africa (today Namibia) who had fled to their last stronghold of Sam Khubis.",
    "May 12\nThe Canadian province of Manitoba is created, in response to Louis Riel's Red River Rebellion.\nThe Port Adelaide Football Club is founded.",
    "The Canadian province of Manitoba is created, in response to Louis Riel's Red River Rebellion.",
    "The Port Adelaide Football Club is founded.",
    "May 14 – The first rugby match is played in New Zealand, between the Nelson Football Club and Nelson College.",
    "June 8 – The final splice on the first telegraph submarine cable between Great Britain and India is made.",
    "June 9 – English novelist Charles Dickens dies at Gads Hill Place in Kent, leaving his last book, The Mystery of Edwin Drood, unfinished.",
    "June 21 – The Tianjin Massacre of 17 foreigners (mostly European Christian priests and nuns) and 40 Chinese people who had converted to Christianity, takes place in China when an angry mob attacks churches established in the city.[2]",
    "June 22\nThe office of the Solicitor General of the United States is set up, to supervise and conduct government litigation in the United States Supreme Court.\nThe U.S. Congress creates the United States Department of Justice.",
    "The office of the Solicitor General of the United States is set up, to supervise and conduct government litigation in the United States Supreme Court.",
    "The U.S. Congress creates the United States Department of Justice.",
    "June 23 The first message by electric telegraph using the Great Britain to India submarine cable is sent from London.",
    "June 26 – Richard Wagner's opera Die Walküre is first performed at Munich's National Theatre.",
    "June 28 – American President Ulysses S. Grant signs an act making the United States Independence Day,  Thanksgiving Day, Christmas Day and New Year's Day federal holidays in the United States.[3][4]",
    "July 14 – The Ems Dispatch is published, serving as casus belli for a war between Prussia and France.",
    "July 15\nReconstruction Era: Georgia becomes the last former Confederate state of America to be readmitted to the Union.\nThe British government admits the former Hudson's Bay Company territory of Rupert's Land and the North-Western Territory to the Dominion of Canada.",
    "Reconstruction Era: Georgia becomes the last former Confederate state of America to be readmitted to the Union.",
    "The British government admits the former Hudson's Bay Company territory of Rupert's Land and the North-Western Territory to the Dominion of Canada.",
    "July 18 – Pastor aeternus: Pope Pius IX declares papal infallibility, in matters of faith and morals.",
    "July 19 – Franco-Prussian War: France declares war on Prussia.",
    "July 28 – Start of Solar Saros 153. The final eclipse in this series will be in 3114.",
    "July 30 – The 'Diggers' Republic' is proclaimed at Klipdrift in South Africa by diamond miners, with Stafford Parker as president.",
    "August 2 – The Tower Subway beneath the River Thames in London, the world's first underground passenger \"tube\" railway, officially opens.[5] Although this lasts as a railway operation only until November, it demonstrates the technologically successful first use of the cylindrical wrought iron tunnelling shield, devised by Peter W. Barlow and James Henry Greathead,[6] and of a permanent tunnel lining of cast iron segments.[7]",
    "August 8 – The Republic of Ploiești, an uprising against Domnitor Carol of Romania, fails.",
    "August 24 – The Red River Rebellion in Canada ends with the arrival of the Wolseley Expedition and the flight of Louis Riel.",
    "September 2 – Franco-Prussian War: Battle of Sedan – Prussian forces defeat the French armies and take Emperor Napoleon III and 100,000 of his soldiers prisoner at Sedan, France.",
    "September 4 – Emperor Napoleon III of France is deposed and the Third Republic is declared. Empress Eugénie flees to England with her son.",
    "September 6 – Louisa Swain of Laramie, Wyoming, becomes the first woman in the United States to cast a vote legally since 1807.",
    "September 18 – Old Faithful Geyser is observed and named by Henry D. Washburn, during the Washburn–Langford–Doane Expedition to Yellowstone in Wyoming.",
    "September 19 – Franco-Prussian War: The Siege of Paris (1870–1871) begins. From September 23, balloon mail is sent out of the city.",
    "September 20 – Capture of Rome; With Bersaglieri soldiers entering Rome at Porta Pia, the unification of Italy is completed, ending the last remnant of the Papal States and Papal temporal power.",
    "October 2 – A plebiscite held in Rome supports, by 133,681 votes to 1,507, the annexation of the city by Italy.",
    "October 6 – Rome becomes the capital of unified Italy.",
    "October 8 – Léon Gambetta escapes besieged Paris in a hot-air balloon.",
    "October 20 – The First Vatican Council adjourns.",
    "October 26 – The Chinese leaders of June's Tianjin Massacre of foreigners are executed by the China's Imperial government.[2]",
    "October 27 – Franco-Prussian War: Siege of Metz – Marshal François Achille Bazaine, commanding the French left wing, is forced by starvation to surrender the fortifications of Metz.",
    "November 1 – In the United States, the newly created Weather Bureau (later renamed the National Weather Service) makes its first official meteorological forecast: \"High winds at Chicago and Milwaukee... and along the Lakes\".",
    "November 12 – Dresdner Bank is founded in Germany.",
    "November 16 – The Spanish Cortes Generales proclaims Amadeo de Saboya as King Amadeo I of Spain.",
    "December 12 – Joseph H. Rainey of South Carolina becomes the second black U.S. congressman (following Hiram Rhodes Revels in February).",
    "December 28 – Juan Prim, prime minister of Spain, is shot by unknown assassins on leaving the Cortes, dying two days later.",
    "December 31\nSir Henry Barkly is appointed Governor of the Cape of Good Hope and High Commissioner for Southern Africa.\nThe 12.8 km (8.0 mi) Fréjus Rail Tunnel through the Alps is completed.",
    "Sir Henry Barkly is appointed Governor of the Cape of Good Hope and High Commissioner for Southern Africa.",
    "The 12.8 km (8.0 mi) Fréjus Rail Tunnel through the Alps is completed.",
    "Japanese yen currency is introduced to supersede the mon.",
    "David Kenyon invents the fireman's pole in Chicago.",
    "Graeter's ice cream is originated in Cincinnati, Ohio.",
    "Just one of the 916 members of the Indian Civil Service is Indian."
  ],
  "births": [
    "January 2 – Ernst Barlach, German sculptor, graphic artist and poet (d. 1938)",
    "January 6 – Gustav Bauer, Chancellor of Germany (d. 1944)",
    "January 8\nWalter Edwards, American film director (d. 1920)\nMiguel Primo de Rivera, dictator of Spain (d. 1930)",
    "Walter Edwards, American film director (d. 1920)",
    "Miguel Primo de Rivera, dictator of Spain (d. 1930)",
    "January 11 – Alexander Stirling Calder, American sculptor (d. 1945)",
    "January 14 – George Pearce, Australian politician (d. 1952)",
    "January 20 – Ajahn Mun Bhuridatta, Thai Buddhist monk (d. 1949)",
    "January 23 – William G. Morgan, American inventor of volleyball (d. 1942)",
    "February 1 – Erik Adolf von Willebrand, Finnish physician (d. 1949)",
    "February 7 – Alfred Adler, Austrian psychologist (d. 1937)",
    "February 12\nMarie Lloyd, English singer (d. 1922)\nHugo Stinnes, German industrialist, politician (d. 1924)",
    "Marie Lloyd, English singer (d. 1922)",
    "Hugo Stinnes, German industrialist, politician (d. 1924)",
    "February 20 – Jay Johnson Morrow, American military engineer, politician, 3rd Governor of the Panama Canal Zone (d. 1937)",
    "February 25 – Jelica Belović-Bernardzikowska, Croatian writer (d. 1946)",
    "March 5 – Frank Norris, American writer (d. 1902)",
    "March 10 – Ester Rachel Kamińska, Polish actress, \"mother of Yiddish theatre\" (d. 1925)",
    "March 13 – Seale Harris, American physician (d. 1957)",
    "March 17 – Horace Donisthorpe, English entomologist (d. 1951)",
    "March 20 – Paul von Lettow-Vorbeck, German general (d. 1964)",
    "March 29 – Pavlos Melas, Greek revolutionary and army officer (d. 1904)",
    "March 31 – James M. Cox, Democratic candidate for President of the United States in the election of 1920 (d. 1957)",
    "April 1 – Hamaguchi Osachi, 27th Prime Minister of Japan (d. 1931)",
    "April 4 – George Albert Smith, 8th president of The Church of Jesus Christ of Latter-day Saints (d. 1951)",
    "April 17 – Ray Stannard Baker, American journalist, author (d. 1946)",
    "April 22 – Vladimir Lenin, Russian revolutionary, first Premier of the Soviet Union (d. 1924)",
    "April 21 – Edwin S. Porter, American film director (d. 1941)",
    "April 30 – Franz Lehár, Austrian composer (d. 1948)",
    "May 9 – Harry Vardon, English golf professional (d. 1937)",
    "May 10 – Reginald Tyrwhitt, British admiral (d. 1951)",
    "May 19 – Albert Fish, American serial killer (d. 1936)",
    "May 24\nBenjamin N. Cardozo, Associate Justice of the Supreme Court of the United States (d. 1938)\nJan Smuts, South African soldier, statesman (d. 1950)",
    "Benjamin N. Cardozo, Associate Justice of the Supreme Court of the United States (d. 1938)",
    "Jan Smuts, South African soldier, statesman (d. 1950)",
    "June 13 – Jules Bordet, Belgian immunologist, microbiologist, recipient of the Nobel Prize in Physiology or Medicine (d. 1961)",
    "June 18 – Édouard Le Roy, French mathematician and philosopher (d. 1954)",
    "June 20 – Georges Dufrénoy, French post-impressionist painter (d. 1943)",
    "July 3 – R. B. Bennett, 11th Prime Minister of Canada (d. 1947)",
    "July 9 – Mathew Beard, American supercentenarian, last surviving person born in 1870 (d. 1985)",
    "July 12 – Louis II, Prince of Monaco (d. 1949)",
    "July 25 – Maxfield Parrish, American illustrator (d. 1966)",
    "July 26 – Charles Becker, American policeman and murderer (d. 1915)",
    "July 27 – Hilaire Belloc, French/English man of letters (d. 1953)",
    "July 29 – George Dixon, Canadian boxer (d. 1909)",
    "August 2 – Marianne Weber, German sociologist and suffragist (d. 1954)[8]",
    "August 4 – Harry Lauder, Scottish entertainer (d. 1950)",
    "August 10 – Hans Zenker, German admiral (d. 1932)",
    "August 11 – Tom Richardson, English cricketer (d. 1912)",
    "August 12 – Hubert Gough, British general (d. 1963)",
    "August 20 – Edward Stanley Kellogg, 16th Governor of American Samoa (d. 1948)",
    "August 31 – Maria Montessori, Italian educator (d. 1952)",
    "September 24 – Georges Claude, French engineer, inventor (d. 1960)",
    "September 26 – King Christian X of Denmark (d. 1947)",
    "September 30\nJean Baptiste Perrin, French physicist, Nobel Prize laureate (d. 1942)\nThomas W. Lamont, American banker (d. 1948)",
    "Jean Baptiste Perrin, French physicist, Nobel Prize laureate (d. 1942)",
    "Thomas W. Lamont, American banker (d. 1948)",
    "October 2 – Horace Hood, British admiral (d. 1916)",
    "October 4 – Karl Renner, 1st Chancellor of Austria (d. 1950)",
    "October 10 – Ivan Bunin, Russian writer, Nobel Prize laureate (d. 1953)",
    "October 18 – D. T. Suzuki, Japanese philosopher (d. 1966)",
    "October 22 – Johan Ludwig Mowinckel, Norwegian businessman, Prime Minister of Norway (d. 1943)",
    "October 30 – Lawrence Grant, English actor (d. 1952)",
    "November 21 – Sigfrid Edström, Swedish sports official, President of the International Olympic Committee (d. 1964)",
    "November 27 – Juho Kusti Paasikivi, Prime Minister and President of Finland (d. 1956)",
    "November 28 – Gustavus M. Blech, German-American physician, surgeon (d. 1949)",
    "November 29 – Trixie Friganza, American actress (d. 1955)",
    "December 5 – Vítězslav Novák, Czech composer (d. 1949)",
    "December 9 – Francisco S. Carvajal, 36th President of Mexico (d. 1932)",
    "December 10 – Jadunath Sarkar, Indian historian (d. 1958)",
    "December 14\nDirk Jan de Geer, Prime Minister of the Netherlands (d. 1960)\nKarl Renner, 4th President of Austria (d. 1950)",
    "Dirk Jan de Geer, Prime Minister of the Netherlands (d. 1960)",
    "Karl Renner, 4th President of Austria (d. 1950)",
    "December 18 – Saki, English writer (d. 1916)",
    "December 31 – Mbah Gotho, Indonesian man, oldest human (d. 2017)"
  ],
  "deaths": [
    "January 20 – Sir George Seymour, British admiral of the fleet (b. 1787)",
    "January 25 – Victor de Broglie, Prime Minister of France (b. 1785)",
    "January 29 – Leopold II, Grand Duke of Tuscany (b. 1797)",
    "February 7 – Sylvain Salnave, Haitian general, 9th President of Haiti (b. 1827)",
    "February 11 – Carlos Soublette, 2-time President of Venezuela (b. 1789)",
    "February 19 – Nathaniel de Rothschild, French wine grower (b. 1812)",
    "March 1 – Francisco Solano López, 2nd President of Paraguay (killed in action) (b. 1827)",
    "March 4 – Thomas Scott, Canadian Orangeman, surveyor of the Red River Rebellion (shot by Louis Riel and the Métis) (b. c. 1842)",
    "March 11 – Moshoeshoe I of Lesotho (b. 1786?)",
    "March 28 – George Henry Thomas, American general (b. 1816)",
    "April 15 – Emma Willard, American women's rights activist (b. 1787)",
    "April 16 – Domnița Rallou Caragea, Greek princess, independence activist (b. 1799)",
    "May 6 – Sir James Young Simpson, Scottish physician, researcher (b. 1811)",
    "June 6 – Ferdinand von Wrangel, Baltic-German explorer (b. 1796/1797)",
    "June 7 – Friedrich Hohe, German lithographer, painter (b. 1802)",
    "June 9 – Charles Dickens, British novelist (b. 1812)[9]",
    "June 20 – Jules de Goncourt, French writer, publisher (b. 1830)[10]",
    "June 23 – Mírzá Mihdí, youngest child of Baháʼí founder Baháʼu'lláh (b. 1848)",
    "June 27 – Cyrus Kingsbury, American missionary to Choctaw Indians (b. 1786)",
    "July 10 – Pelaghia Roșu, Romanian heroine (b. 1800)",
    "July 22 – Josef Strauss, Austrian composer (b. 1827)",
    "August 4 – Abel Douay, French general (killed in action) (b. 1809)",
    "August 14 – David Farragut, American admiral (b. 1801)",
    "August 17 – Pedro Figueredo, Cuban poet, musician and freedom fighter (b. 1818)",
    "September 4 – Juan Javier Espinosa, 9th President of Ecuador (b. 1815)",
    "September 23 – Prosper Mérimée, French writer (b. 1803)[11]",
    "September 27 – William F. Packer, American politician (b. 1807)",
    "October 12\nStephen Greenleaf Bulfinch, American minister, hymn writer (b. 1809)\nRobert E. Lee, Confederate general (b. 1807)",
    "Stephen Greenleaf Bulfinch, American minister, hymn writer (b. 1809)",
    "Robert E. Lee, Confederate general (b. 1807)",
    "November 3 – Diego Noboa, 4th President of Ecuador (b. 1789)",
    "November 23 – Giuseppina Bozzacchi, Milanese-born ballerina (b. 1853) (result of deprivation during Siege of Paris)",
    "November 24 – Comte de Lautréamont, French poet, writer (b. 1846)",
    "November 26 – Franz Graf von Wimpffen, Austrian general and admiral (b. 1797)",
    "November 28 – Frédéric Bazille, French painter (b. 1841)",
    "December 5\nDavid G. Burnet, early politician within the Republic of Texas (b. 1788)\nAlexandre Dumas, père, French author (b. 1802)[12]",
    "David G. Burnet, early politician within the Republic of Texas (b. 1788)",
    "Alexandre Dumas, père, French author (b. 1802)[12]",
    "December 9 – Patrick MacDowell, Northern Irish sculptor (b. 1799)",
    "December 27 – Juan Prim, Spanish general and prime minister (assassinated) (b. 1814)"
  ]
}