{
  "events": [
    "January 1\nThe Reichsbank opens in Berlin.\nThe Bass Brewery Red Triangle becomes the world's first registered trademark symbol.[1]",
    "The Reichsbank opens in Berlin.",
    "The Bass Brewery Red Triangle becomes the world's first registered trademark symbol.[1]",
    "February 2 – The National League of Professional Base Ball Clubs is formed at a meeting in Chicago; it replaces the National Association of Professional Base Ball Players. Morgan Bulkeley of the Hartford Dark Blues is selected as the league's first president.",
    "February 2 – Third Carlist War – Battle of Montejurra: The new commander General Fernando Primo de Rivera marches on the remaining Carlist stronghold at Estella, where he meets a force of about 1,600 men under General Carlos Calderón, at nearby Montejurra. After a courageous and costly defence, Calderón is forced to withdraw.",
    "February 14 – Alexander Graham Bell applies for a patent for the telephone, as does Elisha Gray.",
    "February 19 – Third Carlist War: Government troops under General Primo de Rivera drive through the weak Carlist forces protecting Estella, and take the city by storm.",
    "February 22 – Johns Hopkins University is founded in Baltimore.",
    "February 24 – The first stage production of the verse-play Peer Gynt by Henrik Ibsen premieres, with incidental music by Edvard Grieg, in Oslo (then called Christiania), Norway.",
    "February 26 – The Japanese force the Korean government to sign the Japan–Korea Treaty of 1876 (having brought a fleet to Incheon, the port of modern-day Seoul), opening three ports to Japanese trade and forcing Korea's Joseon dynasty to cease considering itself a tributary of China. On China's urging, Korea also signs treaties with the European powers, in an effort to counterbalance Japan.",
    "February 28 – Third Carlist War: The Carlist forces do not succeed, and the promises are never fulfilled. The Carlist pretender Carlos, Duke of Madrid, goes into exile in France, bringing the conflict to an end after four years.",
    "February–March – The Harvard Lampoon humor magazine is founded in Cambridge, Massachusetts.",
    "Spring – Thousands of Plains Indians in the United States travel to an encampment of the Sioux chief Sitting Bull in the region of the Little Bighorn River, creating the last great gathering of native peoples on the Great Plains.[2]",
    "March – American librarian Melvil Dewey first publishes the Dewey Decimal Classification system.[3]",
    "March 2 – United States Secretary of War William Belknap resigns his office in the wake of the trader post scandal. He is later impeached by the US House of Representatives.",
    "March 7 – Alexander Graham Bell is granted a United States patent for the telephone.[4]",
    "March 10 – Alexander Graham Bell makes the first successful telephone call, saying \"Mr. Watson, come here, I want to see you\".",
    "March 20 – Through constitutional reform taking legal effect, Louis De Geer becomes the first Prime Minister of Sweden.",
    "April 12 – The Indian Act comes into force in Canada.",
    "April 16 – The April Uprising in Bulgaria occurs.",
    "April 17 – Friends Academy is founded by Gideon Frost at Locust Valley, New York.",
    "May – April Uprising (Bulgaria): Batak massacre – Bulgarians in Batak are massacred by Ottoman troops. The number of victims ranges from 3,000 to 5,000, depending on the source.",
    "May 1\nThe Royal Titles Act 1876 confers the title Empress of India upon Queen Victoria.\nThe Settle–Carlisle Railway in England is opened to passenger traffic (it opened to goods traffic in 1875).",
    "The Royal Titles Act 1876 confers the title Empress of India upon Queen Victoria.",
    "The Settle–Carlisle Railway in England is opened to passenger traffic (it opened to goods traffic in 1875).",
    "May 10\nThe Centennial Exposition begins in Philadelphia.\nA major pharmaceutical brand, Eli Lilly, founded in Indiana, United States.[page needed]",
    "The Centennial Exposition begins in Philadelphia.",
    "A major pharmaceutical brand, Eli Lilly, founded in Indiana, United States.[page needed]",
    "May 11/12 – Berlin Memorandum: Germany, Russia and Austria-Hungary propose an armistice between Turkey and its insurgents.",
    "May 16\nBritish Prime Minister Benjamin Disraeli rejects the Berlin Memorandum.\nGerman American \"Napoleon of crime\" Adam Worth steals Gainsborough's Portrait of Georgiana, Duchess of Devonshire a London gallery three weeks after its sale at Christie's for 10,000 guineas, the highest price ever paid for a painting at auction at this time.[5] It is not recovered until 1901.",
    "British Prime Minister Benjamin Disraeli rejects the Berlin Memorandum.",
    "German American \"Napoleon of crime\" Adam Worth steals Gainsborough's Portrait of Georgiana, Duchess of Devonshire a London gallery three weeks after its sale at Christie's for 10,000 guineas, the highest price ever paid for a painting at auction at this time.[5] It is not recovered until 1901.",
    "May 17 – Nicolaus Otto files his patent for the four-stroke cycle internal combustion engine.[6]",
    "May 18 – Wyatt Earp starts work in Dodge City, Kansas, serving under Marshal Larry Deger.",
    "May 29 – The United States Senate votes 37 to 29 that US Secretary of War William Belknap cannot be barred from trial and impeachment, despite being a private citizen.",
    "May 30 – Abdülaziz is deposed by his nephew Murad V as Sultan of the Ottoman Empire on the grounds of mismanaging the economy; 6 days later, Abdülaziz is found dead at the Çırağan Palace in Istanbul and 93 days later Murad is deposed by Abdul Hamid II on the grounds of mental illness.",
    "June 4 – The Transcontinental Express arrives in San Francisco via the First Transcontinental Railroad, 83 hours and 39 minutes after having left New York City.",
    "June 17 – American Indian Wars: Battle of the Rosebud – 1,500 Sioux and Cheyenne, led by Crazy Horse, beat back General George Crook's forces at Rosebud Creek in Montana Territory.",
    "June 19 – Jászkunság, the last remnant of Kunság within Austria-Hungary, is disestablished.",
    "June 25/26 – American Indian Wars: Battle of the Little Bighorn. 300 men of the U.S. 7th Cavalry Regiment under Lieutenant Colonel George Armstrong Custer are wiped out by 5,000 Lakota, Cheyenne and Arapaho, led by Sitting Bull and Crazy Horse.",
    "July 1 – Serbia declares war on the Ottoman Empire.",
    "July 2 – Montenegro declares war on the Ottoman Empire.",
    "July 4 – The United States Centennial Exposition is celebrated across the country.",
    "July 8 – Reichstadt Agreement: Russia and Austria-Hungary agree on partitioning the Balkan Peninsula.",
    "July 13 – The prosecution of Arthur Tooth, an Anglican clergyman, for using ritualist practices begins.",
    "August 1\nColorado is admitted as the 38th U.S. state.\nThe United States Senate votes to acquit former Secretary of War William Belknap of all impeachment charges relating to the trader post scandal.",
    "Colorado is admitted as the 38th U.S. state.",
    "The United States Senate votes to acquit former Secretary of War William Belknap of all impeachment charges relating to the trader post scandal.",
    "August 2 – Wild Bill Hickok is murdered in Deadwood, South Dakota.",
    "August 8 – Thomas Edison receives a patent for his mimeograph.",
    "August 13 – Richard Wagner inaugurates the Bayreuth Festival.",
    "August 31 – Murad V, Sultan of the Ottoman Empire, is deposed and succeeded by his brother Abdul Hamid II.",
    "September 5 – Gladstone publishes his Bulgarian Horrors pamphlet.",
    "September 7 – In Northfield, Minnesota, Jesse James and the James–Younger Gang attempt to rob the town's bank, but are surrounded by an angry mob and nearly wiped out.",
    "September 12 – King Leopold II of Belgium hosts the Brussels Geographic Conference, on the subject of colonizing and exploring central Africa. By the event's conclusion, a new international body named the International African Association (indirect forerunner of the modern Congo state) is established.",
    "September 26 – A worldwide consumer goods and personal care company, Henkel is founded by Friedrich Karl Henkel in Germany.[citation needed]",
    "October 4 – Texas A&M University opens for classes.",
    "October 6 – The American Library Association is founded in Philadelphia.",
    "October 26 – José María Iglesias (1823-1891) begins his disputed presidency of Mexico.[7]",
    "October 31 – The great 1876 Bengal cyclone strikes the coast of modern-day Bangladesh, killing 200,000.",
    "November 1 – The British Colony of New Zealand dissolves its 9 provinces, and replaces them with 63 counties.",
    "November 4 – The long-awaited First Symphony of Johannes Brahms has its première at Karlsruhe, under the baton of Otto Dessoff.",
    "November 7\nU.S. presidential election, 1876: After long and heated disputes, Rutherford B. Hayes is eventually declared the winner over Samuel J. Tilden.\nA failed grave robbery of the Lincoln Tomb takes place on this same night.",
    "U.S. presidential election, 1876: After long and heated disputes, Rutherford B. Hayes is eventually declared the winner over Samuel J. Tilden.",
    "A failed grave robbery of the Lincoln Tomb takes place on this same night.",
    "November 10 – The Centennial Exposition ends in Philadelphia, Pennsylvania.",
    "November 23 – Corrupt Tammany Hall leader William Marcy Tweed (better known as Boss Tweed) is delivered to authorities in New York City, after being captured in Spain.",
    "November 25 – American Indian Wars: Dull Knife Fight – In retaliation for the dramatic American defeat at the Battle of the Little Bighorn, United States Army troops under General Ranald S. Mackenzie sack Chief Dull Knife's sleeping Cheyenne village at the headwaters of the Powder River (the soldiers destroy all of the villagers' winter food and clothing, and then slash their ponies' throats).",
    "November 29 – Porfirio Díaz becomes President of Mexico.",
    "December – The first American edition of Mark Twain's The Adventures of Tom Sawyer is published by the American Publishing Company; a British edition has appeared in early June in London with the first review appearing on June 24 in a British magazine.",
    "December 2 – Chugai Economic Daily, as predecessor of Nikkei Economic Daily (Nihon Keizai Shinbun), is first issued in Tokyo, Japan.[8]",
    "December 5 – The Brooklyn Theatre fire kills at least 278, possibly more than 300.",
    "December 6 – The first cremation in the United States takes place, in a crematory built by Francis Julius LeMoyne at North Franklin Township, Washington County, Pennsylvania.",
    "December 23 – Constantinople Conference opens.",
    "December 29 – The Ashtabula River railroad disaster occurs in Ohio when a bridge collapses leaving 92 dead.",
    "The Northern Chinese Famine of 1876–79, which will claim 30 million lives and become the 5th worst famine in recorded history, begins after the droughts of the previous year.",
    "Tanzimat ends in the Ottoman Empire.",
    "Heinz Tomato Ketchup is introduced.",
    "Adolphus Busch's brewery, Anheuser-Busch in St. Louis, Missouri, first markets Budweiser, a pale lager, as a nationally sold beer.",
    "Charles Wells opens his brewery, based in Bedford, England.",
    "In Düsseldorf, German company Henkel is founded.",
    "Lyford House, by Richardson Bay, Tiburon, California, is constructed.",
    "Construction of Spandau Prison in Berlin is completed.",
    "Samurai are banned from carrying swords in Japan, and their stipends are replaced by a one-time grant of income-bearing bonds.",
    "The Conchological Society of Great Britain & Ireland is founded.",
    "Lars Magnus Ericsson starts a small mechanical workshop April 1 in Stockholm and partners up with Carl Johan Andersson April 27, Sweden, dealing with telegraphy equipment, which grows into the worldwide company Ericsson.",
    "Heinrich Schliemann begins excavation at Mycenae.",
    "Stockport Lacrosse Club, thought to be the oldest existing lacrosse club in the world, is founded at Cale Green Cricket Club in Davenport (they still play there in the 21st century).",
    "Star Oil Company, as predecessor of Chevron, an energy product and sales brand worldwide, founded in California, United States.[page needed]"
  ],
  "births": [
    "January 5 – Konrad Adenauer, Chancellor of Germany (d. 1967)[9]",
    "January 8 – Arturs Alberings, Prime Minister of Latvia (d. 1934)",
    "January 12\nErmanno Wolf-Ferrari, Italian composer (d. 1948)\nJack London, American author (d. 1916)",
    "Ermanno Wolf-Ferrari, Italian composer (d. 1948)",
    "Jack London, American author (d. 1916)",
    "January 20 – Józef Hofmann, Polish pianist (d. 1967)",
    "January 22 – Bess Houdini, wife, stage partner of Harry Houdini (d. 1943)",
    "January 23 – Otto Diels, German chemist, Nobel Prize laureate (d. 1954)",
    "January 24 – Theodor Tobler, Swiss chocolatier, founder of Toblerone (d. 1941)",
    "January 29 – Havergal Brian, British composer (d. 1972)",
    "February 8 – Paula Modersohn-Becker, German painter (d. 1907)",
    "February 12 – Thubten Gyatso, 13th Dalai Lama (d. 1933)",
    "February 16\nMack Swain, American actor (d. 1935)\nG. M. Trevelyan, British historian (d. 1962)",
    "Mack Swain, American actor (d. 1935)",
    "G. M. Trevelyan, British historian (d. 1962)",
    "February 19 – Constantin Brâncuși, Romanian sculptor (d. 1957)",
    "February 23 – Senjūrō Hayashi, Japanese general and politician, Prime Minister of Japan (d. 1943)",
    "March 1 – Henri de Baillet-Latour, Belgian International Olympic Committee president (d. 1942)",
    "March 2\nJames A. Gilmore, American businessman and baseball executive (d. 1947)[10]\nPope Pius XII (d. 1958)",
    "James A. Gilmore, American businessman and baseball executive (d. 1947)[10]",
    "Pope Pius XII (d. 1958)",
    "March 4 – Theodore Hardeen, Hungarian magician and stunt performer, founder of the Magician's Guild (d. 1945)",
    "March 7 – Edgar Evans, Welsh naval seaman and polar explorer (d. 1912)",
    "March 11 – Carl Ruggles, American composer (d. 1971)",
    "March 15 – Óscar R. Benavides, 67th and 76th President of Peru (d. 1945)",
    "March 21 – Walter Tewksbury, American athlete (d. 1968)",
    "March 22 – Henry O'Malley, American fish culturist, United States Commissioner of Fisheries (d. 1936)",
    "March 26 – Wilhelm, Prince of Albania, sovereign Prince of Albania (d. 1945)",
    "March 31 – Borisav Stanković, Serbian writer (d. 1927)",
    "April 1\nPeter Strasser, German naval officer, airship commander (d. 1918)\nJames Young Deer, Native American film producer (d. 1946)",
    "Peter Strasser, German naval officer, airship commander (d. 1918)",
    "James Young Deer, Native American film producer (d. 1946)",
    "April 3 – Margaret Anglin, Canadian stage actress (d. 1958)",
    "April 4\nBolesław Roja, Polish general (d. 1940)\nMaurice de Vlaminck, French painter, poet (d. 1958)",
    "Bolesław Roja, Polish general (d. 1940)",
    "Maurice de Vlaminck, French painter, poet (d. 1958)",
    "April 9 – Ettore Bastico, Italian field marshal (d. 1972)",
    "April 11 – Paul Henry, Irish artist (d. 1958)",
    "April 14 – Sir Murray Bisset, South African cricketer, Governor of Southern Rhodesia (d. 1931)",
    "April 22 – Róbert Bárány, Hungarian physician, recipient of the Nobel Prize in Physiology or Medicine (d. 1936)",
    "April 23 – Mary Ellicott Arnold, American social activist, writer (d. 1968)",
    "April 24 – Erich Raeder, German admiral (d. 1960)",
    "April 26 – Mariam Thresia Chiramel, Indian Catholic professed religious and stigmatist (d. 1926)",
    "May 10\nIvan Cankar, Slovenian writer (d. 1918)\nShigeru Honjō, Japanese general (d. 1945)",
    "Ivan Cankar, Slovenian writer (d. 1918)",
    "Shigeru Honjō, Japanese general (d. 1945)",
    "May 18 – Hermann Müller, Chancellor of Germany (d. 1931)",
    "June 4 – Clara Blandick, American actress (d. 1962)",
    "June 13 – William Sealy Gosset, English chemist and statistician (d. 1937)",
    "June 19 – Sir Nigel Gresley, English steam locomotive engineer (Flying Scotsman & Mallard) (d. 1941)",
    "June 22 – Madeleine Vionnet, French fashion designer (d. 1975)",
    "July 2 – Wilhelm Cuno, Chancellor of Germany (d. 1933)",
    "July 6 – Luis Emilio Recabarren, Chilean politician, founder of the Communist Party of Chile. (d. 1924)",
    "July 8 – Alexandros Papanastasiou, 2-time Prime Minister of Greece (d. 1936)",
    "July 12\nMax Jacob, French poet (d. 1944)\nAlphaeus Philemon Cole, American artist, engraver, etcher and supercentenarian (d. 1988)",
    "Max Jacob, French poet (d. 1944)",
    "Alphaeus Philemon Cole, American artist, engraver, etcher and supercentenarian (d. 1988)",
    "July 16 – Alfred Stock, German chemist (d. 1946)",
    "July 19\nIgnaz Seipel, 4th Chancellor of Austria (d. 1932)\nJoseph Fielding Smith, 10th president of The Church of Jesus Christ of Latter-day Saints (d. 1972)",
    "Ignaz Seipel, 4th Chancellor of Austria (d. 1932)",
    "Joseph Fielding Smith, 10th president of The Church of Jesus Christ of Latter-day Saints (d. 1972)",
    "July 29 – Maria Ouspenskaya, Russian actress, acting teacher (d. 1949)",
    "August 7 – Mata Hari, Dutch exotic dancer, spy (d. 1917)",
    "August 15 – Stylianos Gonatas, Prime Minister of Greece (d. 1966)",
    "August 17\nEric Drummond, 16th Earl of Perth, British politician, first Secretary-General of the League of Nations (d. 1951)\nHenri Winkelman, Dutch general (d. 1952)",
    "Eric Drummond, 16th Earl of Perth, British politician, first Secretary-General of the League of Nations (d. 1951)",
    "Henri Winkelman, Dutch general (d. 1952)",
    "August 25 – Eglantyne Jebb, English co-founder of the Save the Children Fund, champion of children's human rights (d. 1928)",
    "September 1 – Harriet Shaw Weaver, English political activist (d. 1961)",
    "September 5 – Wilhelm Ritter von Leeb, German field marshal (d. 1956)",
    "September 6 – John Macleod, Scottish-born physician and physiologist, Nobel Prize laureate (d. 1935)",
    "September 7 – Francesco Buhagiar, 2nd Prime Minister of Malta (d. 1934)",
    "September 13 – Sherwood Anderson, American writer (d. 1941)",
    "September 15 – Bruno Walter, German conductor (d. 1962)",
    "September 16 – Marvin Hart, American boxer (d. 1931)",
    "September 18 – James Scullin, 9th Prime Minister of Australia (d. 1953)",
    "September 22 – André Tardieu, 3-time Prime Minister of France (d. 1945)",
    "September 23 – Brudenell White, Australian general (d. 1940)",
    "September 26 – Edith Abbott, American social worker, educator, and author (d. 1957)",
    "September 29 – Charlie Llewellyn, first non-white South African Test cricketer (d. 1964)",
    "October 7 – Louis Tancred, South African cricketer (d. 1934)",
    "October 9 – Sol Plaatje, South African political activist (d. 1932)",
    "October 13 – Rube Waddell, American baseball player (d. 1914)",
    "October 21 – Sir Fraser Russell, South African-born Governor of Southern Rhodesia (d. 1952)",
    "October 26 – H. B. Warner, English stage, screen actor (d. 1958)",
    "October 29 – Anton Boisen, American founder of the clinical pastoral education movement (d. 1965)",
    "November 2 – Alfred S. Alschuler, American architect (d. 1940)",
    "November 3 – Rupert D'Oyly Carte, English hotelier, theatre owner and impresario (d. 1948)",
    "November 7\nCulbert Olson, Governor of California (d. 1962)\nCharlie Townsend, English cricketer (d. 1958)",
    "Culbert Olson, Governor of California (d. 1962)",
    "Charlie Townsend, English cricketer (d. 1958)",
    "November 17 – August Sander, German photographer (d. 1964)",
    "November 23 – Manuel de Falla, Spanish composer (d. 1946)",
    "November 24 – Walter Burley Griffin, American architect (d. 1937)",
    "December 9 – Berton Churchill, Canadian actor (d. 1940)",
    "December 12 – Alvin Kraenzlein, American athlete (d. 1928)",
    "December 21 – Jack Lang, Australian politician (d. 1975)",
    "December 25\nAdolf Windaus, German chemist, Nobel Prize laureate (d. 1959)\nMuhammad Ali Jinnah, founder, first governor general of Pakistan (d. 1948)",
    "Adolf Windaus, German chemist, Nobel Prize laureate (d. 1959)",
    "Muhammad Ali Jinnah, founder, first governor general of Pakistan (d. 1948)",
    "December 29\nPablo Casals, Catalan cellist (d. 1973)\nLionel Tertis, English violist (d. 1975)",
    "Pablo Casals, Catalan cellist (d. 1973)",
    "Lionel Tertis, English violist (d. 1975)",
    "Petro Trad, 5th President and 14th Prime Minister of Lebanon (d. 1947)",
    "Abd Allah Siraj, Prime Minister of Jordan (d. 1949)",
    "Emile Berliner is credited for the invention of the microphone while working with Alexander Graham Bell.[11]"
  ],
  "deaths": [
    "January 10 – Gordon Granger, American General (b. 1822)\nReverdy Johnson, American politician (b. 1796)",
    "Reverdy Johnson, American politician (b. 1796)",
    "January 15 – Eliza McCardle Johnson, First Lady of the United States (b. 1810)",
    "February 18 – Charlotte Cushman, American actress (b. 1816)",
    "February 24 – Joseph Jenkins Roberts, 2-time President of Liberia (b. 1809)",
    "March 29 – Karl Ferdinand Ranke, German educator (b. 1806)",
    "April 9 – Charles Goodyear, American politician (b. 1804)",
    "May 7 – William Buell Sprague, American clergyman, author (b. 1795)",
    "May 8 – Truganini, Tasmanian language=Aboriginal woman (b. c. 1812)",
    "May 24 – Henry Kingsley, English novelist (b. 1830)",
    "May 26 – František Palacký, Czech historian, politician (b. 1798)",
    "June 1 – Hristo Botev, Bulgarian revolutionary (b. 1848)",
    "June 4 – Abdülaziz, 32nd Sultan of the Ottoman Empire (b. 1830)",
    "June 6 – Auguste Casimir-Perier, French diplomat (b. 1811)",
    "June 7 – Josephine of Leuchtenberg, Queen of Sweden and Norway (b. 1807)",
    "June 8 – George Sand, French writer (b. 1804)",
    "June 20 – John Neal, American writer, critic, and women's rights activist (b. 1793)[12]",
    "June 21 – Antonio López de Santa Anna, 11-time President of Mexico (b. 1794)[13]",
    "June 25 – George Armstrong Custer, U.S. Army general (in battle) (b. 1839)",
    "June 27 – Harriet Martineau, British social theorist, writer (b. 1802)",
    "July 1\nMikhail Bakunin, Russian revolutionary, anarchist (b. 1814)\nWilhelm von Ramming, Austrian general (b. 1815)",
    "Mikhail Bakunin, Russian revolutionary, anarchist (b. 1814)",
    "Wilhelm von Ramming, Austrian general (b. 1815)",
    "August 2 – Wild Bill Hickok, American gunfighter, entertainer (b. 1837)",
    "September 5 – Manuel Blanco Encalada, Spanish-Chilean admiral and politician, 1st President of Chile (b. 1790)",
    "September 27 – Braxton Bragg, American Confederate Civil War general (b. 1817)",
    "October 1 – James Lick, American land baron (b. 1796)",
    "November 16 – Karl Ernst von Baer, Estonian-German scientist, explorer (b. 1792)",
    "November 18 – Narcisse Virgilio Díaz, French painter (b. 1807)",
    "December 29 – Titus Salt, English woollen manufacturer, philanthropist (b. 1803)",
    "December 31 – Catherine Labouré, French visionary, saint (b. 1806)",
    "Anna Volkova, Russian chemist (b. 1800)"
  ]
}