{
  "events": [
    "January 1 – The Specie Resumption Act takes effect. The United States Note is valued the same as gold, for the first time since the American Civil War.",
    "January 11 – The Anglo-Zulu War begins.",
    "January 22 – Anglo-Zulu War – Battle of Isandlwana: A force of 1,200 British soldiers is wiped out by over 20,000 Zulu warriors.  January 22: Battle of Isandlwana",
    "January 23 – Anglo-Zulu War – Battle of Rorke's Drift: Following the previous day's defeat, a smaller British force of 140 successfully repels an attack by 4,000 Zulus.  January 22–23: Battle of Rorke's Drift",
    "February 3 – Mosley Street in Newcastle upon Tyne (England) becomes the world's first public highway to be lit by the electric incandescent light bulb invented by Joseph Swan.[1]",
    "February 8 – At a meeting of the Royal Canadian Institute, engineer and inventor Sandford Fleming first proposes the global adoption of standard time.",
    "March 3 – United States Geological Survey is founded.",
    "March 11 – The Ryukyu Domain is incorporated into the Okinawa Prefecture of Japan and the last ruler, Shō Tai, exiled to Tokyo.",
    "March 28 – Anglo-Zulu War – Battle of Hlobane: British forces suffer a defeat.",
    "March 29 – Anglo-Zulu War – Battle of Kambula: British forces defeat 20,000 Zulus.",
    "April – Postman Ferdinand Cheval begins to build his Palais Idéal at Hauterives in France.",
    "April 5 – War of the Pacific: Chile formally declares war on Bolivia and Peru.[2]",
    "April 12 – Mary Baker Eddy founds the Church of Christ, Scientist in Boston, Massachusetts.",
    "April 26 – The National Park, later renamed the Royal National Park, is declared in New South Wales, Australia, the world's second oldest purposed national park.",
    "May 2 – The Spanish Socialist Workers' Party (Partido Socialista Obrero Español) is founded clandestinely at the Casa Labra tavern in Madrid, by printer Pablo Iglesias.[3]",
    "May 7 – The current constitution of the State of California in the United States is ratified.",
    "May 10 – The Archaeological Institute of America (AIA) is formed.",
    "May 12 – English Catholic convert John Henry Newman is elevated to Cardinal.",
    "May 14 – The first group of 463 Indian indentured labourers arrive in Fiji, aboard the Leonidas.",
    "May 26 – Russia and the United Kingdom sign the Treaty of Gandamak, establishing an Afghan state.",
    "May 30 – New York City's Gilmore's Garden is renamed Madison Square Garden by William Henry Vanderbilt and is opened to the public at 26th Street and Madison Avenue.",
    "June 1 – Anglo-Zulu War: Napoléon, Prince Imperial of France, son of Napoléon III, is killed in Africa while attached to the British Army.[4]",
    "June 4 – Yasukuni Shrine is officially renamed, from Tokyo Shokonsha Shrine in Japan.[5][6]",
    "June 6 – William Denny and Brothers launch the world's first ocean-going steamer to be built of mild steel, the SS Rotomahana, on the River Clyde in Scotland.[7] On October 2 they launch the first transatlantic steamer of the same material, the SS Buenos Ayrean; on December 1 she makes her maiden voyage out of Glasgow, bound for South America.[8]",
    "June 14 – Sidney Faithorn Green, a priest in the Church of England, is tried and convicted for using Ritualist practices.",
    "June 21 – German company Linde is founded by Carl von Linde.",
    "June 30 – The 1879 Surigao earthquake measuring Mw  7.4 causes major damage in the northern tip of Mindanao Island.[9]",
    "July 1 – American Christian Restorationist Charles Taze Russell publishes the first issue of the monthly Zion's Watch Tower and Herald of Christ's Presence which, as The Watchtower, will become the most widely circulated magazine in the world.",
    "July 4 – Anglo-Zulu War – Battle of Ulundi: A British victory effectively ends the war.[10]",
    "July 8 – Led by George W. De Long, the ill-fated United States Jeannette Expedition departs San Francisco, in an attempt to reach the North Pole, by pioneering a route through the Bering Strait.",
    "August 1 – Tokio Marine was founded in Japan, the currently name was Tokio Marine Holdings.[11]",
    "August 16 – Fulham F.C. is founded in London as a church soccer team.",
    "August 21 – Claimed apparition to local people at Knock, County Mayo, Ireland of the Blessed Virgin Mary, Saint Joseph, Saint John the Evangelist and Jesus Christ (as the Lamb of God).",
    "September – Henry George self-publishes his major work Progress and Poverty.[12]",
    "September 8 – A fire in The Octagon, Dunedin (New Zealand) claims 12 victims.",
    "September 19 – The Blackpool Illuminations in England are switched on for the first time.",
    "September 25 – A fire in Deadwood, South Dakota leaves 2,000 people homeless and 300 buildings destroyed; total loss of property is estimated at $3 million.",
    "September 29 – Meeker Massacre: Nathan Meeker and others are killed in an uprising at the White River Ute Indian reservation in Colorado.",
    "October 2 – Qing dynasty China signs the Treaty of Livadia with the Russian Empire on terms so unfavorable to China that its emissary is threatened with execution.",
    "October 7 – The Dual Alliance is formed by Germany and Austria-Hungary.",
    "October 8 – War of the Pacific: Battle of Angamos – The Chilean Navy defeats Peruvian naval forces.",
    "October 13 – The first female students are admitted to study for degrees of the University of Oxford in England, at the new Lady Margaret Hall and Somerville Hall, and with the Society of Oxford Home-Students.[10]",
    "October 17 – Sunderland Association Football Club is formed by a group of schoolteachers in northeast England.",
    "October 22 – Using a filament of carbonized thread, Thomas Edison tests his first practical electric light bulb (it lasts 13½ hours before burning out).",
    "October 28 – The Hall effect is discovered by Edwin Hall at Johns Hopkins University in the United States.",
    "November\nLand is acquired for Simmons College of Kentucky, an historically black school, established as a Baptist institution.\nThe Age of Michael begins, according to French occultist Eliphas Levi and Johannes Trithemius.[13]",
    "Land is acquired for Simmons College of Kentucky, an historically black school, established as a Baptist institution.",
    "The Age of Michael begins, according to French occultist Eliphas Levi and Johannes Trithemius.[13]",
    "November 4 – Thomas Edison applies for a patent for his invention of the incandescent light bulb (U.S. Patent 223,898 will be granted on January 27, 1880).[14]",
    "November 10 – The Bell Telephone Company and Western Union reach an agreement in the United States, in which the former agrees to stay out of telegraphy and the latter to keep out of the telephone business.[15]",
    "December 21 – Henrik Ibsen's controversial drama A Doll's House premières at the Royal Danish Theatre in Copenhagen (having been first published on December 4 in the city).",
    "December 28 – Tay Bridge disaster: The central part of the Tay Rail Bridge at Dundee, Scotland, collapses in a storm as a train passes over it, killing 75.[10]",
    "December 31\nThomas Edison demonstrates incandescent lighting to the public for the first time, in Menlo Park, New Jersey.\nGilbert and Sullivan's comic opera The Pirates of Penzance opens at the Fifth Avenue Theatre in New York City (following a token performance the day before for U.K. copyright reasons in Paignton, Devon).[16]",
    "Thomas Edison demonstrates incandescent lighting to the public for the first time, in Menlo Park, New Jersey.",
    "Gilbert and Sullivan's comic opera The Pirates of Penzance opens at the Fifth Avenue Theatre in New York City (following a token performance the day before for U.K. copyright reasons in Paignton, Devon).[16]",
    "Colonel Ahmed ‘Urabi forms the Egyptian Nationalist Party.",
    "The Stefan–Boltzmann law is discovered by Jozef Stefan.",
    "Wilhelm Wundt establishes the first psychological research laboratory, at the University of Leipzig.",
    "Tetteh Quarshie first brings cocoa beans to Ghana from Equatorial Guinea.",
    "The city of Kotka was founded in Kymenlaakso, Finland by separating its two islands from the old Kymi parish.[17][18]",
    "Gottlob Frege publishes Begriffsschrift, eine der arithmetischen nachgebildete Formelsprache des reinen Denkens in Halle, a significant text in the development of mathematical logic."
  ],
  "births": [
    "January 1 – E. M. Forster, English writer (d. 1970)",
    "January 3 – Grace Coolidge, First Lady of the United States (d. 1957)",
    "January 10 – Bobby Walker, Scottish footballer (d. 1930)",
    "January 12\nRay Harroun, American race car driver (d. 1968)\nCalbraith Perry Rodgers, American pioneer aviator, makes first transcontinental U.S. flight (d. 1912)",
    "Ray Harroun, American race car driver (d. 1968)",
    "Calbraith Perry Rodgers, American pioneer aviator, makes first transcontinental U.S. flight (d. 1912)",
    "January 13 – Melvin Jones, American founder of Lions Clubs International (d. 1961)",
    "January 20 – Ruth St. Denis, American dancer (d. 1968)",
    "January 28\nBetty Kuuskemaa, Estonian actress (d. 1966)\nFrancis Picabia, French painter, poet (d. 1953)",
    "Betty Kuuskemaa, Estonian actress (d. 1966)",
    "Francis Picabia, French painter, poet (d. 1953)",
    "February 6 – Magnús Guðmundsson, 3rd Prime Minister of Iceland (d. 1937)",
    "February 13 – Sarojini Naidu, Indian independence activist and poet (d. 1949)",
    "February 20 – Hod Stuart, Canadian professional ice hockey player (d. 1907)",
    "February 22\nJ. N. Brønsted, Danish chemist (d. 1947)\nNorman Lindsay, Australian painter (d. 1969)",
    "J. N. Brønsted, Danish chemist (d. 1947)",
    "Norman Lindsay, Australian painter (d. 1969)",
    "February 26 – Frank Bridge, English composer (d. 1941)",
    "March 3 – József Klekl, Slovene writer, journalist (d. 1936)",
    "March 6 – William P. Cronan, 19th Naval Governor of Guam (d. 1929)",
    "March 8 – Otto Hahn, German chemist, Nobel Prize laureate (d. 1968)",
    "March 14 – Albert Einstein, German-born physicist, Nobel Prize laureate (d. 1955)",
    "March 18 – Emma Carus, American opera singer (d. 1927)",
    "March 20 – Maud Menten, Canadian biochemist and medical researcher (d. 1960)",
    "March 26 – Othmar Ammann, Swiss-born engineer (d. 1965)",
    "March 27\nSándor Garbai, Prime Minister of Hungary (d. 1947)\nEdward Steichen, Luxembourgeois-born painter, photographer (d. 1973)",
    "Sándor Garbai, Prime Minister of Hungary (d. 1947)",
    "Edward Steichen, Luxembourgeois-born painter, photographer (d. 1973)",
    "March 30 – Coen de Koning, Dutch speed skater (d. 1954)",
    "April 1 – Mary J. L. Black, Canadian librarian and suffragist (d. 1939)",
    "April 9 – Thomas Meighan, American actor (d. 1936)",
    "April 11 – Bernhard Schmidt, German-Estonian optician, inventor (d. 1935)",
    "April 16 – Gala Galaction, Romanian writer (d. 1961)",
    "April 20\nItalo Gariboldi, Italian general (d. 1970)\nRobert Wilson Lynd, Irish essayist, writer (d. 1949)\nPaul Poiret, French couturier (d. 1944)",
    "Italo Gariboldi, Italian general (d. 1970)",
    "Robert Wilson Lynd, Irish essayist, writer (d. 1949)",
    "Paul Poiret, French couturier (d. 1944)",
    "April 21 – Kartini, Indonesian national heroine, women's rights activist (d. 1904)",
    "April 26 – Owen Willans Richardson, British physicist, Nobel Prize laureate (d. 1959)",
    "April 29 – Sir Thomas Beecham, English conductor (d. 1961)",
    "April 30 – Richárd Weisz, Hungarian Olympic champion wrestler (d. 1945)[19]",
    "May 6 – Bedřich Hrozný, Czech orientalist, linguist (d. 1952)",
    "May 10 – James Alexander Allan, Australian poet (d. 1967)",
    "May 11 – Ahmad Nami, Prince of the Ottoman Empire, 5th Prime Minister of Syria and 2nd President of Syria (d. 1962)",
    "May 12\nGeorge Landenberger, United States Navy Captain and the 23rd Governor of American Samoa (d. 1936)\nGeorgia Ann Robinson, community worker, first African-American woman to be appointed a Los Angeles police officer (d. 1961)",
    "George Landenberger, United States Navy Captain and the 23rd Governor of American Samoa (d. 1936)",
    "Georgia Ann Robinson, community worker, first African-American woman to be appointed a Los Angeles police officer (d. 1961)",
    "May 16 – Gustaf Aulén, Bishop of Strängnäs in the Church of Sweden (d. 1977)",
    "May 19\nNancy Astor, Viscountess Astor, American-born British politician, wife of Waldorf Astor, 2nd Viscount Astor (d. 1964)\nWaldorf Astor, 2nd Viscount Astor, British businessman, politician, husband of Nancy Astor, Viscountess Astor (d. 1952)",
    "Nancy Astor, Viscountess Astor, American-born British politician, wife of Waldorf Astor, 2nd Viscount Astor (d. 1964)",
    "Waldorf Astor, 2nd Viscount Astor, British businessman, politician, husband of Nancy Astor, Viscountess Astor (d. 1952)",
    "May 20 – Hans Meerwein, German chemist (d. 1965)",
    "May 22 – Alla Nazimova, Russian-born American stage, film actress (d. 1945)",
    "May 23 – Dezső Lauber, Hungarian sportsman (d. 1966)",
    "May 25\nMax Aitken, Lord Beaverbrook, Canadian-born statesman and newspaper publisher (d. 1964)\nAndrew Kennaway Henderson, New Zealand illustrator, cartoonist and pacifist (d. 1960)",
    "Max Aitken, Lord Beaverbrook, Canadian-born statesman and newspaper publisher (d. 1964)",
    "Andrew Kennaway Henderson, New Zealand illustrator, cartoonist and pacifist (d. 1960)",
    "May 27 – Lucile Watson, Canadian-born film, stage actress (d. 1962)",
    "May 28 – Milutin Milanković, Serbian scientist (d. 1958)",
    "June 3\nRaymond Pearl, American biologist (d. 1940)\nHarry Fischbeck (French Wikipedia), American cinematographer (d.1968)",
    "Raymond Pearl, American biologist (d. 1940)",
    "Harry Fischbeck (French Wikipedia), American cinematographer (d.1968)",
    "June 4 – Mabel Lucie Attwell, British illustrator",
    "June 7\nKnud Rasmussen, Danish polar explorer, anthropologist (d. 1933)\nJoan Voûte, Dutch astronomer (d. 1963)",
    "Knud Rasmussen, Danish polar explorer, anthropologist (d. 1933)",
    "Joan Voûte, Dutch astronomer (d. 1963)",
    "June 10 – Rafael Erich, Prime Minister of Finland (d. 1946)",
    "June 13\nCharalambos Tseroulis, Greek general (d. 1929)\nLois Weber, American film director, screenwriter (d. 1939)",
    "Charalambos Tseroulis, Greek general (d. 1929)",
    "Lois Weber, American film director, screenwriter (d. 1939)",
    "June 23 – Huda Sha'arawi, Egyptian feminist (d. 1947)",
    "July 1\nLéon Jouhaux, French labour leader, recipient of the Nobel Peace Prize (d. 1954)\nNicky Arnstein, American professional gambler and con artist; married to Fanny Brice (d. 1965)",
    "Léon Jouhaux, French labour leader, recipient of the Nobel Peace Prize (d. 1954)",
    "Nicky Arnstein, American professional gambler and con artist; married to Fanny Brice (d. 1965)",
    "July 5 – Wanda Landowska, Polish harpsichordist, musicologist (d. 1959)",
    "July 9\nKaren Platou, Norwegian politician (d. 1950)\nOttorino Respighi, Italian composer, musicologist and conductor (d. 1936)",
    "Karen Platou, Norwegian politician (d. 1950)",
    "Ottorino Respighi, Italian composer, musicologist and conductor (d. 1936)",
    "July 10 – Charles P. Snyder, American admiral (d. 1964)",
    "July 15 – Joseph Campbell, Irish poet, lyricist (d. 1944)",
    "July 20 – Habib Miyan, unverified Indian supercentenarian (d. 2008)",
    "July 22 – Janusz Korczak (pen-name of Henryk Goldszmit), Polish-Jewish children's author, pediatrician and child pedagogist (b. 1878 or 1879) (d. 1942)",
    "July 26 – Shunroku Hata, Japanese field marshal (d. 1962)",
    "July 28 – Lucy Burns, American women's rights campaigner (d. 1966)",
    "August 8\nWesley Newcomb Hohfeld, American jurist (d. 1918)\nHisaichi Terauchi, Japanese field marshal (d. 1946)\nEmiliano Zapata, Mexican revolutionary (d. 1919)",
    "Wesley Newcomb Hohfeld, American jurist (d. 1918)",
    "Hisaichi Terauchi, Japanese field marshal (d. 1946)",
    "Emiliano Zapata, Mexican revolutionary (d. 1919)",
    "August 13 – John Ireland, English composer and organist (d. 1962)",
    "August 15 – Ethel Barrymore, American film and stage actress (d. 1959)",
    "August 21 – Claude Grahame-White, British aviation pioneer (d. 1959)",
    "August 23 – Yevgenia Bosch, Ukrainian politician (d. 1925)",
    "August 28 – Sydney Ayres, American silent film actor (d. 1916)",
    "August 30 – Fritzi Scheff, Viennese-born American actress and singer (d. 1954)",
    "August 31\nIsidro Ayora, 22nd President of Ecuador (d. 1978)\nEmperor Taishō, 123rd Emperor of Japan (d. 1926)",
    "Isidro Ayora, 22nd President of Ecuador (d. 1978)",
    "Emperor Taishō, 123rd Emperor of Japan (d. 1926)",
    "September 6\nMax Schreck, German actor (d. 1936)\nAdolf Strauss, German general (d. 1973)\nJoseph Wirth, Chancellor of Germany (d. 1956)",
    "Max Schreck, German actor (d. 1936)",
    "Adolf Strauss, German general (d. 1973)",
    "Joseph Wirth, Chancellor of Germany (d. 1956)",
    "September 13 – Tsutomu Sakuma, Japanese naval officer (d. 1910)",
    "September 14 – Margaret Sanger, American birth control advocate (d. 1966)[20]",
    "September 15 – Joseph Lyons, 10th Prime Minister of Australia, Premier of Tasmania (d. 1939)",
    "September 20 – Victor Sjöström, Swedish film actor, director (d. 1960)",
    "September 25\nShinobu Ishihara, Japanese ophthalmologist and professor (d. 1963)\nLope K. Santos, Filipino writer and grammarian (d. 1963)",
    "Shinobu Ishihara, Japanese ophthalmologist and professor (d. 1963)",
    "Lope K. Santos, Filipino writer and grammarian (d. 1963)",
    "September 27\nHans Hahn, Austrian mathematician (d. 1934)\nCyril Scott, English composer and writer (d. 1970)",
    "Hans Hahn, Austrian mathematician (d. 1934)",
    "Cyril Scott, English composer and writer (d. 1970)",
    "October 2 – Wallace Stevens, American poet (d. 1955)",
    "October 3 – Warner Oland, Swedish-born actor (d. 1938)",
    "October 5 – Francis Peyton Rous, American pathologist, recipient of the Nobel Prize in Physiology or Medicine (d. 1970)",
    "October 9 – Max von Laue, German physicist, Nobel Prize laureate (d. 1960)",
    "October 15 – Jane Darwell, American actress (d. 1967)",
    "October 18 – Giovanni Marinelli, Italian Fascist political leader (d. 1944)",
    "October 21\nJoseph Canteloube, French composer, singer (d. 1957)\nEugene Ely, American pioneer aviator (d. 1911)",
    "Joseph Canteloube, French composer, singer (d. 1957)",
    "Eugene Ely, American pioneer aviator (d. 1911)",
    "October 25 – Fritz Haarmann, German serial killer (d. 1925)",
    "October 28 – Sydney Jacob, Indian-born British male tennis player (d. 1977)",
    "October 29 – Franz von Papen, German diplomat; served as Chancellor (1932) and as Vice-Chancellor (1933–34; under Adolf Hitler) (d. 1969)",
    "November 1 – Pál Teleki, 2-time Prime Minister of Hungary (d. 1941)",
    "November 4 – Will Rogers, Native American humorist (d. 1935)",
    "November 7 – Leon Trotsky, Russian revolutionary (d. 1940)",
    "November 9 – S. O. Davies, oldest post-war British MP (d. 1972)",
    "November 10\nVachel Lindsay, American poet (d. 1931)\nPatrick Pearse, Irish rebel leader (d. 1916)",
    "Vachel Lindsay, American poet (d. 1931)",
    "Patrick Pearse, Irish rebel leader (d. 1916)",
    "November 15 – Lewis Stone, American stage, film actor, known for playing Judge Hardy (d. 1953)",
    "November 26 – Charles W. Goddard, American playwright, screenwriter (d. 1951)",
    "December 4\nNagai Kafu, Japanese writer (d. 1959)\nRichard Von Albade Gammon, University of Georgia football fullback (d. 1897)",
    "Nagai Kafu, Japanese writer (d. 1959)",
    "Richard Von Albade Gammon, University of Georgia football fullback (d. 1897)",
    "December 5 – Clyde Cessna, American aviator, aircraft designer, manufacturer (d. 1954)",
    "December 10\nJouett Shouse, American politician (d. 1968)\nHanna Grönvall, Swedish politician, trade union worker (d. 1953)\nP. L. Robertson, Canadian inventor (d. 1951)\nE. H. Shepard, English artist, book illustrator (d. 1976)",
    "Jouett Shouse, American politician (d. 1968)",
    "Hanna Grönvall, Swedish politician, trade union worker (d. 1953)",
    "P. L. Robertson, Canadian inventor (d. 1951)",
    "E. H. Shepard, English artist, book illustrator (d. 1976)",
    "December 12 – Laura Hope Crews, American film, stage actress (d. 1942)",
    "December 18 – Paul Klee, Swiss artist (d. 1940)",
    "December 20\nIon G. Duca, 35th Prime Minister of Romania (d. 1933)\nEarle Ovington, American aviator, flew first experimental airmail (d. 1936)",
    "Ion G. Duca, 35th Prime Minister of Romania (d. 1933)",
    "Earle Ovington, American aviator, flew first experimental airmail (d. 1936)",
    "December 25 – Grace George, American stage actress (d. 1961)",
    "December 27\nPrudencia Grifell, Spanish-born Mexican actress (d. 1970)\nSydney Greenstreet, British-born American film, stage actor (d. 1954)",
    "Prudencia Grifell, Spanish-born Mexican actress (d. 1970)",
    "Sydney Greenstreet, British-born American film, stage actor (d. 1954)",
    "December 28 – Billy Mitchell, U.S. general, military aviation pioneer (d. 1936)",
    "December 29 – Florence Mary Taylor, Australia's first female architect (d. 1969)",
    "December 30 – Ramana Maharshi, Indian sage, jivanmukta (d. 1950)",
    "Abdallah Beyhum, 10th Prime Minister of Lebanon (d. 1962)",
    "Ali Muhammad Shibli, Bengali revolutionary (d. unknown)[21]",
    "Etelka Freund, Hungarian pianist (d. 1977)"
  ],
  "deaths": [
    "January 8 – Baldomero Espartero, Spanish general, regent and Prime Minister (b. 1793)",
    "January 24 – Heinrich Geißler, German physicist (b. 1814)",
    "January 26 – John Cadwalader, American jurist and politician (b. 1805)",
    "January 28 – Hugh M'Neile, Irish-born English Anglican priest. (b. 1795)",
    "February 11 – Honoré Daumier, French caricaturist and painter (b. 1808)[22]",
    "February 21 – Sher Ali Khan, ruler of Afghanistan (b. 1825)",
    "February 23 – Albrecht Graf von Roon, Prime Minister of Prussia (b. 1803)",
    "February 28 – Hortense Allart, French writer (b. 1801)[23]",
    "March 1 – Joachim Heer, Swiss politician (b. 1825)",
    "March 2 – John Eberhard Faber, German-born American pencil manufacturer (b. 1822)",
    "March 3 – William Kingdon Clifford, English mathematician and philosopher (b. 1845)",
    "March 10 – Prince Paul of Thurn and Taxis, German prince (b. 1843)",
    "March 22 – Sir John Woodford, British army general and archaeologist (b. 1785)",
    "March 24 – Juan Antonio Pezet, Peruvian general and politician, President of Peru (b. 1809)",
    "March 27\nHércules Florence, Brazilian photographer (b. 1804)\nPrince Waldemar of Prussia (b. 1868)",
    "Hércules Florence, Brazilian photographer (b. 1804)",
    "Prince Waldemar of Prussia (b. 1868)",
    "March 30 – Thomas Couture, French painter and teacher (b. 1815)",
    "April 12 – Richard Taylor, American Confederate general (b. 1826)",
    "April 16 – Bernadette Soubirous, French Roman Catholic saint (b. 1844)",
    "April 23 – Elisabetta Fiorini Mazzanti, Italian botanist (b. 1799)",
    "April 30 – Sarah Josepha Hale, American author (b. 1788)[24]",
    "May 5 – Félix Douay, French general (b. 1816)",
    "May 14\nEpameinondas Deligeorgis, Greek politician, 20th Prime Minister of Greece (b. 1829)\nHenry Sewell, New Zealand politician, 1st Premier of New Zealand (b. 1807)",
    "Epameinondas Deligeorgis, Greek politician, 20th Prime Minister of Greece (b. 1829)",
    "Henry Sewell, New Zealand politician, 1st Premier of New Zealand (b. 1807)",
    "May 15\nGottfried Semper, German architect (b. 1803)[25]\nGeorge Fife Angas, English coachbuilder, businessman and politician, founder of South Australia (b. 1789)[26]",
    "Gottfried Semper, German architect (b. 1803)[25]",
    "George Fife Angas, English coachbuilder, businessman and politician, founder of South Australia (b. 1789)[26]",
    "May 21 – Arturo Prat, Chilean lawyer and navy officer (b. 1848)",
    "June 1 – Napoléon, Prince Imperial, son of French Emperor Napoleon III (b. 1856)[4]",
    "June 3 – Frances Ridley Havergal, English religious poet (b. 1836)[27]",
    "June 7 – William Tilbury Fox, English dermatologist (b. 1836)[28]",
    "June 11 – William, Prince of Orange, heir to Dutch throne (b. 1840)",
    "July 7 – Béla Wenckheim, 8th Prime Minister of Hungary (b. 1811)",
    "July 17 – Maurycy Gottlieb, Polish painter (b. 1856)",
    "July 19 – Louis Favre, French engineer (b. 1826)",
    "August 14 – Ivan Davidovich Lazarev, Russian general (b. 1820)",
    "August 27 – Anđeo Kraljević, Herzegovinian Catholic bishop (b. 1807)",
    "August 30 – John Bell Hood, American Confederate general (b. 1831)",
    "September 9 – John Dennis Phelan, American politician and jurist (b. 1809)",
    "September 17 – Eugène Viollet-le-Duc, French architect (b. 1814)",
    "September 26 – Sir William Rowan, British field marshal (b. 1789)",
    "September 30 – Francis Gillette, American politician (b. 1807)",
    "October 8 – Miguel Grau Seminario, Peruvian admiral (killed in action) (b. 1834)",
    "October 25 – Nachum Kaplan, Lithuanian rabbi (b. 1811)",
    "October 31 – Joseph Hooker, American general (b. 1814)",
    "November 5 – James Clerk Maxwell, Scottish physicist (b. 1831)[29]",
    "November 23 – Louisa Susannah Cheves McCord, American political essayist (b. 1810)[30]",
    "December 2 – Ferdinand Lindheimer, German-born botanist (b. 1801)",
    "December 7 – Jón Sigurðsson, campaigner for Icelandic independence (b. 1811)",
    "December 24 – Anna Bochkoltz, German operatic soprano, voice teacher and composer (b. 1815)",
    "Chō Kōran, Japanese poet, painter (b. 1804)"
  ]
}