{
  "events": [
    "January 1\nThe total solar eclipse of January 1, 1889 is seen over parts of California and Nevada.\nPaiute spiritual leader Wovoka experiences a vision, leading to the start of the Ghost Dance movement in the Dakotas.",
    "The total solar eclipse of January 1, 1889 is seen over parts of California and Nevada.",
    "Paiute spiritual leader Wovoka experiences a vision, leading to the start of the Ghost Dance movement in the Dakotas.",
    "January 4 – An Act to Regulate Appointments in the Marine Hospital Service of the United States is signed by President Grover Cleveland. It establishes a Commissioned Corps of officers, as a predecessor to the modern-day U.S. Public Health Service Commissioned Corps.",
    "January 5 – Preston North End F.C. is declared the winner of the inaugural Football League in England.",
    "January 8 – Herman Hollerith receives a patent for his electric tabulating machine in the United States.",
    "January 15 – The Coca-Cola Company is originally incorporated as the Pemberton Medicine Company in Atlanta, Georgia.",
    "January 22 – Columbia Phonograph is formed in Washington, D.C.",
    "January 30 – Rudolf, Crown Prince of Austria and his mistress Baroness Mary Vetsera commit a double suicide (or a murder-suicide) in the Mayerling hunting lodge.",
    "February 5 – The first issue of Glasgow University Magazine is published in Scotland.",
    "February 15 – The first issue of La Solidaridad is published in Spain.",
    "February 11 – The Meiji Constitution of Japan is adopted; the 1st Diet of Japan convenes in 1890.",
    "February 22 – President Grover Cleveland signs a bill admitting North Dakota, South Dakota, Montana and Washington as U.S. states.",
    "March 4 – Benjamin Harrison is sworn in, as the 23rd President of the United States.",
    "March 9 – Battle of Metemma: Yohannes IV, Emperor of Ethiopia, is killed; Sudanese forces, who have been almost defeated, rally and destroy the Ethiopian army. Yohannes is probably the world's last ruler ever to die in battle; on March 25 Menelik II proclaims himself as his successor.",
    "March 11 – The North Carolina Legislature issues a charter for the creation of Elon College.",
    "March 15 – Samoan crisis: German and American warships keep each other at bay in a standoff in Apia Harbor, ending when a cyclone blows in and sinks them all.",
    "March 22 – English Association football team Sheffield United F.C. is formed at the Adelphi Hotel, Sheffield.",
    "March 23 – Claiming to be the Promised Messiah and Mahdi, Mirza Ghulam Ahmad founds the Ahmadiyya Muslim community in Punjab Province (British India).",
    "March 31 – The Eiffel Tower is inaugurated in Paris (opens May 6). At 300 m (980 ft), its height exceeds the previous tallest structure in the world by 130 m (430 ft). Contemporary critics regard it as aesthetically displeasing.",
    "April 1 – Following a failed attempt at a coup, French defense minister Georges Boulanger is forced to flee the country.",
    "April 10 – The Hammarby Roddförening (later Hammarby IF) sports club is founded in Sweden.",
    "April 22 – At high noon in Oklahoma Territory, thousands rush to claim land in the Land Rush of 1889. Within hours the cities of Oklahoma City and Guthrie are formed, with populations of at least 10,000.",
    "May – 1889–1890 pandemic of influenza first reported in the city of Bukhara in the Central Asian part of the Russian Empire.[1]",
    "May 2 – Menelik II, Emperor of Ethiopia, signs a treaty of amity with Italy, giving Italy control over what will become Eritrea.",
    "May 6 – The Exposition Universelle opens in Paris, with the Eiffel Tower as its entrance arch. The Galerie des machines, at 111 m (364 ft), spans the longest interior space in the world at this time.",
    "May 11 – Wham Paymaster robbery: An attack upon a U.S. Army paymaster and escort in the Arizona Territory results in the theft of over $28,000, and the award of two Medals of Honor.",
    "May 28 – Rubber tire company Michelin is registered by Édouard and André Michelin in Clermont-Ferrand, France.",
    "May 31\nJohnstown Flood: The South Fork Dam collapses in western Pennsylvania, killing more than 2,200 people in and around Johnstown, Pennsylvania.\nThe Naval Defence Act dictates that the fleet strength of the British Royal Navy must be equal to that of at least any two other countries.[2]",
    "Johnstown Flood: The South Fork Dam collapses in western Pennsylvania, killing more than 2,200 people in and around Johnstown, Pennsylvania.",
    "The Naval Defence Act dictates that the fleet strength of the British Royal Navy must be equal to that of at least any two other countries.[2]",
    "June – Vincent van Gogh paints The Starry Night at Saint-Rémy-de-Provence.",
    "June 3 – The first long distance electric power transmission line in the United States is completed, running 14 miles (23 km) between a generator at Willamette Falls and downtown Portland, Oregon.",
    "June 6 – The Great Seattle Fire ravages through the downtown area without any fatalities.",
    "June 12 – The Armagh rail disaster near Armagh in Ireland kills 80 people.",
    "June 19 – A Neapolitan baker named Raffaele Esposito invents the Pizza Margherita, named after the queen consort of Italy Margherita of Savoy. This is the forerunner of the modern pizza.",
    "June 26 – Bangui is founded in the French Congo.",
    "June 28 – The annular solar eclipse of June 28, 1889 is visible in Atlantic Ocean, Africa and Indian Ocean, and is the 47th solar eclipse of Solar Saros 125.",
    "June 29–30 – First Inter-Parliamentary Conference held.",
    "July 8\nThe first issue of The Wall Street Journal is published in New York City.\nThe last official bare-knuckle boxing title fight is held (under London Prize Ring Rules): Heavyweight Champion John L. Sullivan, the Boston Strong Boy, defeats Jake Kilrain in a world championship bout, lasting 75 rounds, in Mississippi.",
    "The first issue of The Wall Street Journal is published in New York City.",
    "The last official bare-knuckle boxing title fight is held (under London Prize Ring Rules): Heavyweight Champion John L. Sullivan, the Boston Strong Boy, defeats Jake Kilrain in a world championship bout, lasting 75 rounds, in Mississippi.",
    "July 14 – International Workers Congresses of Paris open, and establish the Second International.",
    "July 15 – The Emperor of Brazil, Pedro II, survives an assassination attempt in Rio de Janeiro.",
    "July 31 – Louise, Princess Royal of the United Kingdom, marries Alexander Duff, 1st Duke of Fife.",
    "August 3 – Mahdist War: Battle of Toski – Egyptian and British troops are victorious.",
    "August 4 –  The Great Fire of Spokane, Washington destroys some 32 blocks of the city, prompting a mass rebuilding project.",
    "August 6 – The Savoy Hotel in London opens.[3]",
    "August 10 – At the Vienna Hofburg, the grand opening ceremony is held for the Imperial Natural History Museum (German: K.k. Naturhistorisches Hofmuseum), begun in 1871; from August 13 to the end of December, the museum counts 175,000 visitors.",
    "August 14–September 15 – London Dock Strike: Dockers strike for a minimum wage of sixpence an hour (The dockers' tanner), which they eventually receive (a landmark in the development of New Unionism in Britain).[4]",
    "August 26 – The Prevention of Cruelty to, and Protection of, Children Act, commonly known as the Children's Charter, is passed in the United Kingdom; for the first time it imposes criminal penalties to deter child abuse.[5]",
    "August 30 – The Royal Mail Mount Pleasant Sorting Office officially opens in London.",
    "August – The Jewish settlement of Moisés Ville is founded in Argentina.",
    "September 10 – Albert Honoré Charles Grimaldi becomes Albert I, Prince of Monaco.",
    "September 17 – Civil War veteran Charles Jefferson Wright founds New York Military Academy, with 75 students on 30 acres (120,000 m2) of land in Cornwall, New York.",
    "September 23 – The Nintendo Koppai (Later Nintendo Company, Limited) is founded in Japan by Fusajiro Yamauchi, to produce and market Hanafuda playing cards.",
    "October 2 – In Washington, D.C., the first International Conference of American States begins.",
    "October 6\nMount Kilimanjaro's summit is first reached, by German geologist Hans Meyer with Austrian mountaineer Ludwig Purtscheller.\nThe Moulin Rouge cabaret opens in Paris.",
    "Mount Kilimanjaro's summit is first reached, by German geologist Hans Meyer with Austrian mountaineer Ludwig Purtscheller.",
    "The Moulin Rouge cabaret opens in Paris.",
    "October 12 – Gustaf Åkerhielm, previously Swedish Foreign Minister, replaces Gillis Bildt as Prime Minister of Sweden.",
    "October 24 – Sir Henry Parkes, Premier of New South Wales, delivers the Tenterfield Oration, calling for the Federation of Australia.",
    "October 29 – The British South Africa Company receives a Royal Charter.[2]",
    "November – The first free elections are held in Costa Rica.",
    "November 2\nNorth Dakota and South Dakota are admitted as the 39th and 40th U.S. states, respectively.\nEnglish Association football team Wimbledon F.C. plays their first match.[6]",
    "North Dakota and South Dakota are admitted as the 39th and 40th U.S. states, respectively.",
    "English Association football team Wimbledon F.C. plays their first match.[6]",
    "November 8 – Montana is admitted as the 41st U.S. state.",
    "November 11 – Washington is admitted as the 42nd U.S. state.",
    "November 14 – Inspired by Jules Verne, pioneer American woman journalist Nellie Bly (Elizabeth Cochrane) begins an attempt to beat travel around the world in less than 80 days (Bly finishes the journey in 72 days, 6 hours and 11 minutes).",
    "November 15 – Field Marshal Deodoro da Fonseca organizes a military coup, which deposes Emperor Pedro II of Brazil and abolishes the Brazilian monarchy. Deodoro da Fonseca proclaims Brazil a republic, and forms a provisional government.",
    "November 17 – The Brazilian Imperial Family is forced into exile in France.",
    "November 19 – The modern-day flag of Brazil is adopted by the Provisional Government of the Republic.",
    "November 20\nArgentina is the first country to recognize the abolition of the monarchy in Brazil.\nGustav Mahler premieres his Symphony No. 1, in Budapest.",
    "Argentina is the first country to recognize the abolition of the monarchy in Brazil.",
    "Gustav Mahler premieres his Symphony No. 1, in Budapest.",
    "November 23 – The first jukebox goes into operation, at the Palais Royale Saloon in San Francisco.",
    "November 27 – Clemson University is founded in Clemson, South Carolina.",
    "December 1 – The 1889–1890 pandemic of influenza first peaks, in Saint Petersburg, Russia.",
    "December 4 – The Bayswater Railway Station (Victoria, Australia) officially opens.",
    "December 14 – Wofford and Furman play the first intercollegiate football game, in the state of South Carolina.",
    "December 23 – The Spanish football team Recreativo de Huelva is formed (the oldest club in Spain by the 21st century).",
    "December 28 – The first interurban tram-train to emerge in the United States is the Newark and Granville Street Railway in Ohio.[7]",
    "Yellow fever interrupts the building of the Panama Canal.",
    "A huge locust swarm crosses the Red Sea and destroys crops in the Nile Valley.",
    "Frederick Abel invents cordite.",
    "An early method of high-voltage direct current (HVDC) transmission, as developed by the Swiss engineer René Thury,[8] is implemented commercially in Italy by the Acquedotto de Ferrari-Galliera Company. This system transmits 630 kW at 14 kV DC over a distance of 120 km (75 mi).[9][10]",
    "The Capilano Suspension Bridge (the longest suspension foot-bridge in the world) is opened in British Columbia.",
    "Schools founded include:\nPlattsburgh Normal School (Plattsburgh, New York)\nRiverside Elementary School (Wichita, Kansas)\nBattle Ground Academy  Franklin, Tennessee.",
    "Plattsburgh Normal School (Plattsburgh, New York)",
    "Riverside Elementary School (Wichita, Kansas)",
    "Battle Ground Academy  Franklin, Tennessee.",
    "Samuel Marinus Zwemer co-founds the American Arabian Mission.[11]",
    "The Indian Religious Code is created, which forbids Native Americans to practice their religions.[citation needed]",
    "The first West Virginia tornado is recorded.",
    "Brook trout introduced into the upper Firehole River, Yellowstone National Park.",
    "The Wisden Cricketers' Almanack publishes its first Wisden Cricketers of the Year (actually titled Six Great Bowlers Of The Year). The cricketers chosen are George Lohmann, Bobby Peel, Johnny Briggs, Charles Turner, John Ferris and Sammy Woods."
  ],
  "births": [
    "January 2 – Walter Baldwin, American actor (d. 1977)",
    "January 12 – Mirza Basheer-ud-Din Mahmood Ahmad, 2nd Caliph of Ahmadiyya Muslim Community in Islam (d. 1965)",
    "January 21 – Edith Bratt, English wife of J. R. R. Tolkien (d. 1971)",
    "January 26 – Jeanne de Salzmann, Russian pupil of G. I. Gurdjieff (d. 1990)",
    "January 31 – Frank Foster, English cricketer (d. 1958)",
    "February 2 – Jean de Lattre de Tassigny, French general, posthumous Marshal of France (d. 1952)",
    "February 3 – Risto Ryti, Prime Minister and President of Finland (d. 1956)",
    "February 5 – Ernest Tyldesley, English cricketer (d. 1962)",
    "February 7 – Harry Nyquist, Swedish-American contributor to information theory (d. 1976)",
    "February 11 – John H. Mills, Sr., African-American singer, one of the Mills Brothers (d. 1967)",
    "February 12 – Edward Hanson, 28th Governor of American Samoa (d. 1959)",
    "February 16 – Hawthorne C. Gray, record-setting American balloonist (d. 1927)",
    "February 19 – Ernest Marsden, British physicist (d. 1970)",
    "February 21 – Pieter Voltelyn Graham van der Byl, South African politician (d. 1975)",
    "February 22\nLady Olave Baden-Powell, English founder of the Girl Guides (d. 1977)\nR. G. Collingwood, British philosopher, historian (d. 1943)",
    "Lady Olave Baden-Powell, English founder of the Girl Guides (d. 1977)",
    "R. G. Collingwood, British philosopher, historian (d. 1943)",
    "February 23 – Victor Fleming, American motion picture director (d. 1949)",
    "February 24 – Suzanne Bianchetti, French actress (d. 1936)",
    "February 25 – Homer S. Ferguson, American politician (d. 1982)",
    "March 1\nKanoko Okamoto, Japanese novelist, poet and Buddhist scholar (d. 1939)\nWatsuji Tetsuro, Japanese philosopher (d. 1960)",
    "Kanoko Okamoto, Japanese novelist, poet and Buddhist scholar (d. 1939)",
    "Watsuji Tetsuro, Japanese philosopher (d. 1960)",
    "March 4\nOren E. Long, American politician, 10th Governor of Hawai'i (d. 1965)\nPearl White, American silent film actress (d. 1938)",
    "Oren E. Long, American politician, 10th Governor of Hawai'i (d. 1965)",
    "Pearl White, American silent film actress (d. 1938)",
    "March 6 – William D. Francis, Australian botanist (d. 1959)",
    "March 7 – Godfrey Chevalier, American naval aviation pioneer (d. 1922)",
    "March 15 – Hiroaki Abe, Japanese admiral (d. 1949)",
    "March 16 – Reggie Walker, South African athlete (d. 1951)",
    "March 21 – Aleksandr Vertinsky, Russian singer, actor (d. 1957)",
    "March 24 – Albert Hill, British athlete (d. 1969)",
    "March 29 – Warner Baxter, American actor (d. 1951)",
    "March 30 – Herman Bing, German-American character, voice actor (d. 1947)",
    "March 31 – Muriel Hazel Wright, Oklahoma author, historian (d. 1975)",
    "April 4\nHans-Jürgen von Arnim, German general (d. 1962)\nAngelo Iachino, Italian admiral (d. 1976)",
    "Hans-Jürgen von Arnim, German general (d. 1962)",
    "Angelo Iachino, Italian admiral (d. 1976)",
    "April 7 – Gabriela Mistral, Chilean writer, Nobel Prize laureate (d. 1957)[12]",
    "April 8\nAdrian Boult, English conductor (d. 1983)\nTomoshige Samejima, Japanese admiral (d. 1966)",
    "Adrian Boult, English conductor (d. 1983)",
    "Tomoshige Samejima, Japanese admiral (d. 1966)",
    "April 11\nNick LaRocca, American musician (d. 1961)\nAketo Nakamura, Japanese general (d. 1966)",
    "Nick LaRocca, American musician (d. 1961)",
    "Aketo Nakamura, Japanese general (d. 1966)",
    "April 14\nJames Stephenson, British actor (d. 1941)\nArnold J. Toynbee, British historian (d. 1975)",
    "James Stephenson, British actor (d. 1941)",
    "Arnold J. Toynbee, British historian (d. 1975)",
    "April 15\nThomas Hart Benton, American painter (d. 1975)\nA. Philip Randolph, African-American civil rights activist (d. 1979)",
    "Thomas Hart Benton, American painter (d. 1975)",
    "A. Philip Randolph, African-American civil rights activist (d. 1979)",
    "April 16 – Charlie Chaplin, English actor, film director (d. 1977)",
    "April 18 – Harold Saxton Burr, American scientist (d. 1973)",
    "April 20 – Adolf Hitler, Austrian-born dictator of Nazi Germany (d. 1945)",
    "April 21\nPaul Karrer, Swiss chemist, Nobel Prize laureate (d. 1971)\nManuel Prado Ugarteche, President of Peru (d. 1967)",
    "Paul Karrer, Swiss chemist, Nobel Prize laureate (d. 1971)",
    "Manuel Prado Ugarteche, President of Peru (d. 1967)",
    "April 23 – Karel Doorman, Dutch admiral (d. 1942)",
    "April 26 – Ludwig Wittgenstein, Austrian-born philosopher (d. 1951)",
    "April 28\nTakeo Kurita, Japanese admiral (d. 1977)\nAntónio de Oliveira Salazar, Portuguese dictator (d. 1970)",
    "Takeo Kurita, Japanese admiral (d. 1977)",
    "António de Oliveira Salazar, Portuguese dictator (d. 1970)",
    "April 30 – Fritz Pfeffer, German-Dutch housemate of Anne Frank (d. 1944)",
    "May 3\nBeulah Bondi, American actress (d. 1981)\nGottfried Fuchs, German-Canadian Olympic soccer player (d. 1972)",
    "Beulah Bondi, American actress (d. 1981)",
    "Gottfried Fuchs, German-Canadian Olympic soccer player (d. 1972)",
    "May 9 – Constantin S. Constantin, Romanian general (d. 1948)",
    "May 12\nOtto Frank, German publisher, businessman, father of Anne Frank (d. 1980)\nAbelardo L. Rodríguez, Mexican professional baseball player, general and substitute President of Mexico, 1932-1934 (d. 1967)[13]\nOuyang Yuqian, Chinese playwright, director and Peking opera performer (d. 1962)",
    "Otto Frank, German publisher, businessman, father of Anne Frank (d. 1980)",
    "Abelardo L. Rodríguez, Mexican professional baseball player, general and substitute President of Mexico, 1932-1934 (d. 1967)[13]",
    "Ouyang Yuqian, Chinese playwright, director and Peking opera performer (d. 1962)",
    "May 18 – Thomas Midgley, Jr., American chemist, inventor (d. 1944)",
    "May 21 – Bernard Rawlings, British admiral (d. 1962)",
    "May 23 – Carlo Braga, Filipino Roman Catholic priest, archbishop and servant of God (d. 1971)",
    "May 25\nGünther Lütjens, German admiral (d. 1941)\nIgor Sikorsky, Russian developer of the helicopter (d. 1972)",
    "Günther Lütjens, German admiral (d. 1941)",
    "Igor Sikorsky, Russian developer of the helicopter (d. 1972)",
    "May 31 – Charles Gordon Bell, British pilot (d. 1918)",
    "June 2\nMargaret Theadora Allan BEM, Australian community worker and organizing secretary for the Traveller' Aid Society of New South Wales (d. 1968)\nMartha Wentworth, American actress (d. 1974)",
    "Margaret Theadora Allan BEM, Australian community worker and organizing secretary for the Traveller' Aid Society of New South Wales (d. 1968)",
    "Martha Wentworth, American actress (d. 1974)",
    "June 4\nHenry F. Phillips, American businessman, inventor (d. 1958)\nBeno Gutenberg, German-American seismologist (d. 1960)",
    "Henry F. Phillips, American businessman, inventor (d. 1958)",
    "Beno Gutenberg, German-American seismologist (d. 1960)",
    "June 10 – Sessue Hayakawa, Japanese actor, film director (d. 1973)",
    "June 13\nAmadeo Bordiga, Italian Marxist theorist, politician (d. 1970)\nAdolphe Pégoud, French acrobatic pilot, World War I fighter ace (d. 1915)",
    "Amadeo Bordiga, Italian Marxist theorist, politician (d. 1970)",
    "Adolphe Pégoud, French acrobatic pilot, World War I fighter ace (d. 1915)",
    "June 21 – Ralph Craig, American athlete (d. 1972)",
    "June 23 – Anna Akhmatova, Russian poet (d. 1966)[14]",
    "June 25 – John Morton-Finney, American civil rights activist, lawyer and educator (d. 1998)",
    "June 27 – Moroni Olsen, American actor (d. 1954)",
    "June 28 – Frank Mayo, American actor (d. 1963)",
    "July 3 – Richard Cramer, American actor (d. 1960)",
    "July 5 – Jean Cocteau, French writer (d. 1963)[15]",
    "July 6 – Takeo Itō, Japanese general (d. 1965)",
    "July 7 – Shiro Kawase, Japanese admiral (d. 1946)",
    "July 8 – Eugene Pallette, American actor (d. 1954)",
    "July 13 – Emma Asson, Estonian politician (d. 1965)",
    "July 14 – Ante Pavelić, Croatian fascist dictator (d. 1959)",
    "July 15 – Marjorie Rambeau, American actress (d. 1970)",
    "July 17 – Erle Stanley Gardner, American author (d. 1970)[16]",
    "July 18 – Kōichi Kido, Japanese politician (d. 1977)",
    "July 19 – William Andrew Paton, American accountancy scholar (d. 1991)",
    "July 22 – Tony Jannus, American aviator, aircraft designer (d. 1916)",
    "July 24 – Murray Kinnell, English actor (d. 1954)",
    "July 30 – Dr. Rajeshwar Bali, Indian intellectual reformist (d. 1945)",
    "August 5 – Conrad Aiken, American writer (d. 1973)[17]",
    "August 6 – George Kenney, World War II United States Army Air Forces general (d. 1977)",
    "August 10 – Norman Scott, American admiral, Medal of Honor recipient (d. 1942)",
    "August 11 – William Ronald Dodds Fairbairn Scottish psychiatrist, psychoanalyst and a central figure in the development of the object relations theory of psychoanalysis (d. 1942)",
    "August 15 – Marthe Richard, French prostitute, spy and politician (d. 1982)",
    "August 21 – Sir Richard O'Connor, British general in World War II (d. 1981)",
    "August 25 – Ioan Dumitrache, Romanian general (d. 1977)",
    "August 29\nJoseph Egger, Austrian character actor (d. 1966)\nAlfredo Obviar, Filipino Roman Catholic bishop and Servant of God (d. 1978)",
    "Joseph Egger, Austrian character actor (d. 1966)",
    "Alfredo Obviar, Filipino Roman Catholic bishop and Servant of God (d. 1978)",
    "September 2 – George H. Plympton, American screenwriter (d. 1972)",
    "September 7 – Albert Plesman, Dutch aviation pioneer (d. 1953)",
    "September 8 – Robert A. Taft, U.S. Senator from Ohio (d. 1953)",
    "September 11 – Suzanne Duchamp, French painter (d. 1963)",
    "September 12 – Ugo Pasquale Mifsud, 3rd Prime Minister of Malta (d. 1942)",
    "September 13 – Masao Maruyama, Japanese general (d. 1957)",
    "September 14 – María Capovilla, Ecuadorian supercentenarian, the last surviving person verified as born in 1889 (d. 2006)",
    "September 18 – Doris Blackburn, Australian politician (d. 1970)",
    "September 20 – Charles Reidpath, American athlete (d. 1975)",
    "September 26 – Martin Heidegger, German philosopher (d. 1976)[18]",
    "October 1 – Charles Hurlbut \"Dutch\" Sterrett, American professional baseball player (d. 1965)",
    "October 2 – Margaret Chung, Chinese-American physician (d. 1959)",
    "October 3 – Carl von Ossietzky, German pacifist, recipient of the Nobel Peace Prize (d. 1938)",
    "October 8 – C. E. Woolman, American airline executive (d. 1966)",
    "October 10\nKermit Roosevelt, American explorer, author (d. 1943)\nHan van Meegeren, Dutch painter, art forger (d.1947)",
    "Kermit Roosevelt, American explorer, author (d. 1943)",
    "Han van Meegeren, Dutch painter, art forger (d.1947)",
    "October 12 – Troy H. Middleton, American general, educator (d. 1976)",
    "October 13\nDouglass Dumbrille, Canadian-born actor (d. 1974)\nCedric Holland, British admiral (d. 1950)",
    "Douglass Dumbrille, Canadian-born actor (d. 1974)",
    "Cedric Holland, British admiral (d. 1950)",
    "November 1 – Philip Noel-Baker, Baron Noel-Baker, Canadian-born peace activist, recipient of the Nobel Peace Prize (d. 1982)",
    "November 5 – Petre Cameniță, Romanian general (d. 1962)",
    "November 10 – Claude Rains, English-born American actor (d. 1967)",
    "November 12 – DeWitt Wallace, American magazine publisher (Reader's Digest) (d. 1981)",
    "November 14\nTaha Hussein, Egyptian writer and intellectual (d. 1973)[19]\nJawaharlal Nehru, 1st Prime Minister of India (d. 1964)",
    "Taha Hussein, Egyptian writer and intellectual (d. 1973)[19]",
    "Jawaharlal Nehru, 1st Prime Minister of India (d. 1964)",
    "November 15 – King Manuel II of Portugal (d. 1932)",
    "November 16 – George S. Kaufman, American playwright (d. 1961)",
    "November 18 – Zoltán Tildy, President of Hungary (d. 1961)",
    "November 19\nCorneliu Calotescu, Romanian general (d. 1970)\nClifton Webb, American actor, dancer and singer (d. 1966)",
    "Corneliu Calotescu, Romanian general (d. 1970)",
    "Clifton Webb, American actor, dancer and singer (d. 1966)",
    "November 20 – Edwin Hubble, American astronomer (d. 1953)",
    "November 23\nHarry Sunderland, Australian rugby league administrator (d. 1964)\nAlexander Patch, American general (d. 1945)",
    "Harry Sunderland, Australian rugby league administrator (d. 1964)",
    "Alexander Patch, American general (d. 1945)",
    "November 25 – George McMillin, American admiral, last Naval Governor of Guam (d. 1983)",
    "November 30\nEdgar Adrian, English physiologist, Nobel Prize laureate (d. 1977)\nReuvein Margolies, Austro-Hungarian-born Israeli author and Talmudic scholar (d. 1971)\nShōji Nishimura, Japanese admiral (d. 1944)",
    "Edgar Adrian, English physiologist, Nobel Prize laureate (d. 1977)",
    "Reuvein Margolies, Austro-Hungarian-born Israeli author and Talmudic scholar (d. 1971)",
    "Shōji Nishimura, Japanese admiral (d. 1944)",
    "December 1 – Vasily Blyukher, Soviet general, Marshal of the Soviet Union (d. 1938)",
    "December 2 – Oei Hui-lan (Madame Wellington Koo), Chinese-Indonesian socialite and First Lady of the Republic of China (d. 1992)",
    "December 3 – Walton Walker, American general (d. 1950)",
    "December 4 – Isabel Randolph, American actress (d. 1973)",
    "December 9\nHannes Kolehmainen, Finnish Olympic athletic (d. 1966)\nShigeyoshi Inoue, Japanese admiral (d. 1975)",
    "Hannes Kolehmainen, Finnish Olympic athletic (d. 1966)",
    "Shigeyoshi Inoue, Japanese admiral (d. 1975)",
    "December 11\nWalter Knott, American farmer, creator of Knott's Berry Farm (d. 1981)\nRobert Maestri, 53rd Mayor of New Orleans (d. 1974)",
    "Walter Knott, American farmer, creator of Knott's Berry Farm (d. 1981)",
    "Robert Maestri, 53rd Mayor of New Orleans (d. 1974)",
    "December 18 – Juho Heiskanen, Finnish general (d. 1950)",
    "December 23 – Daniel E. Barbey, American admiral (d. 1969)",
    "December 30 – Adolfo Ruiz Cortines, Mexican politician and president (1952-1958) who granted women the right to vote. (d. 1973)[20]",
    "Nezihe Muhiddin, Turkish women's rights activist, suffragette, journalist, writer and political leader (d. 1958)",
    "Reşit Süreyya Gürsey, Turkish intellectual, MD and physicist  (d.1962)",
    "Nellie Yu Roung Ling, Chinese dancer, former lady-in-waiting in Qing imperial court"
  ],
  "deaths": [
    "January 13 – Solomon Bundy, American politician (b. 1823)",
    "January 22 – Carlo Pellegrini, Italian caricaturist (b. 1839)",
    "January 30\nRudolf, Crown Prince of Austria (suicide) (b. 1858)\nBaroness Mary Vetsera (suicide) (b. 1871)",
    "Rudolf, Crown Prince of Austria (suicide) (b. 1858)",
    "Baroness Mary Vetsera (suicide) (b. 1871)",
    "February 3 – Belle Starr, American outlaw (b. 1848)",
    "February 13 – João Maurício Vanderlei, Brazilian magistrate and politician (b. 1815)",
    "March 5 – Mary Louise Booth, American editor-in-chief of Harper's Bazaar  (b. 1831)",
    "March 8 – John Ericsson, Swedish inventor, engineer (b. 1803)",
    "March 9 – Emperor Yohannes IV of Ethiopia (b. 1837)",
    "March 13 – Felice Varesi, French-born Italian baritone (b. 1813)",
    "March 22 – Stanley Matthews, American jurist and politician (b. 1824)",
    "March 24 – The Leatherman, possibly French-Canadian vagabond in the U.S. (b. c. 1839)",
    "April 6 – Princess Augusta of Hesse-Kassel (b. 1797)",
    "April 7 – Youssef Bey Karam,[21] Lebanese nationalist leader (b. 1823)",
    "April 12 – Robert Dunsmuir, Scottish-born Canadian industrialist and politician (b. 1825)",
    "April 15 – Father Damien, Belgian Roman Catholic priest, missionary to Hawaiians with leprosy and saint (b. 1840)",
    "April 21 – Sebastián Lerdo de Tejada, Mexican jurist, 27th President of Mexico (b. 1823)[22]",
    "April 25 – Mary Dominus, American settler of Hawaii  (b. 1803)",
    "May 9 – William S. Harney, U.S. Army general (b. 1800)",
    "May 10 – Mikhail Saltykov-Shchedrin, Russian satirist (b. 1826)",
    "May 14 – Volney E. Howard, American politician (b. 1809)",
    "May 28 – Madeleine Vinton Dahlgren, American translator and anti-suffragist (b. 1825)",
    "June 8 – Gerard Manley Hopkins, English poet (b. 1844)[23]",
    "June 10 – Abraham Hochmuth, Hungarian rabbi (b. 1816)",
    "June 15 – Mihai Eminescu, Romanian poet (b. 1850)",
    "June 25 – Lucy Webb Hayes, First Lady of the United States (b. 1831)",
    "July 7 – Giovanni Bottesini, Italian conductor, composer and virtuoso double bass player (b. 1821)[24]",
    "July 10 – Julia Gardiner Tyler, First Lady of the United States (b. 1820)",
    "August 2 – Eduardo Gutiérrez, Argentinian author (b. 1851)",
    "August 19 – Auguste Villiers de l'Isle-Adam, French writer (b. 1838)[25]",
    "September 23 – Wilkie Collins, British novelist (b. 1824)[26]",
    "September 24 – Charles Leroux, American balloonist, parachutist (b. 1856)",
    "September 29 – Louis Faidherbe, French general and colonial administrator (b. 1818)",
    "October 10 – Adolf von Henselt, German pianist and composer (b. 1814)[27]",
    "October 11 – James Prescott Joule, English physicist (b. 1818)",
    "October 17 – Rodrigo Augusto da Silva, Brazilian Senator, author of the Golden Law (b. 1833)\nJohn F. Hartranft, Union Army military officer and Medal of Honour recipient (b. 1830)",
    "John F. Hartranft, Union Army military officer and Medal of Honour recipient (b. 1830)",
    "October 19 – King Luís I of Portugal (b. 1838)",
    "October 25 – Émile Augier, French dramatist (b. 1820)[28]",
    "November 16 – Sergei Bobokhov, Russian revolutionary, who committed suicide as a protest against the flogging of woman comrade in Siberia. (b. 1858)",
    "November 18 – William Allingham, Irish author (b. 1824)",
    "November 20 – August Ahlqvist, Finnish professor, poet, scholar of the Finno-Ugric languages, author, and literary critic (b. 1826)[29]",
    "November 24 – George H. Pendleton, American politician (b. 1825)",
    "December 6 – Jefferson Davis, President of the Confederate States of America (b. 1808)[30]",
    "December 12 – Robert Browning, English poet (b. 1812)",
    "December 28 – Teresa Cristina of the Two Sicilies, Empress consort of Brazil (b. 1822)",
    "December 29\nGlele, King of Dahomey (suicide)\nPriscilla Cooper Tyler, de facto First Lady of the United States (b. 1816)",
    "Glele, King of Dahomey (suicide)",
    "Priscilla Cooper Tyler, de facto First Lady of the United States (b. 1816)",
    "December 30 –  Sir Henry Yule, Scottish orientalist (b. 1820)",
    "December 31 – Ion Creangă, Romanian writer (b. 1837 or 1839)"
  ]
}