{
  "events": [
    "January 2 – The Jameson Raid comes to an end, as Jameson surrenders to the Boers.[1]",
    "January 4 – Utah is admitted as the 45th U.S. state.",
    "January 5 – An Austrian newspaper reports that Wilhelm Röntgen has discovered a type of radiation (later known as X-rays).",
    "January 6 – Cecil Rhodes is forced to resign as Prime Minister of the Cape of Good Hope, for his involvement in the Jameson Raid.",
    "January 7 – American culinary expert Fannie Farmer publishes her first cookbook.",
    "January 12 – H. L. Smith takes the first X-ray photograph.",
    "January 17 – Fourth Anglo-Ashanti War: British redcoats enter the Ashanti capital, Kumasi, and Asantehene Agyeman Prempeh I is deposed.[2][3]",
    "January 18 – The X-ray machine is exhibited for the first time.",
    "January 28 – Walter Arnold, of East Peckham, Kent, England, is fined 1 shilling for speeding at 8 mph (13 km/h) (exceeding the contemporary speed limit of 2 mph (3.2 km/h), the first speeding fine).",
    "February 1 – Puccini's opera La bohème premieres in Turin, Italy.",
    "February 11 – Oscar Wilde's play Salomé premieres in Paris.",
    "February 19 – Braamfontein Explosion: A train carrying 56 tons of dynamite explodes at Braamfontein, Johannesburg, killing more than 78 people.[4]",
    "March 1 – Battle of Adwa: Ethiopia defends its independence from Italy, ending the First Italo-Ethiopian War.",
    "March 3 – Publication begins for Der Eigene, the world's first magazine with an orientation to male homosexuality, by Adolf Brand in Berlin.",
    "March 9 – Responding to national outrage at the defeat at Adwa, Italian Prime Minister Francesco Crispi resigns.",
    "March 23 – The New York State Legislature passes the Raines law, restricting Sunday alcoholic beverage sales to hotels.",
    "April – The first study of the sensitivity of global climate to atmospheric carbon dioxide is published. Svante Arrhenius presents his findings in his paper, \"On the Influence of Carbonic Acid in the Air upon the Temperature of the Ground\", the London, Edinburgh, and Dublin Philosophical Magazine and Journal of Science, as an extract of a paper that had been presented to the Royal Swedish Academy of Sciences on December 11, 1895.",
    "April 3 – The first edition of the Italian sports newspaper La Gazzetta dello Sport is published.",
    "April 4 – The first known women's basketball game between two colleges is played between Stanford and California.",
    "April 6 – The opening ceremonies of the 1896 Summer Olympics, the first modern Olympic Games, are held in Athens, Greece.",
    "April 9 – The National Farm School (later Delaware Valley College) is chartered in Doylestown, Pennsylvania.",
    "May 8 – Cricket: Against Warwickshire, Yorkshire sets a still-standing County Championship record, when they accumulate an innings total of 887.",
    "May 13 – The Franchise Bill is passed by the Colony of Natal's Legislative Assembly, disfranchising natives of other countries.",
    "May 18 – Plessy v. Ferguson: The U.S. Supreme Court introduces the separate but equal doctrine, and upholds racial segregation.",
    "May 26 – Eleven years after its foundation, a group of 12 purely industrial stocks were chosen to form the Dow Jones Industrial Average. The index is composed entirely of industrial shares for the first time.[5]",
    "May 27 – St. Louis–East St. Louis tornado: The costliest and third deadliest tornado in U.S. history levels a mile wide swath of downtown St. Louis, Missouri, incurring US$2.9 billion (1997 USD) in normalized damages, killing more than 255 and injuring over 1,000 people.",
    "June 4 – The Ford Quadricycle, the first vehicle Henry Ford developed, is completed, eventually leading Ford to build the empire that \"put America on wheels\".",
    "June 7 – Mahdist War – Battle of Ferkeh: British and Egyptian troops are victorious.",
    "June 12 – J.T. Hearne sets a record for the earliest date of taking 100 wickets in cricket (it is equalled by Charlie Parker in 1931).",
    "June 15 – The 8.5 Mw Sanriku earthquake and tsunami kills 22,000 in northeastern Japan.",
    "June 18 – The New York Telephone Company is formed, succeeding the Metropolitan Telephone and Telegraph Company, to control telephone service within New York City.[6]",
    "June 23 – Liberal leader Wilfrid Laurier defeats Charles Tupper during Canadian federal elections for the 8th Canadian Parliament, to become the first Francophone Prime Minister of Canada.",
    "June 28 – Twin Shaft disaster: An explosion in the Newton Coal Company's Twin Shaft Mine in Pittston, Pennsylvania results in a massive cave-in that kills 58 miners.[7][8][9]",
    "July 9 – William Jennings Bryan delivers his Cross of Gold speech at the Democratic National Convention, which nominates him for president of the United States.",
    "July 11 – Wilfrid Laurier becomes Canada's seventh prime minister, and the first French-speaker to hold that office.",
    "July 21 – In Washington, D.C., in response to a \"call to confer\" issued by Josephine St. Pierre Ruffin to all women of color, the National Association of Colored Women's Clubs is organized.",
    "July 26 – The International Socialist Workers and Trade Union Congress opens in London.",
    "July 27 – A causeway is opened between the islands of Saaremaa and Muhu in Estonia.",
    "July 30 – Atlantic City rail crash: Shortly after 6:30 pm, at a crossing just west of Atlantic City, New Jersey, two trains collide, crushing five loaded passenger coaches, killing 50 and seriously injuring approximately sixty.",
    "August – The 1896 Eastern North America heat wave kills 1,500 people from Chicago, Illinois to Boston, Massachusetts.",
    "August 1 – The Park Seung-jik Shop, as predecessor of South Korean conglomerate enterprises, Doosan Group founded in former Kingdom of Korea.[page needed]",
    "August 14 – The Uganda Railway Act, 1896, is approved in the United Kingdom, for construction of a railway in Africa, from Mombasa to Lake Victoria.[10][11]",
    "August 16 – Skookum Jim Mason, George Carmack and Dawson Charlie discover gold in the Klondike, Yukon.",
    "August 17 – Bridget Driscoll is run over by a Benz car on the grounds of The Crystal Palace, London (the world's first motoring fatality).",
    "August 23 – The Cry of Pugad Lawin initiates the Philippine Revolution.",
    "August 27\nThe shortest war in recorded history, the Anglo-Zanzibar War, starts at 9:00 in the morning, and lasts for 45 minutes of shelling.\nBritain establishes a Protectorate over the Ashanti concluding the Fourth Anglo-Ashanti War.",
    "The shortest war in recorded history, the Anglo-Zanzibar War, starts at 9:00 in the morning, and lasts for 45 minutes of shelling.",
    "Britain establishes a Protectorate over the Ashanti concluding the Fourth Anglo-Ashanti War.",
    "September 2 – Clarkson University holds its first classes, with 17 students attending in Potsdam, New York.[12]",
    "September 15 – The Crash at Crush train wreck stunt is held in Texas.",
    "September 22 – Queen Victoria surpasses her grandfather King George III as the longest-reigning monarch in British history.",
    "September 28 – Pathé or Pathé Frères a French film company and one of the oldest film companies is founded by the brothers Charles Pathé, Théophile Pathé, Émile Pathé and Jacques Pathé.",
    "September 30 – Italy and France sign a treaty, whereby Italy virtually recognizes Tunisia as a French dependency.[13]",
    "October 1 – Gottlieb Daimler builds the first worldwide gasoline truck.",
    "October 2 – The Victorian Football League is established as Aussie rules football in Australia (a predecessor for the Australian Football League).",
    "October 16 – The design of the flag of Knoxville, Tennessee is officially approved by the Knoxville City Council.",
    "October 30 – Augusta, Kentucky: The Augusta High School cornerstone is laid, marking the end of the Augusta Methodist College.",
    "November 3 – 1896 U.S. presidential election: Republican William McKinley defeats William Jennings Bryan. The event is viewed by some as a political realignment for the United States Republican Party.",
    "November 27 – Also sprach Zarathustra (Strauss) is first performed in Frankfurt.",
    "November 30\nThe Udinese Calcio is founded.\nSt. Augustine Monster: A large carcass, later postulated to be the remains of a gigantic octopus, is found washed ashore near St. Augustine, Florida.",
    "The Udinese Calcio is founded.",
    "St. Augustine Monster: A large carcass, later postulated to be the remains of a gigantic octopus, is found washed ashore near St. Augustine, Florida.",
    "December 1 – Archaeologist Alois Anton Führer, Nepalese General Khadga Samsher Rana, and an expedition, rediscover the great stone pillar of Ashoka at Lumbini, traditionally the spot of the birthplace of Gautama Buddha, after using Faxian's records.[14]",
    "December 10\nNew York Aquarium opens.\nThe premiere of Alfred Jarry's absurdist play Ubu Roi in Paris causes a near-riot.",
    "New York Aquarium opens.",
    "The premiere of Alfred Jarry's absurdist play Ubu Roi in Paris causes a near-riot.",
    "December 14 – The Glasgow Subway, the third-oldest underground metro system in the world, opens.",
    "December 25 – John Philip Sousa composes his magnum opus, The Stars and Stripes Forever.",
    "December 30 – José Rizal, Filipino scholar and poet, is executed by Spanish authorities in the Philippines.",
    "The Pontifical University of Maynooth is established by decree of the Vatican.",
    "France establishes an administrative post in Abengourou, Ivory Coast.",
    "Sperry & Hutchinson begin offering S&H Green Stamps to U.S. retailers.",
    "Devonport High School for Boys is founded (in Plymouth, UK)",
    "Blackpool Pleasure Beach, a popular English theme park (Britain's Biggest Tourist Attraction), is founded by Alderman William George Bean.",
    "A school of mines opens in Kimberley and will later form the core of the University of the Witwatersrand.",
    "Racing Club de Lyon, a football club in France, is officially founded and becomes a predecessor for Olympique Lyonnais.[citation needed]",
    "A pharmaceutical and healthcare brand Hoffmann-La Roche was founded in Switzerland.[page needed]"
  ],
  "births": [
    "January 1 – Hankyu Sasaki, Japanese admiral (d. 1971)",
    "January 2 – Dziga Vertov, Russian filmmaker (d. 1954)",
    "January 4\nEverett Dirksen, American politician (d. 1969)\nAndré Masson, French artist (d. 1987)",
    "Everett Dirksen, American politician (d. 1969)",
    "André Masson, French artist (d. 1987)",
    "January 8\nArthur Ford, American psychic spiritual medium, clairaudient (d. 1971)\nClifton Sprague, American admiral (d. 1955)",
    "Arthur Ford, American psychic spiritual medium, clairaudient (d. 1971)",
    "Clifton Sprague, American admiral (d. 1955)",
    "January 12 – Uberto De Morpurgo, Italian tennis player (d. 1961)[15]",
    "January 14 – John Dos Passos, American author (d. 1970)[16]",
    "January 18 – C. M. Eddy, Jr., American author (d. 1967)",
    "January 20 – George Burns, American actor, comedian (d. 1996)",
    "January 21 – J. Carrol Naish, American character actor (d. 1973)",
    "January 23 – Charlotte, Grand Duchess of Luxembourg (d. 1985)",
    "January 26 – József Kiss, Austro-Hungarian fighter pilot (d. 1918)",
    "January 31 – Olive Carey, American actress (d. 1988)",
    "February 2 – Ramón Franco, Spanish aviation pioneer (d. 1938)",
    "February 4 – Friedrich Hund, German physicist (d. 1997)",
    "February 7 – Bonner Fellers, United States Army general (d. 1973)",
    "February 16 – Eugénie Blanchard, French supercentenarian (d. 2010)",
    "February 18 – Li Linsi, Chinese educator and diplomat (d. 1970)",
    "February 19 – André Breton, French writer (d. 1966)[17]",
    "February 21 - Homa J. Porter, Texas businessman and political activist (d. 1986)",
    "February 23 – Herbert Weichmann, German politician, mayor of Hamburg (d. 1983)",
    "February 25 – Heinrich Gontermann, German World War I fighter ace (d. 1917)",
    "February 28 – Philip Showalter Hench, American physician, recipient of the Nobel Prize in Physiology or Medicine (d. 1965)",
    "February 29\nMorarji Desai, Indian politician (d. 1995)\nWilliam A. Wellman, American motion picture director (d. 1975)",
    "Morarji Desai, Indian politician (d. 1995)",
    "William A. Wellman, American motion picture director (d. 1975)",
    "March 1 – Dimitri Mitropoulos, Greek conductor, pianist and composer (d. 1960)",
    "March 13 – Field Eugene Kindley, American World War I fighter pilot (d. 1920)",
    "March 20 – Wop May, Canadian World War I pilot (d. 1952)",
    "March 22 – Joseph Schildkraut, Austrian-American actor (d. 1964)",
    "March 29 – Wilhelm Ackermann, German mathematician (d. 1962)",
    "Edwin Eugene Aldrin, American aviator and army colonel (d. 1974)",
    "April 13 – Ira C. Eaker, World War II United States Army Air Forces general (d. 1987)",
    "April 15\nGerhard Fieseler, German World War I flying ace, aerobatics champion, aircraft designer and manufacturer (d. 1987)\nNikolay Semyonov, Russian chemist, Nobel Prize laureate (d. 1986)",
    "Gerhard Fieseler, German World War I flying ace, aerobatics champion, aircraft designer and manufacturer (d. 1987)",
    "Nikolay Semyonov, Russian chemist, Nobel Prize laureate (d. 1986)",
    "April 16 – Árpád Weisz, Hungarian footballer (d. 1944)",
    "April 17 – Señor Wences, Spanish ventriloquist (d. 1999)",
    "April 21\nRalph Hungerford, 33rd Governor of American Samoa (d. 1977)\nGeertruida Wijsmuller-Meijer, Dutch war hero, resistance fighter and humanitarian (d. 1978)",
    "Ralph Hungerford, 33rd Governor of American Samoa (d. 1977)",
    "Geertruida Wijsmuller-Meijer, Dutch war hero, resistance fighter and humanitarian (d. 1978)",
    "April 26 – Ernst Udet, German World War I fighter ace, Nazi Luftwaffe official (d. 1941)",
    "April 27 – Rogers Hornsby, American baseball player (d. 1963)",
    "April 30\nHans List, Austrian founder of the AVL List (d. 1996)\nGary Davis, American musician (d. 1972)",
    "Hans List, Austrian founder of the AVL List (d. 1996)",
    "Gary Davis, American musician (d. 1972)",
    "May 1\nMark W. Clark, American general (d. 1984)\nJ. Lawton Collins, American general (d. 1987)",
    "Mark W. Clark, American general (d. 1984)",
    "J. Lawton Collins, American general (d. 1987)",
    "May 2 – Helen of Greece and Denmark, Queen Mother of Romania (d. 1982)",
    "May 3 – Karl Allmenröder, German World War I fighter pilot (d. 1917)",
    "May 5 – Kaju Sugiura, Japanese admiral (d. 1945)",
    "May 6 – Rolf Maximilian Sievert, Swedish medical physicist (d. 1966)",
    "May 7 – John Dunville, British Army officer in World War I (d. 1917)",
    "May 19 – Jorge Alessandri, 27th President of Chile (d. 1986)",
    "May 24 – Fernando Soler, Mexican actor, director, screenwriter, and producer (d. 1979)",
    "May 30 – Howard Hawks, American director (d. 1977)",
    "June 6\nHenry Allingham, British World War I veteran, world's oldest man (d. 2009)\nItalo Balbo, Italian Fascist leader, aviator (d. 1940)",
    "Henry Allingham, British World War I veteran, world's oldest man (d. 2009)",
    "Italo Balbo, Italian Fascist leader, aviator (d. 1940)",
    "June 7\nRobert S. Mulliken, American chemist, Nobel Prize laureate (d. 1986)\nImre Nagy, 3-time Prime Minister of Hungary (d. 1958)\nDouglas Campbell, American World War I flying ace (d. 1990)\nHope Summers, American actress (d. 1979)",
    "Robert S. Mulliken, American chemist, Nobel Prize laureate (d. 1986)",
    "Imre Nagy, 3-time Prime Minister of Hungary (d. 1958)",
    "Douglas Campbell, American World War I flying ace (d. 1990)",
    "Hope Summers, American actress (d. 1979)",
    "June 19 – Wallis Simpson, American-born Duchess of Windsor (d. 1986)",
    "June 23 – Francisco Malabo Beosá, Equatoguinean royalty (d. 2001)",
    "June 25\nAlfred Anderson, Scottish joiner and veteran of the First World War (d. 2005)\nKeizō Komura, Japanese admiral (d. 1978)",
    "Alfred Anderson, Scottish joiner and veteran of the First World War (d. 2005)",
    "Keizō Komura, Japanese admiral (d. 1978)",
    "June 28 – Constance Binney, American actress (d. 1989)",
    "June 29 – Boris Podolsky, Russian-American physicist (d. 1966)",
    "July 2 – Quirino Cristiani, Argentine animated film director (d. 1984)",
    "July 4 – Mao Dun, Chinese novelist, cultural critic, and Minister of Culture (d. 1981)[18]",
    "July 5 – Thomas Playford IV, South Australian politician (d. 1981)",
    "July 7 – Harold Beamish, New Zealand World War I flying ace (d. 1986)",
    "July 8 – James B. Wilson, American football player, coach (d. 1986)",
    "July 9\nThomas Barlow, American professional basketball player (d. 1983)\nCullen Landis, American actor and director (d. 1975)",
    "Thomas Barlow, American professional basketball player (d. 1983)",
    "Cullen Landis, American actor and director (d. 1975)",
    "July 10\nStefan Askenase, Polish-Belgian classical pianist and pedagogue (d. 1985)\nMaurice Zbriger, Canadian violinist, composer and conductor (d. 1981)",
    "Stefan Askenase, Polish-Belgian classical pianist and pedagogue (d. 1985)",
    "Maurice Zbriger, Canadian violinist, composer and conductor (d. 1981)",
    "July 13\nMordecai Ardon, Israeli painter (d. 1992)\nJohn Henry Cates, American businessman, political figure (d. 1986)",
    "Mordecai Ardon, Israeli painter (d. 1992)",
    "John Henry Cates, American businessman, political figure (d. 1986)",
    "July 14 – Grigore Bălan, Romanian general (d. 1944)",
    "July 15 – Gladys Edgerly Bates, American sculptor (d. 2003)",
    "July 16\nLéon Weil, French veteran of World War I (d. 2006)\nGertrude Welcker, German actress (d. 1988)\nTrygve Lie, Norway-born United Nations Secretary General (d. 1968)",
    "Léon Weil, French veteran of World War I (d. 2006)",
    "Gertrude Welcker, German actress (d. 1988)",
    "Trygve Lie, Norway-born United Nations Secretary General (d. 1968)",
    "July 17 – Dumitru Dămăceanu, Romanian general and politician (d. 1978)",
    "July 18\nThelma Payne, American diver (d. 1988)\nPatrick O'Boyle, American prelate (d. 1987)",
    "Thelma Payne, American diver (d. 1988)",
    "Patrick O'Boyle, American prelate (d. 1987)",
    "July 19 – Stafford L. Warren, American physician and radiologist; inventor of the mammogram (d. 1981)",
    "July 20 – Ellen Louise Mertz, Denmark's first female geologist (d. 1987)",
    "July 21 – Gladys Hulette, American actress (d. 1991)",
    "July 27 – Henri Longchambon, French politician (d. 1969)",
    "July 28 – Vasile Chițu, Romanian general (d. 1968)",
    "August 9\nErich Hückel, German physicist, physical chemist (d. 1980)\nJean Piaget, Swiss psychologist (d. 1980)\nLéonide Massine, Russian ballet dancer, choreographer (d. 1979)",
    "Erich Hückel, German physicist, physical chemist (d. 1980)",
    "Jean Piaget, Swiss psychologist (d. 1980)",
    "Léonide Massine, Russian ballet dancer, choreographer (d. 1979)",
    "August 12 – Ejner Federspiel, Danish actor (d. 1981)",
    "August 13 – Rudolf Schmundt, German general (d. 1944)",
    "August 14 – Albert Ball, British World War I fighter ace, Victoria Cross recipient (d. 1917)",
    "August 15\nGerty Cori, Austrian-born biochemist, recipient of the Nobel Prize in Physiology or Medicine (d. 1957)\nPaul Outerbridge, American photographer (d. 1958)",
    "Gerty Cori, Austrian-born biochemist, recipient of the Nobel Prize in Physiology or Medicine (d. 1957)",
    "Paul Outerbridge, American photographer (d. 1958)",
    "August 18 – Jack Pickford, Canadian-born American actor, film director, and producer (d. 1933)",
    "August 22 – W. E. Lawrence, American actor (d. 1947)",
    "August 26 – Besse Cooper, American supercentenarian, last surviving person born in 1896 (d. 2012)",
    "August 27 – Léon Theremin, Russian inventor (d. 1993)",
    "August 28\nMorris Ankrum, American actor (d. 1964)\nArthur Calwell, Australian politician (d. 1973)",
    "Morris Ankrum, American actor (d. 1964)",
    "Arthur Calwell, Australian politician (d. 1973)",
    "August 30 – Raymond Massey, Canadian-born American actor (d. 1983)",
    "September 1 – A. C. Bhaktivedanta Swami Prabhupada, Indian religious leader, founder-acharya of the International Society for Krishna Consciousness (d. 1977)",
    "September 4 – Antonin Artaud, French stage actor, director (d. 1948)",
    "September 8 – Marion Allnutt, welfare worker and full-time secretary and commanding officer of the NGO, Women's Australian National Services (WANS) (d. 1980)",
    "September 10 – Adele Astaire, American dancer (d. 1981)",
    "September 14 – Fray José de Guadalupe Mojica, Mexican Franciscan friar, tenor and film actor (d. 1974)",
    "September 15 – Robert B. McClure, American general (d. 1973)",
    "September 21 – Walter Breuning, American supercentenarian; last known surviving male born in 1896 (d. 2011)",
    "September 22 – Uri Zvi Greenberg, Israeli poet and journalist (d. 1981)[19]",
    "September 24 – F. Scott Fitzgerald, American writer (d. 1940)[20]",
    "September 25 – Sandro Pertini, President of Italy (d. 1990)",
    "September 30 – Jolie Gabor, Hungarian-American entrepreneur, jeweler and memoirist (d. 1997)",
    "October 1 – Abraham Sofaer, Burmese-born actor (d. 1988)",
    "October 3 – Auvergne Doherty, Australian businesswoman (d. 1961)",
    "October 7 – Paulino Alcántara, Filipino-Spanish soccer player (d. 1964)",
    "October 12 – Eugenio Montale, Italian writer, Nobel Prize laureate (d. 1981)[21]",
    "October 14 – Bud Flanagan, British entertainer, comedian (d. 1968)",
    "October 17 – Prince Roman Petrovich of Russia (d. 1978)",
    "October 22 – Earle Clements, American politician, Governor of Kentucky (1947–1950), Senate Whip",
    "October 27 – Edith Haisman, South African-born RMS Titanic survivor (d. 1997)",
    "October 28 – Howard Hanson, American composer (d. 1981)",
    "October 30 – Ruth Gordon, American actress, screenwriter, and playwright (d. 1985)",
    "October 31 – Ethel Waters, American singer, actress (d. 1977)",
    "November 4\nCarlos P. Garcia, 8th President of the Philippines (d. 1971)\nIan Wolfe, American actor (d. 1992)",
    "Carlos P. Garcia, 8th President of the Philippines (d. 1971)",
    "Ian Wolfe, American actor (d. 1992)",
    "November 8\nErika Abels d'Albert, Austrian artist (d. 1975)\nBucky Harris, American baseball player (d. 1977)\nMarie Prevost, Canadian-born American actress (d. 1937)",
    "Erika Abels d'Albert, Austrian artist (d. 1975)",
    "Bucky Harris, American baseball player (d. 1977)",
    "Marie Prevost, Canadian-born American actress (d. 1937)",
    "November 10\nJimmy Dykes, American baseball player, manager (d. 1976)\nMary, Lady Heath (born Sophie Mary Peirce-Evans), Irish aviator (d. 1939)\nAndreas Stihl, Swiss engineer, inventor and businessman (d. 1973)",
    "Jimmy Dykes, American baseball player, manager (d. 1976)",
    "Mary, Lady Heath (born Sophie Mary Peirce-Evans), Irish aviator (d. 1939)",
    "Andreas Stihl, Swiss engineer, inventor and businessman (d. 1973)",
    "November 13 – Nobusuke Kishi, Prime Minister of Japan (d. 1987)",
    "November 14 – Mamie Eisenhower, First Lady of the United States (d. 1979)",
    "November 15 – Giovanni Ancillotto, Italian World War I flying ace (d. 1924)",
    "November 16\nJim Jordan, American actor (d. 1988)\nOswald Mosley, leader of the British Union of Fascists (d. 1980)\nLawrence Tibbett, American opera singer, actor (d. 1960)",
    "Jim Jordan, American actor (d. 1988)",
    "Oswald Mosley, leader of the British Union of Fascists (d. 1980)",
    "Lawrence Tibbett, American opera singer, actor (d. 1960)",
    "November 17 – Lev Vygotsky, Russian psychologist (d. 1934)",
    "November 23 – Klement Gottwald, Czechoslovak communist politician (d. 1953)",
    "November 25\nVirgil Thomson, American composer, critic (d. 1989)\nJessie Royce Landis, American actress (d. 1972)\nPriscilla Dean, American actress (d. 1987)\nAlbertus Soegijapranata, Indonesian Jesuit priest (d. 1963)",
    "Virgil Thomson, American composer, critic (d. 1989)",
    "Jessie Royce Landis, American actress (d. 1972)",
    "Priscilla Dean, American actress (d. 1987)",
    "Albertus Soegijapranata, Indonesian Jesuit priest (d. 1963)",
    "November 26 – Manuel A. Odría, 79th President of Peru (d. 1974)",
    "November 28 – Lilia Skala, Austrian-American actress (d. 1994)",
    "December 1 – Georgi Zhukov, Soviet military leader, Marshal of the Soviet Union (d. 1974)",
    "December 2 – Alfons Tracki, German-Albanian priest (martyred 1946)",
    "December 5 – Carl Ferdinand Cori, Austrian-born biochemist, recipient of the Nobel Prize in Physiology or Medicine (d. 1984)",
    "December 6 – Ira Gershwin, American lyricist (d. 1983)",
    "December 8 – Christl Mardayn, German actress (d. 1976)",
    "December 12 – Vasily Gordov, Soviet general (d. 1950)",
    "December 14 – Jimmy Doolittle, American aviation pioneer, World War II United States Army Air Forces general (d. 1993)",
    "December 15 – Miles Dempsey, British general (d. 1969)",
    "December 16 – Anna Anderson, pretender to the Russian throne (d. 1984)",
    "December 17 – Robert Francis Anthony Studds, American admiral and engineer, fourth Director of the United States Coast and Geodetic Survey (d. 1962)",
    "December 21\nLeroy Robertson, American composer (d. 1971)\nEleni Skoura, Greek politician (d. 1991)",
    "Leroy Robertson, American composer (d. 1971)",
    "Eleni Skoura, Greek politician (d. 1991)",
    "December 23 – Giuseppe Tomasi di Lampedusa, Italian writer (d. 1957)",
    "December 27 –\nLouis Bromfield, American writer (d. 1956)\nCarl Zuckmayer, German writer, playwright (d. 1977)",
    "Louis Bromfield, American writer (d. 1956)",
    "Carl Zuckmayer, German writer, playwright (d. 1977)",
    "December 28 – Roger Sessions, American composer (d. 1985)",
    "December 29 – David Alfaro Siqueiros, Mexican muralist (d. 1974)[22]",
    "Ion Constantinescu, Romanian general (death date unknown)",
    "Lawrence Riley, American playwright and screenwriter (d. 1974)"
  ],
  "deaths": [
    "January 4 – Joseph Hubert Reinkens, German Old Catholic bishop (b. 1821)",
    "January 5 – Charlie Bassett, American sheriff (b. 1847)",
    "January 6 – Thomas W. Knox, American author, journalist (b. 1835)",
    "January 8 – Paul Verlaine, French lyric poet (b. 1844)[23]",
    "January 15 – Mathew Brady, American photographer (b. 1822)",
    "January 18 – Charles Floquet, Prime Minister of France (b. 1828)",
    "January 20\nPrince Henry of Battenberg, Lombardy-born British royal, married to Princess Beatrice of the United Kingdom (b. 1858)\nGraciano López Jaena, Filipino journalist, writer and patriot (b. 1856)",
    "Prince Henry of Battenberg, Lombardy-born British royal, married to Princess Beatrice of the United Kingdom (b. 1858)",
    "Graciano López Jaena, Filipino journalist, writer and patriot (b. 1856)",
    "February 7 – William Hayden English, American politician (b. 1822)",
    "February 25 – Joseph P. Fyffe, American admiral (b. 1832)",
    "March 30 – Charilaos Trikoupis, 7-time Prime Minister of Greece (b. 1832)",
    "April 9 – Gustav Koerner, German-American statesman (b. 1809)",
    "April 27 – Sir Henry Parkes, Australian politician, Premier of New South Wales (b. 1815)",
    "April 30 – Hamilton Disston, American industrialist and land developer (b. 1844)",
    "May 1 – Naser al-Din Shah Qajar, Shah of Persia, King of Herat (b. 1831)",
    "May 7 – H. H. Holmes, American serial killer (executed) (b. 1861)",
    "May 10 – Antti Ahlström, Finnish industrialist, founder of Ahlstrom (b. 1827)",
    "May 13 – Nora Perry, American newspaper correspondent (b. 1831)",
    "May 17 – Muhammad Al-Sabah, emir of Kuwait (b. 1831)",
    "May 18 – Daniel Pollen, 9th Prime Minister of New Zealand (b. 1813)",
    "May 19 – Archduke Karl Ludwig of Austria, father of Archduke Ferdinand (b. 1833)",
    "May 20 – Clara Schumann, German composer, pianist (b. 1819)",
    "May 24 – Luigi Federico Menabrea, Italian soldier, statesman (b. 1809)",
    "June 19 – Louis Brière de l'Isle, French general (b. 1827)",
    "July 1 – Harriet Beecher Stowe, American author (b. 1811)[24]",
    "July 4 – Marcelo H. del Pilar, Filipino writer, journalist (b. 1850)",
    "July 11 – Ernst Curtius, German historian (b. 1814)[25]",
    "July 13 – August Kekulé, German chemist (b. 1829)",
    "July 16 – Edmond de Goncourt, French writer, co-founder of the Académie Goncourt (b. 1822)[26]",
    "July 19 – Abraham H. Cannon, American Mormon apostle (b. 1859)",
    "August 10 – Otto Lilienthal, German aviation pioneer (b. 1848)",
    "August 12 – Sir Harry Burnett Lumsden, British army general (b. 1821)",
    "August 13 – Sir John Everett Millais, British Pre-Raphaelite painter (b. 1829)",
    "August 17 – Bridget Driscoll, early British automobile fatality (b. c. 1851)",
    "August 18 – Richard Avenarius, German-Swiss philosopher (b. 1843)",
    "August 25 – Sultan Hamad bin Thuwaini of Zanzibar (b. 1857)",
    "September 18 – Hippolyte Fizeau, French physicist (b. 1819)",
    "September 22 – Pavlos Kalligas, Greek jurist, politician (b. 1814)",
    "September 23 – Ivar Aasen, Norwegian philologist, lexicographer, playwright, and poet (b. 1813)[27]",
    "September 24 – Louis Gerhard De Geer, 1st Prime Minister of Sweden (b. 1818)",
    "October 3 – William Morris, English designer, poet and political activist (b. 1834)[28]",
    "October 6 – Sir James Abbott, British army officer and colonial administrator in India (b. 1807)",
    "October 7 – Louis-Jules Trochu, French general and politician, 26th Prime Minister of France (b. 1815)",
    "October 8 – George du Maurier, French-born British cartoonist and writer (b. 1834)[29]",
    "October 10 – Ferdinand von Mueller, German-born Australian botanist (b. 1825)",
    "October 11\nAnton Bruckner, Austrian composer (b. 1824)\nEdward White Benson, Archbishop of Canterbury (b. 1829)",
    "Anton Bruckner, Austrian composer (b. 1824)",
    "Edward White Benson, Archbishop of Canterbury (b. 1829)",
    "October 12 – Christian Emil Krag-Juel-Vind-Frijs, Prime Minister of Denmark (b. 1817)",
    "October 19 – Emmy Rappe, Swedish nursing pioneer (b. 1835)",
    "October 21 – James Henry Greathead, British engineer and inventor (b. 1844)",
    "October 23 – Columbus Delano, American statesman (b. 1809)",
    "October 26 – Paul-Armand Challemel-Lacour, French statesman (b. 1827)",
    "October 30 – Carol Benesch, Silesian and Romanian architect (b. 1822)",
    "November – Margaret Eleanor Parker, English social activist; first president of the British Women's Temperance Association (b. 1827)",
    "November 12 – Joseph James Cheeseman, Liberian politician, 12th President of Liberia (b. 1843)",
    "November 16 – Josip Šokčević, Croatian viceroy (b. 1811)",
    "November 22 – George Washington Gale Ferris Jr., American inventor of the Ferris wheel (b. 1859)",
    "November 23 – Ichiyō Higuchi, Japanese poet and novelist (b. 1872)[30]",
    "November 26\nBenjamin Apthorp Gould, American astronomer (b. 1824)\nCoventry Patmore, English poet (b. 1823)[31]",
    "Benjamin Apthorp Gould, American astronomer (b. 1824)",
    "Coventry Patmore, English poet (b. 1823)[31]",
    "December 10 – Alfred Nobel, Swedish inventor of dynamite, creator of the Nobel Prize (b. 1833)[32]\nJacob ben Moses Bachrach, noted Polish apologist of Rabbinic Judaism (b. 1824)\nSir Alexander Milne, 1st Baronet, British admiral of the fleet (b. 1806)",
    "Jacob ben Moses Bachrach, noted Polish apologist of Rabbinic Judaism (b. 1824)",
    "Sir Alexander Milne, 1st Baronet, British admiral of the fleet (b. 1806)",
    "December 30 – José Rizal, national hero of the Philippines (b. 1861)"
  ]
}